{
  "#1": "Phrases in basic/Main.tsx",
  "Using Testnet Bitcoin": "Usando Bitcoin Testnet",
  "#2": "Phrases in basic/BookPage/index.tsx",
  "Chart": "Gráfico",
  "List": "Lista",
  "Map": "Mapa",
  "Search": "Pesquisa",
  "#3": "Phrases in basic/MakerPage/index.tsx",
  "Existing orders match yours!": "Existem ordens correspondentes!",
  "#4": "Phrases in basic/NavBar/AppBar/index.tsx",
  "Garage": "Garagem",
  "Offers": "Ofertas",
  "#5": "Phrases in basic/NavBar/DesktopBar/MoreTooltip.tsx",
  "Community and public support": "Comunidade e suporte público",
  "Exchange summary": "Resumo da Exchange",
  "Learn RoboSats": "Aprender sobre o RoboSats",
  "RoboSats information": "Informações do RoboSats",
  "client for nerds": "cliente para nerds",
  "#6": "Phrases in basic/NavBar/DesktopBar/index.tsx",
  "Create": "Criar",
  "More": "Mais",
  "Order": "Ordem",
  "Settings": "Ajustes",
  "#7": "Phrases in basic/OrderPage/index.tsx",
  "Contract": "Contrato",
  "Finish": "Concluir",
  "Publish": "Publicar",
  "Setup": "Configurar",
  "Take": "Pegar",
  "Trade": "Negociar",
  "Wait": "Aguardar",
  "#8": "Phrases in basic/RobotPage/Onboarding.tsx",
  "1. Generate a token": "1. Gerar um token",
  "2. Meet your robot identity": "2. Conheça a identidade do seu robô",
  "3. Browse or create an order": "3. Navegue ou crie uma ordem",
  "Building your robot!": "Criando seu robô!",
  "Continue": "Continuar",
  "Generate token": "Gerar token",
  "Hi! My name is": "Olá! Meu nome é",
  "If you need help on your RoboSats journey join our public support": "Se você precisar de ajuda em sua jornada no RoboSats, junte-se ao nosso suporte público",
  "RoboSats is a peer-to-peer marketplace. You can browse the public offers or create a new one.": "RoboSats é um mercado peer-to-peer. Você pode navegar nas ofertas públicas ou criar uma nova.",
  "See profile": "Ver perfil",
  "Store it somewhere safe!": "Guarde-o em um lugar seguro!",
  "Telegram group": "Grupo do Telegram",
  "This is your trading avatar": "Este é seu avatar para negociação",
  "This temporary key gives you access to a unique and private robot identity for your trade.": "Esta chave temporária dá acesso a uma identidade de robô única e privada para sua negociação.",
  "You can also add your own random characters into the token or": "Você também pode adicionar seus próprios caracteres aleatórios ao token ou",
  "or visit the robot school for documentation.": "ou visite a escola de robôs para documentação.",
  "roll again": "Girar novamente",
  "#9": "Phrases in basic/RobotPage/RobotProfile.tsx",
  "Active order #{{orderID}}": "Ordem ativa #{{orderID}}",
  "Add Robot": "Adicionar Robô",
  "Building...": "Criando...",
  "Claim Rewards": "Claim Rewards",
  "Delete Robot": "Deletar Robô",
  "Last order #{{orderID}}": "Última ordem #{{orderID}}",
  "Looking for orders!": "Procurando por ordens!",
  "No existing orders found": "Nenhuma ordem existente encontrada",
  "Reusing trading identity degrades your privacy against other users, coordinators and observers.": "Reutilizar a identidade de negociação degrada sua privacidade contra outros usuários, coordenadores e observadores.",
  "Robot Garage": "Garagem de Robôs",
  "Store your token safely": "Guarde seu token de forma segura",
  "#10": "Phrases in basic/RobotPage/TokenInput.tsx",
  "Copied!": "Copiado!",
  "Not enough entropy, make it more complex": "Entropia insuficiente, torne-a mais complexa",
  "The token is too short": "O token é muito curto",
  "#11": "Phrases in basic/RobotPage/Welcome.tsx",
  "A Simple and Private LN P2P Exchange": "Uma Exchange P2P LN Simples e Privada",
  "Create a new robot and learn to use RoboSats": "Crie um novo robô e aprenda a usar o RoboSats",
  "Fast Generate Order": "Gerar Pedido Rápido",
  "Recover an existing robot using your token": "Recupere um robô existente usando seu token",
  "Recovery": "Recuperação",
  "Start": "Iniciar",
  "#12": "Phrases in basic/SettingsPage/Coordinators.tsx",
  "Coordinators": "Coordenadores",
  "#13": "Phrases in basic/TopBar/index.tsx",
  "You need to enable nostr to receive notifications.": "You need to enable nostr to receive notifications.",
  "#14": "Phrases in basic/TopBar/MenuDrawer/index.tsx",
  "Client info": "Client info",
  "Community": "Comunidade",
  "Connected to Tor network": "Conectado à rede Tor",
  "Connecting to Tor network": "Conectando à rede Tor",
  "Connection error": "Erro de conexão",
  "Initializing Tor daemon": "Inicializando o daemon Tor",
  "RoboSats": "RoboSats",
  "#15": "Phrases in components/BookTable/BookControl.tsx",
  "ANY": "QUALQUER",
  "Buy": "Comprar",
  "DESTINATION": "DESTINO",
  "I want to": "Eu quero",
  "METHOD": "MÉTODO",
  "Select Host": "Selecione Host",
  "Select Order Type": "Selecione Tipo de Ordem",
  "Select Payment Currency": "Selecione a moeda de pagamento",
  "Select Payment Method": "Selecione método de pagamento",
  "Sell": "Vender",
  "Swap In": "Swap In",
  "Swap Out": "Swap Out",
  "and use": "e utilizar",
  "hosted by": "hospedado por",
  "pay with": "pagar com",
  "#16": "Phrases in components/BookTable/index.tsx",
  "Add filter": "Adicionar filtro",
  "Amount": "Quantidade",
  "An error occurred.": "Ocorreu um erro.",
  "And": "E",
  "Be the first one to create an order": "Seja o primeiro a criar um pedido",
  "Bond": "Título",
  "Column title": "Título da coluna",
  "Columns": "Colunas",
  "Currency": "Moeda",
  "Delete": "Deletar",
  "Destination": "Destino",
  "Expiry": "Expira",
  "Filter": "Filtrar",
  "Filter value": "Valor do filtro",
  "Find column": "Encontrar coluna",
  "Hide": "Esconder",
  "Hide all": "Esconder tudo",
  "Is": "É",
  "Logic operator": "Operador lógico",
  "Manage columns": "Gerenciar colunas",
  "Menu": "Menu",
  "No orders found to buy BTC for {{currencyCode}}": "Nenhum pedido encontrado para comprar BTC por {{currencyCode}}",
  "No orders found to sell BTC for {{currencyCode}}": "Nenhum pedido encontrado para vender BTC por {{currencyCode}}",
  "No results found.": "Nenhum resultado encontrado.",
  "Operator": "Operador",
  "Or": "Ou",
  "Others": "Outros",
  "Pay": "Pagar",
  "Payment Method": "Método de pagamento",
  "Premium": "Prêmio",
  "Price": "Preço",
  "Reorder column": "Reordenar coluna",
  "Robot": "Robô",
  "Sats now": "Sats agora",
  "Select columns": "Selecionar colunas",
  "Show all": "Mostrar tudo",
  "Show columns": "Mostrar colunas",
  "Show filters": "Mostrar filtros",
  "Sort": "Ordenar",
  "Sort by ASC": "Ordenar por ASC",
  "Sort by DESC": "Ordenar por DESC",
  "Timer": "Temporizador",
  "Unsort": "Desordenar",
  "Value": "Valor",
  "any": "qualquer",
  "contains": "contém",
  "ends with": "termina com",
  "equals": "igual a",
  "false": "falso",
  "is": "é",
  "is after": "é após",
  "is any of": "é qualquer de",
  "is before": "é antes",
  "is empty": "é vazio",
  "is not": "não é",
  "is not empty": "não é vazio",
  "is on or after": "é em ou após",
  "is on or before": "é em ou antes",
  "no": "não",
  "starts with": "começa com",
  "true": "verdadeiro",
  "yes": "sim",
  "#17": "Phrases in components/Charts/DepthChart/index.tsx",
  "#18": "Phrases in components/Charts/MapChart/index.tsx",
  "Accept": "Aceitar",
  "By doing so, you will be fetching map tiles from a third-party provider. Depending on your setup, private information might be leaked to servers outside the RoboSats federation.": "Ao fazer isso, você estará buscando blocos de mapa de um fornecedor terceirizado. Dependendo da sua configuração, informações privadas podem ser vazadas para servidores fora da federação RoboSats.",
  "Close": "Fechar",
  "Download high resolution map?": "Baixar mapa em alta resolução?",
  "Show tiles": "Mostrar blocos",
  "#19": "Phrases in components/Charts/helpers/OrderTooltip/index.tsx",
  "#20": "Phrases in components/Dialogs/About.tsx",
  "(GitHub).": "(GitHub).",
  "(Telegram)": "(Telegram)",
  ". RoboSats developers will never contact you. The developers or the coordinators will definitely never ask for your robot token.": ". Os desenvolvedores do RoboSats nunca entrarão em contato com você. Os desenvolvedores ou os coordenadores definitivamente nunca pedirão seu token de robô.",
  "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.": "Todos eles, desde que sejam rápidos. Você pode anotar seu(s) método(s) de pagamento preferido(s). Você terá que combinar com um par que também aceite esse método. A etapa para trocar fiat tem um tempo de expiração de 24 horas antes que uma disputa seja aberta automaticamente. É altamente recomendável usar trilhos de pagamento fiduciário instantâneos.",
  "Are there trade limits?": "Existem limites de negociações?",
  "At no point, AnonymousAlice01 and BafflingBob02 have to entrust the bitcoin funds to each other. In case they have a conflict, the RoboSats coordinator will help resolving the dispute.": "Em nenhum momento, AnonymousAlice01 e BafflingBob02 precisam confiar os fundos de bitcoin um no outro. Em caso de conflito, o coordenador do RoboSats ajudará a resolver a disputa.",
  "Be aware your fiat payment provider might charge extra fees. In any case, the buyer bears the costs of sending fiat. That includes banking charges, transfer fees and foreign exchange spreads. The seller must receive exactly the amount stated in the order details.": "Esteja ciente de que seu provedor de pagamento fiduciário pode cobrar taxas extras. Em qualquer caso, o comprador arca com os custos de envio de moeda fiduciária. Isso inclui taxas bancárias, taxas de transferência e spreads de câmbio. O vendedor deve receber exatamente o valor indicado nos detalhes do pedido.",
  "Disclaimer": "Aviso",
  "During a typical order, your trading peer is the only one who can potentially guess anything about you. Keep your chat short and concise. Avoid providing non-essential information other than strictly necessary for the fiat payment.": "Durante um pedido típico, seu par de negociação é o único que pode potencialmente adivinhar algo sobre você. Mantenha seu chat curto e conciso. Evite fornecer informações não essenciais além das estritamente necessárias para o pagamento fiat.",
  "Each RoboSats coordinator will set a maximum trade size to minimize the hassle of lightning routing failures. There is no limits to the number of trades per day. A robot can only have one order at a time. However, you can use multiple robots simultaneously using the Robot garage. Remember to back up your robot tokens!": "Cada coordenador do RoboSats definirá um tamanho máximo de negociação para minimizar o incômodo de falhas de roteamento lightning. Não há limites para o número de negociações por dia. Um robô pode ter apenas uma ordem por vez. No entanto, você pode usar vários robôs simultaneamente usando a garagem de robôs. Lembre-se de fazer backup de seus tokens de robô!",
  "How does it work?": "Como funciona?",
  "How it works": "Como funciona",
  "How to use": "Como utilizar",
  "In many countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply.": "Em muitos países, usar RoboSats não é diferente de usar Ebay ou Craigslist. A regulamentação pode variar. É sua responsabilidade cumprir.",
  "Is RoboSats legal in my country?": "O RoboSats é legal no meu país?",
  "Is RoboSats private?": "O RoboSats é privado?",
  "It is a BTC/FIAT peer-to-peer exchange over lightning.": "É uma troca peer-to-peer BTC/FIAT sobre lightning.",
  "It simplifies matchmaking and minimizes the need of trust. RoboSats focuses in privacy and speed.": "Simplifica o matchmaking e minimiza a necessidade de confiança. RoboSats se concentra em privacidade e velocidade.",
  "Project source code": "Código fonte do projeto",
  "RoboSats is a decentralized exchange with multiple, fully redundant, trade coordinators. The coordinator provides the infrastructure for your trade: mantains the intermediary lightning node, does book keeping, and relays your encrypted chat messages. The coordinator is also the judge in case your order enters a dispute. The coordinator is a trusted role, make sure you trust your coordinator by exploring its profile, webpage, social media and the comments from other users online.": "RoboSats é uma exchange descentralizada com múltiplos coordenadores de negociação, totalmente redundantes. O coordenador fornece a infraestrutura para sua negociação: mantém o nó relâmpago intermediário, faz a contabilidade e retransmite suas mensagens de chat criptografadas. O coordenador também é o juiz caso sua ordem entre em disputa. O coordenador é uma função de confiança, certifique-se de confiar em seu coordenador explorando seu perfil, página da web, redes sociais e os comentários de outros usuários online.",
  "RoboSats is an open source project ": "RoboSats é um projeto de código aberto ",
  "The RoboSats client, which you run on your local machine or browser, does not collect or share your IP address, location, name, or personal data. The client encrypts your private messages, which can only be decrypted by your trade partner.": "O cliente RoboSats, que você executa em sua máquina local ou navegador, não coleta ou compartilha seu endereço IP, localização, nome ou dados pessoais. O cliente criptografa suas mensagens privadas, que só podem ser descriptografadas pelo seu parceiro de negociação.",
  "The coordinator you choose will maintain a database of pseudonymous robots and orders for the application to function correctly. You can further enhance your privacy by using proxy nodes or coinjoining.": "O coordenador que você escolher manterá um banco de dados de robôs pseudônimos e ordens para que a aplicação funcione corretamente. Você pode melhorar ainda mais sua privacidade usando nós proxy ou coinjoining.",
  "The seller faces the same charge-back risk as with any other peer-to-peer service. Paypal or credit cards are not recommended.": "O vendedor enfrenta o mesmo risco de estorno de qualquer outro serviço ponto a ponto (peer-to-peer). Paypal ou cartões de crédito não são recomendados.",
  "The trade fee is collected by the robosats coordinator as a compensation for their service. You can see the fees of each coordinator by checking out their profile. The trade fee is split to be covered by both: the order maker and the order taker. Typically, the maker fee will be significantly smaller than the taker fee. In case an onchain address is used to received the Sats a variable swap fee applies. The onchain payout fee can also be seen in the profile of the coordinator.": "A taxa de negociação é coletada pelo coordenador do robosats como uma compensação pelo serviço prestado. Você pode ver as taxas de cada coordenador checando seu perfil. A taxa de negociação é dividida para ser coberta por ambos: o criador da ordem e o tomador da ordem. Normalmente, a taxa do criador será significativamente menor que a taxa do tomador. Caso um endereço onchain seja usado para receber os Sats, uma taxa de swap variável se aplica. A taxa de pagamento onchain também pode ser vista no perfil do coordenador.",
  "This is an experimental application, things could go wrong. Trade small amounts!": "Esta é uma aplicação experimental, as coisas podem dar errado. Negocie pequenas quantidades!",
  "This lightning application is provided as is. It is in active development: trade with the utmost caution. There is no private support. Support is only offered via public channels ": "Este aplicativo lightning é fornecido como está. Está em desenvolvimento ativo: negocie com a máxima cautela. Não há suporte privado. O suporte é oferecido apenas por meio de canais públicos ",
  "What are the fees?": "Quais são as taxas?",
  "What are the risks?": "Quais são os riscos?",
  "What happens if my coordinator goes offline forever?": "O que acontece se meu coordenador ficar offline para sempre?",
  "What is RoboSats?": "O que é o RoboSats?",
  "What is a coordinator?": "O que é um coordenador?",
  "What is the trust model?": "Qual é o modelo de confiança?",
  "What payment methods are accepted?": "Quais métodos de pagamento são aceitos?",
  "You can also check the full guide in ": "Você também pode conferir o guia completo em ",
  "You can build more trust on the RoboSats and coordinator infrastructure by inspecting the source code.": "Você pode construir mais confiança na infraestrutura do RoboSats e do coordenador, inspecionando o código-fonte.",
  "You can find a step-by-step description of the trade pipeline in ": "Você pode encontrar uma descrição passo a passo do pipeline de negociação em ",
  "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if the coordinator goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if the coordinator disappears. This window is usually about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels or directly to your trade coordinator using one of the contact methods listed on their profile.": "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if the coordinator goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if the coordinator disappears. This window is usually about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels or directly to your trade coordinator using one of the contact methods listed on their profile.",
  "Your trade partner will not know the destination of the Lightning payment. The permanence of the data collected by the coordinators depend on their privacy and data policies. If a dispute arises, a coordinator may request additional information. The specifics of this process can vary from coordinator to coordinator.": "Seu parceiro de negociação não saberá o destino do pagamento Lightning. A permanência dos dados coletados pelos coordenadores depende de suas políticas de privacidade e dados. Se surgir uma disputa, um coordenador pode solicitar informações adicionais. Os detalhes desse processo podem variar de coordenador para coordenador.",
  "#21": "Phrases in components/Dialogs/AddNewPaymentMethodDialog.tsx",
  "Add custom payment method": "Adicionar método de pagamento personalizado",
  "Add payment method": "Adicionar método de pagamento",
  "Cancel": "Cancelar",
  "GitHub": "GitHub",
  "If you want to see it available, consider submitting a request on our ": "Se você deseja vê-lo disponível, considere enviar uma solicitação no nosso ",
  "Payment method": "Método de pagamento",
  "Use this free input to add any payment method you would like to offer.": "Use este campo livre para adicionar qualquer método de pagamento que você gostaria de oferecer.",
  "#22": "Phrases in components/Dialogs/AuditPGP.tsx",
  "Go back": "Voltar",
  "Keys": "Chaves",
  "Learn how to verify": "Saiba como verificar",
  "Messages": "Mensagens",
  "PGP": "PGP",
  "Peer public key": "Chave pública do par",
  "Save credentials as a JSON file": "Salvar credenciais como um arquivo JSON",
  "Save messages as a JSON file": "Salvar mensagens como um arquivo JSON",
  "The passphrase to decrypt your private key. Only you know it! Do not share. It is also your robot token.": "A senha para descriptografar sua chave privada. Só você sabe! Não compartilhe. É também o seu token de robô.",
  "Your PGP public key. Your peer uses it to encrypt messages only you can read.": "Sua chave pública PGP. Seu par a utiliza para criptografar mensagens que só você pode ler.",
  "Your communication is end-to-end encrypted with OpenPGP. You can verify the privacy of this chat using any tool based on the OpenPGP standard.": "Sua comunicação é criptografada de ponta a ponta com OpenPGP. Você pode verificar a privacidade deste chat usando qualquer ferramenta baseada no padrão OpenPGP.",
  "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.": "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.",
  "Your encrypted private key": "Sua chave privada criptografada",
  "Your encrypted private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "Sua chave privada criptografada. Você a usa para descriptografar as mensagens que seu par criptografou para você. Você também a usa para assinar as mensagens que envia.",
  "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.",
  "Your nostr public key. Your peer uses it to encrypt messages only you can read.": "Your nostr public key. Your peer uses it to encrypt messages only you can read.",
  "Your peer PGP public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "A chave pública PGP do seu par. Você a usa para criptografar mensagens que só ele pode ler e para verificar se seu par assinou as mensagens recebidas.",
  "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.",
  "Your private key": "Your private key",
  "Your private key passphrase (keep secure!)": "Sua senha de chave privada (mantenha-a segura!)",
  "Your public key": "Sua chave pública",
  "nostr": "nostr",
  "#23": "Phrases in components/Dialogs/CancelOrder.tsx",
  "Back": "Voltar",
  "Cancel the order?": "Cancelar a ordem?",
  "Confirm cancellation": "Confirmar cancelamento",
  "If the order is cancelled now but you already tried to pay the invoice, you might loose your bond.": "If the order is cancelled now but you already tried to pay the invoice, you might loose your bond.",
  "#24": "Phrases in components/Dialogs/Client.tsx",
  "... somewhere on Earth!": "... em algum lugar na Terra!",
  "Made with": "Feito com",
  "RoboSats client version": "Versão do cliente RoboSats",
  "and": "e",
  "#25": "Phrases in components/Dialogs/Community.tsx",
  "Follow RoboSats in Nostr": "Siga RoboSats no Nostr",
  "Github Issues - The Robotic Satoshis Open Source Project": "Github Issues - O Projeto de Código Aberto de Robotic Satoshis",
  "Join RoboSats English speaking community!": "Junte-se à comunidade RoboSats de língua inglesa!",
  "Join RoboSats SimpleX group": "Junte-se ao grupo RoboSats SimpleX",
  "Join RoboSats Spanish speaking community!": "Junte-se à comunidade RoboSats de língua espanhola!",
  "Nostr Official Account": "Conta Oficial do Nostr",
  "RoboSats in Reddit": "RoboSats no Reddit",
  "RoboSats main public support": "Suporte público principal do RoboSats",
  "Support is only offered via SimpleX. Join our community if you have questions or want to hang out with other cool robots. Please, use our Github Issues if you find a bug or want to see new features!": "O suporte é oferecido apenas via SimpleX. Junte-se à nossa comunidade se você tiver perguntas ou quiser conversar com outros robôs legais. Por favor, use nosso Github Issues se encontrar um bug ou quiser ver novos recursos!",
  "Tell us about a new feature or a bug": "Conte-nos sobre um novo recurso ou bug",
  "We are abandoning Telegram! Our old TG groups": "Estamos abandonando o Telegram! Nossos antigos grupos do TG",
  "#26": "Phrases in components/Dialogs/Coordinator.tsx",
  "...Opening on Nostr gateway. Pubkey copied!": "...Abrindo no gateway Nostr. Chave pública copiada!",
  "24h contracted volume": "Volume contratado em 24h",
  "24h non-KYC bitcoin premium": "Prêmio de bitcoin sem KYC em 24h",
  "Book liquidity": "Liquidez do livro",
  "CLN version": "Versão do CLN",
  "Client": "Cliente",
  "Coordinator": "Coordenador",
  "Coordinator Notice": "Aviso do Coordenador",
  "Coordinator commit hash": "Hash de comprometimento do Coordenador",
  "Coordinator description": "Descrição do Coordenador",
  "Coordinator hosted web app": "Aplicativo web hospedado pelo Coordenador",
  "Coordinator offline": "Coordenador offline",
  "Current onchain payout fee": "Taxa de pagamento onchain atual",
  "Current onchain payout status": "Status atual do pagamento onchain",
  "Development fund supporter: donates {{percent}}% to make RoboSats better.": "Apoiador do fundo de desenvolvimento: doa {{percent}}% para melhorar o RoboSats.",
  "Does not have large trade limits.": "Não possui grandes limites de negociação.",
  "Download PGP Pubkey. Fingerprint: ": "Baixar Chave Pública PGP. Impressão digital: ",
  "Established": "Estabelecido",
  "Founder: coordinating trades since the testnet federation.": "Fundador: coordenando negociações desde a federação testnet.",
  "Good OpSec: the coordinator follows best practices to protect his and your privacy.": "Boa OpSec: o coordenador segue as melhores práticas para proteger sua e a privacidade dele.",
  "LN Node": "Nó LN",
  "LND version": "Versão da LND",
  "Large limits: the coordinator has large trade limits.": "Limites grandes: o coordenador tem grandes limites de negociação.",
  "Lifetime contracted volume": "Volume contratado vitalício",
  "Maker fee": "Taxa do criador",
  "Market price sources (for multiple the median is calculated)": "Fontes de preço de mercado (para múltiplos, a mediana é calculada)",
  "Matrix channel copied! {{matrix}}": "Canal Matrix copiado! {{matrix}}",
  "Maximum onchain swap size": "Tamanho máximo de swap onchain",
  "Maximum order size": "Tamanho máximo da ordem",
  "Not a federation founder": "Não é um fundador da federação",
  "Onchain payouts disabled": "Pagamentos onchain desativados",
  "Policies": "Políticas",
  "Public buy orders": "Ordens de compra públicas",
  "Public sell orders": "Ordens de venda públicas",
  "Reddit": "Reddit",
  "RoboSats version": "Versão do RoboSats",
  "Send Email": "Enviar Email",
  "Simplex": "Simplex",
  "Stats for Nerds": "Estatísticas para Nerds",
  "Summary": "Sumário",
  "Taker fee": "Taxa do tomador",
  "Telegram": "Telegram",
  "The privacy practices of this coordinator could improve": "As práticas de privacidade deste coordenador podem melhorar",
  "Today active robots": "Robôs ativos hoje",
  "Website": "Website",
  "X": "X",
  "Zaps voluntarily for development": "Zaps voluntariamente para desenvolvimento",
  "#27": "Phrases in components/Dialogs/DeleteRobotConfirmation.tsx",
  "Are you sure you want to permanently delete \"{{robotName}}\"?": "Você tem certeza de que deseja excluir permanentemente \"{{robotName}}\"?",
  "Are you sure you want to permanently delete this robot?": "Você tem certeza de que deseja excluir permanentemente este robô?",
  "Before deleting, make sure you have:": "Antes de excluir, certifique-se de que:",
  "Delete Robot?": "Excluir Robô?",
  "Exported any important data": "Exportou quaisquer dados importantes",
  "No active or pending orders": "Sem ordens ativas ou pendentes",
  "Stored your robot token safely": "Armazenou seu token de robô com segurança",
  "⚠️ This action cannot be undone!": "⚠️ Esta ação não pode ser desfeita!",
  "#28": "Phrases in components/Dialogs/EnableTelegram.tsx",
  "Browser": "Navegador",
  "Enable": "Ativar",
  "Enable TG Notifications": "Habilitar notificações do TG",
  "You will be taken to a conversation with RoboSats telegram bot. Simply open the chat and press Start. Note that by enabling telegram notifications you might lower your level of anonymity.": "Você será levado a uma conversa com o bot do Telegram RoboSats. Basta abrir o bate-papo e pressionar Iniciar. Observe que, ao ativar as notificações do Telegram, você pode diminuir seu nível de anonimato.",
  "#29": "Phrases in components/Dialogs/Exchange.tsx",
  "Enabled RoboSats coordinators": "Coordenadores RoboSats habilitados",
  "Exchange Summary": "Resumo da Exchange",
  "Online RoboSats coordinators": "Coordenadores RoboSats online",
  "#30": "Phrases in components/Dialogs/F2fMap.tsx",
  "Choose a location": "Escolha um local",
  "Save": "Salvar",
  "#31": "Phrases in components/Dialogs/GoToOrder.tsx",
  "Order URL": "URL da ordem",
  "Search order": "Procurar ordem",
  "#32": "Phrases in components/Dialogs/Learn.tsx",
  "You are about to visit Learn RoboSats. It hosts tutorials and documentation to help you learn how to use RoboSats and understand how it works.": "Você está prestes a visitar o \"Learn RoboSats\". Ele hospeda tutoriais e documentação para ajudá-lo a aprender como usar o RoboSats e entender como funciona.",
  "#33": "Phrases in components/Dialogs/NoRobot.tsx",
  "Generate a robot avatar first. Then create your own order.": "Gere um avatar de robô primeiro. Em seguida, crie sua própria ordem.",
  "You do not have a robot avatar": "Você não tem um avatar de robô",
  "#34": "Phrases in components/Dialogs/Profile.tsx",
  "Coordinators that know your robot:": "Coordenadores que conhecem seu robô:",
  "Your Robot": "Seu Robô",
  "#35": "Phrases in components/Dialogs/Recovery.tsx",
  "Enter your robot token to re-build your robot and gain access to its trades.": "Insira seu token de robô para reconstruir seu robô e acessar suas negociações.",
  "Paste token here": "Colar token aqui",
  "Recover": "Recuperar",
  "Robot recovery": "Recuperação de robô",
  "#36": "Phrases in components/Dialogs/StoreToken.tsx",
  "Back it up!": "Faça um backup!",
  "Done": "Feito",
  "Store your robot token": "Armazene seu token de robô",
  "You might need to recover your robot avatar in the future: store it safely. You can simply copy it into another application.": "Você pode precisar recuperar seu avatar de robô no futuro: armazene-o com segurança. Você pode simplesmente copiá-lo em outra aplicação.",
  "#37": "Phrases in components/Dialogs/ThirdParty.tsx",
  "Third party description": "Descrição de terceiros",
  "#38": "Phrases in components/Dialogs/Update.tsx",
  "Download RoboSats {{coordinatorString}} APK from Github releases": "Baixe o APK RoboSats {{coordinatorString}} dos lançamentos do Github",
  "Go away!": "Vá embora!",
  "On Android RoboSats app ": "No aplicativo RoboSats para Android ",
  "On Tor Browser client simply refresh your tab (click here or press Ctrl+Shift+R)": "No cliente Tor Browser, basta atualizar sua aba (clique aqui ou pressione Ctrl+Shift+R)",
  "On remotely served browser client": "No cliente de navegador servido remotamente",
  "On your own soverign node": "Em seu próprio nó soberano",
  "The RoboSats coordinator is on version {{coordinatorString}}, but your client app is {{clientString}}. This version mismatch might lead to a bad user experience.": "O coordenador RoboSats está na versão {{coordinatorString}}, mas seu aplicativo cliente está na versão {{clientString}}. Essa incompatibilidade de versão pode levar a uma má experiência do usuário.",
  "Update your RoboSats client": "Atualize seu cliente RoboSats",
  "#39": "Phrases in components/Dialogs/VisitThirdParty.tsx",
  "Open external order": "Abrir ordem externa",
  "This order is not managed by a RoboSats coordinator. Please ensure you are comfortable with the privacy and trust trade-offs. You will open an external link or app": "Esta ordem não é gerida por um coordenador do RoboSats. Certifique-se de que está confortável com as trocas de privacidade e confiança. Você abrirá um link ou aplicativo externo",
  "#40": "Phrases in components/Dialogs/Warning.tsx",
  "Coordinators of p2p trades are the source of trust, provide the infrastructure, pricing and will mediate in case of dispute. Make sure you research and trust \"{{coordinator_name}}\" before locking your bond. A malicious p2p coordinator can find ways to steal from you.": "Coordenadores de negociações p2p são a fonte de confiança, fornecem a infraestrutura, preços e irão mediar em caso de disputa. Certifique-se de pesquisar e confiar em \"{{coordinator_name}}\" antes de bloquear seu título. Um coordenador p2p malicioso pode encontrar maneiras de roubar de você.",
  "I understand": "Eu entendo",
  "Warning": "Aviso",
  "#41": "Phrases in components/FederationTable/index.tsx",
  "Add Coordinator": "Add Coordinator",
  "Add coordinator": "Add coordinator",
  "Alias": "Alias",
  "Alias already exists": "Alias já existe",
  "Enabled": "Habilitado",
  "Invalid Onion URL": "URL Onion Inválida",
  "Invalid ratings have been filtered.": "Avaliações inválidas foram filtradas.",
  "No coordinators found.": "Nenhum coordenador encontrado.",
  "Rating": "Avaliação",
  "Reloading. Invalid ratings will be filtered.": "Recarregando. Avaliações inválidas serão filtradas.",
  "URL": "URL",
  "Up": "Para cima",
  "Verify ratings": "Verificar avaliações",
  "Verifying all ratings might take some time; this window may freeze for a few seconds while the cryptographic certification is in progress.": "Verificar todas as avaliações pode levar algum tempo; esta janela pode congelar por alguns segundos enquanto a certificação criptográfica está em andamento.",
  "#42": "Phrases in components/HostAlert/SelfhostedAlert.tsx",
  "RoboSats client is served from your own node granting you the strongest security and privacy.": "O cliente RoboSats é servido a partir do seu próprio nó, garantindo a você a maior segurança e privacidade.",
  "You are self-hosting RoboSats": "Você está auto-hospedando RoboSats",
  "#43": "Phrases in components/HostAlert/UnsafeAlert.tsx",
  "You are not using RoboSats privately": "Você não está utilizando o RoboSats de forma privada",
  "#44": "Phrases in components/MakerForm/AmountRange.tsx",
  "From": "De",
  "to": "para",
  "#45": "Phrases in components/MakerForm/MakerForm.tsx",
  " at a {{discount}}% discount": " com um desconto de {{discount}}%",
  " at a {{premium}}% premium": " com um prêmio de {{premium}}%",
  " at market price": " ao preço de mercado",
  "Add New": "Adicionar novo",
  "Add geolocation for a face to face trade": "Adicionar geolocalização para uma negociação presencial",
  "Amount Range": "Faixa de Valor",
  "Amount of BTC to swap for LN Sats": "Quantidade de BTC para trocar por LN Sats",
  "Amount of fiat to exchange for bitcoin": "Quantidade de moeda fiduciária para trocar por bitcoin",
  "Buy BTC for ": "Comprar BTC por ",
  "Buy or Sell Bitcoin?": "Comprar ou Vender Bitcoin?",
  "Clear form": "Limpar formulário",
  "Edit order": "Editar ordem",
  "Enable advanced options": "Habilitar opções avançadas",
  "Enter the destination of the Lightning swap": "Insira o destino do swap Lightning",
  "Escrow/Invoice Timer (HH:mm)": "Temporizador de Caução/Invoice (HH:mm)",
  "Escrow/invoice step length": "Comprimento da etapa de caução/invoice",
  "Exact Amount": "Valor Exato",
  "Face to Face Location": "Localização Presencial",
  "Fiat Payment Method(s)": "Método(s) de Pagamento Fiat",
  "Fidelity Bond Size": "Tamanho do Título de Fidelidade",
  "In or Out of Lightning?": "Dentro ou Fora do Lightning?",
  "Must be less than {{maxAmount}}": "Deve ser inferior a {{maxAmount}}",
  "Must be less than {{max}}%": "Deve ser inferior a {{max}}%",
  "Must be more than {{minAmount}}": "Deve ser superior a {{minAmount}}",
  "Must be more than {{min}}%": "Deve ser superior a {{min}}%",
  "Must be shorter than 65 characters": "Deve ter menos de 65 caracteres",
  "Onchain amount to receive (BTC)": "Quantidade onchain a receber (BTC)",
  "Onchain amount to send (BTC)": "Quantidade onchain a enviar (BTC)",
  "Order current rate:": "Taxa atual do pedido:",
  "Order for ": "Ordem para ",
  "Password": "Senha",
  "Description": "Descrição",
  "Premium over Market (%)": "Prêmio sobre o Mercado (%)",
  "Public Duration (HH:mm)": "Duração Pública (HH:mm)",
  "Public order length": "Comprimento da ordem pública",
  "Sell BTC for ": "Vender BTC por ",
  "Set the skin-in-the-game, increase for higher safety assurance": "Defina a skin-in-the-game, aumente para maior garantia de segurança",
  "Swap Destination(s)": "Destino(s) de Troca",
  "Swap into LN ": "Trocar para LN ",
  "Swap of ": "Troca de ",
  "Swap out of LN ": "Trocar para fora do LN ",
  "Swap?": "Trocar?",
  "To protect your privacy, the exact location you pin will be slightly randomized.": "Para proteger sua privacidade, a localização exata que você marcar será ligeiramente aleatória.",
  "You are already maker of an active order": "Você já é o criador de uma ordem ativa",
  "You must fill the form correctly": "Você deve preencher o formulário corretamente",
  "You receive approx {{swapSats}} LN Sats (fees might vary)": "Você recebe aprox {{swapSats}} LN Sats (as taxas podem variar)",
  "You send approx {{swapSats}} LN Sats (fees might vary)": "Você envia aprox {{swapSats}} LN Sats (as taxas podem variar)",
  "#46": "Phrases in components/MakerForm/SelectCoordinator.tsx",
  "Disabled": "Desabilitado",
  "Loading coordinator info...": "Loading coordinator info...",
  "Maker": "Criador",
  "Not on-chain swaps.": "Not on-chain swaps.",
  "On-chain swaps.": "On-chain swaps.",
  "Onchain payouts enabled": "Pagamentos onchain habilitados",
  "Taker": "Tomador",
  "The provider the lightning and communication infrastructure. The host will be in charge of providing support and solving disputes. The trade fees are set by the host. Make sure to only select order hosts that you trust!": "O provedor da infraestrutura de comunicação e lightning. O hospedeiro será responsável por fornecer suporte e resolver disputas. As taxas de negociação são definidas pelo hospedeiro. Certifique-se de selecionar apenas hospedeiros de pedido em quem você confia!",
  "#47": "Phrases in components/OrderDetails/TakeButton.tsx",
  "Amount {{currencyCode}}": "Quantidade {{currencyCode}}",
  "By taking this order you risk wasting your time. If the maker does not proceed in time, you will be compensated in satoshis for 50% of the maker bond.": "Ao aceitar esta ordem, você corre o risco de perder seu tempo. Se o criador não prosseguir a tempo, você será compensado em satoshis por 50% do título do criador.",
  "Enter amount of fiat to exchange for bitcoin": "Insira o valor da moeda fiduciária para trocar por bitcoin",
  "Sounds fine": "Parece bom",
  "Take Order": "Pegar Ordem",
  "The maker is away": "O criador está ausente",
  "Too high": "Muito alto",
  "Too low": "Muito baixo",
  "Wait until you can take an order": "Espere até que você possa fazer uma ordem",
  "You must specify an amount first": "Você deve especificar um valor primeiro",
  "You will receive {{satoshis}} Sats (Approx)": "Você receberá {{satoshis}} Sats (aproximadamente)",
  "You will send {{satoshis}} Sats (Approx)": "Você enviará {{satoshis}} Sats (aproximadamente)",
  "#48": "Phrases in components/OrderDetails/index.tsx",
  "Accepted payment methods": "Métodos de pagamento aceitos",
  "Acknowledged": "Confirmar",
  "Amount of Satoshis": "Quantidade de Satoshis",
  "Deposit": "Depósito",
  "Expires in": "Expira em",
  "F2F location": "Localização presencial",
  "ID": "ID",
  "If you receive a fiat transaction, it can be unilatery reverted up to 80 days after the trade has been completed.": "Se você receber uma transação em moeda fiduciária, ela poderá ser revertida unilateralmente até 80 dias após a conclusão da negociação.",
  "Order Details": "Detalhes da Ordem",
  "Order host": "Hospedeiro da Ordem",
  "Penalty lifted, good to go!": "Penalidade levantada, pronto para ir!",
  "Premium over market price": "Prêmio sobre o preço de mercado",
  "Price and Premium": "Preço e Prêmio",
  "Reversible payments": "Reversible payments",
  "Robosats and their coordinators have no control over the legacy fiat system.": "Robosats e seus coordenadores não têm controle sobre o sistema fiduciário legado.",
  "Scammers can exploit this vulnerability in the legacy fiat system to take away both your bitcoin and your fiat.": "Os golpistas podem explorar essa vulnerabilidade no sistema fiduciário legado para tirar tanto seus bitcoins quanto seu dinheiro fiduciário.",
  "Swap destination": "Destino de Troca",
  "The order has expired": "A ordem expirou",
  "The pinned location is approximate. The exact location for the meeting place must be exchanged in the encrypted chat.": "A localização fixada é aproximada. A localização exata para o local de encontro deve ser trocada no chat criptografado.",
  "This order offers one or multiple payment methods that the community has consistently reported as reverting their transactions.": "To zamówienie oferuje jedną lub kilka metod płatności, które społeczność konsekwentnie zgłasza jako anulujące ich transakcje.",
  "You cannot take an order yet! Wait {{timeMin}}m {{timeSec}}s": "Você ainda não pode fazer um pedido! Espere {{timeMin}}m {{timeSec}}s",
  "You receive via {{method}} {{amount}}": "Você recebe via {{method}} {{amount}}",
  "You receive {{amount}} Sats (Approx)": "Você recebe {{amount}} Sats (aproximadamente)",
  "You send via Lightning {{amount}} Sats (Approx)": "Você envia via Lightning {{amount}} Sats (aproximadamente)",
  "You send via {{method}} {{amount}}": "Você envia via {{method}} {{amount}}",
  "{{price}} {{currencyCode}}/BTC - Premium: {{premium}}%": "{{price}} {{currencyCode}}/BTC - Prêmio: {{premium}}%",
  "#49": "Phrases in components/RobotInfo/index.tsx",
  "Active order!": "Ordem ativa!",
  "Claim": "Reivindicar",
  "Enable Telegram Notifications": "Habilitar notificações do Telegram",
  "Finished order": "Finished order",
  "Inactive order": "Ordem inativa",
  "Invoice for {{amountSats}} Sats": "Fatura para {{amountSats}} Sats",
  "No active orders": "Nenhuma ordem ativa",
  "No orders found": "No orders found",
  "One active order #{{orderID}}": "Uma ordem ativa #{{orderID}}",
  "Submit": "Enviar",
  "Telegram enabled": "Telegram ativado",
  "There it goes!": "Lá vai!",
  "Use stealth invoices": "Use invoices ocultas",
  "You do not have previous orders": "Você não tem ordens anteriores",
  "Your compensations": "Suas compensações",
  "Your current order": "Sua ordem atual",
  "Your last order #{{orderID}}": "Sua última ordem #{{orderID}}",
  "#50": "Phrases in components/SettingsForm/index.tsx",
  "API": "API",
  "Build-in": "Build-in",
  "Dark": "Escuro",
  "Light": "Claro",
  "Mainnet": "Mainnet",
  "Off": "Off",
  "On": "On",
  "Orbot": "Orbot",
  "Testnet": "Testnet",
  "#51": "Phrases in components/TradeBox/CancelButton.tsx",
  "Cancel order": "Cancelar ordem",
  "Copy URL": "Copiar URL",
  "Copy order URL": "Copiar URL da ordem",
  "Unilateral cancelation (bond at risk!)": "Cancelamento unilateral (título em risco!)",
  "#52": "Phrases in components/TradeBox/CollabCancelAlert.tsx",
  "You asked for a collaborative cancellation": "Você solicitou um cancelamento colaborativo",
  "{{nickname}} is asking for a collaborative cancel": "{{nickname}} está pedindo um cancelamento colaborativo",
  "#53": "Phrases in components/TradeBox/TradeSummary.tsx",
  "Buyer": "Comprador",
  "Contract exchange rate": "Taxa de câmbio do contrato",
  "Coordinator trade revenue": "Receita de negociação do coordenador",
  "Export trade summary": "Exportar resumo da negociação",
  "Maker bond": "Título do criador",
  "Mining fee": "Taxa de mineração",
  "Onchain swap fee": "Taxa de swap onchain",
  "Received": "Recebido",
  "Routing budget": "Orçamento de roteamento",
  "Seller": "Vendedor",
  "Sent": "Enviado",
  "Taker bond": "Título do tomador",
  "Trade Summary": "Resumo da Negociação",
  "Unlocked": "Desbloqueado",
  "User role": "Função do usuário",
  "{{bondSats}} Sats ({{bondPercent}}%)": "{{bondSats}} Sats ({{bondPercent}}%)",
  "{{miningFeeSats}} Sats": "{{miningFeeSats}} Sats",
  "{{revenueSats}} Sats": "{{revenueSats}} Sats",
  "{{routingFeeSats}} MiliSats": "{{routingFeeSats}} MiliSats",
  "{{swapFeeSats}} Sats ({{swapFeePercent}}%)": "{{swapFeeSats}} Sats ({{swapFeePercent}}%)",
  "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)": "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)",
  "#54": "Phrases in components/TradeBox/WalletsButton.tsx",
  "See Compatible Wallets": "Ver Carteiras Compatíveis",
  "#55": "Phrases in components/TradeBox/index.tsx",
  "A contact method is required": "Um método de contato é necessário",
  "The statement is too short. Make sure to be thorough.": "A declaração é muito curta. Certifique-se de ser completo.",
  "#56": "Phrases in components/TradeBox/Dialogs/ConfirmCancel.tsx",
  "Confirm Cancel": "Confirmar cancelamento",
  "If the order is cancelled now you will lose your bond.": "Se a ordem for cancelada agora, você perderá seu título.",
  "#57": "Phrases in components/TradeBox/Dialogs/ConfirmCollabCancel.tsx",
  "Accept Cancelation": "Aceitar Cancelamento",
  "Ask for Cancel": "Pedir para Cancelar",
  "Collaborative cancel the order?": "Cancelar o pedido colaborativamente?",
  "The trade escrow has been posted. The order can be cancelled only if both, maker and taker, agree to cancel.": "O caução da negociação foi postado. O pedido só pode ser cancelado se ambos, criador e tomador, concordarem em cancelar.",
  "Your peer has asked for cancellation": "Seu par pediu cancelamento",
  "#58": "Phrases in components/TradeBox/Dialogs/ConfirmDispute.tsx",
  "Agree and open dispute": "Concordar e abrir disputa",
  "Disagree": "Discordar",
  "Do you want to open a dispute?": "Você quer abrir uma disputa?",
  "Make sure to EXPORT the chat log. The staff might request your exported chat log JSON in order to solve discrepancies. It is your responsibility to store it.": "Certifique-se de EXPORTAR o log de bate-papo. A equipe pode solicitar seu JSON de log de bate-papo exportado para resolver discrepâncias. É sua responsabilidade armazená-lo.",
  "The RoboSats staff will examine the statements and evidence provided. You need to build a complete case, as the staff cannot read the chat. It is best to provide a burner contact method with your statement. The satoshis in the trade escrow will be sent to the dispute winner, while the dispute loser will lose the bond.": "A equipe do RoboSats examinará as declarações e evidências fornecidas. Você precisa construir um caso completo, pois a equipe não pode ler o chat. É melhor fornecer um método de contato do queimador com sua declaração. Os satoshis no depósito de caução serão enviados ao vencedor da disputa, enquanto o perdedor da disputa perderá o título.",
  "#59": "Phrases in components/TradeBox/Dialogs/ConfirmFiatReceived.tsx",
  "Confirm": "Confirmar",
  "Confirming will finalize the trade.": "Confirmar finalizará a negociação.",
  "If you have received the payment and do not click confirm, you risk losing your bond.": "Se você recebeu o pagamento e não clicar em confirmar, corre o risco de perder seu título.",
  "Only confirm after {{amount}} {{currencyCode}} have arrived to your account.": "Somente confirme após {{amount}} {{currencyCode}} terem chegado à sua conta.",
  "Some fiat payment methods might reverse their transactions up to 80 days after they are completed. Please keep this token and your order data in case you need to use them as proof.": "Alguns métodos de pagamento fiat podem reverter suas transações até 80 dias após serem concluídas. Por favor, mantenha este token e os dados do seu pedido caso precise usá-los como prova.",
  "The satoshis in the escrow will be released to the buyer:": "Os satoshis no caução serão liberados para o comprador:",
  "✅ Confirm you received {{amount}} {{currencyCode}}?": "✅ Confirmar que você recebeu {{amount}} {{currencyCode}}?",
  "#60": "Phrases in components/TradeBox/Dialogs/ConfirmFiatSent.tsx",
  "Confirming will allow your peer to finalize the trade.": "Confirmar permitirá que seu par conclua a negociação.",
  "If you have not yet sent it and you still proceed to falsely confirm, you risk losing your bond.": "Se você ainda não enviou e ainda assim proceder para confirmar falsamente, corre o risco de perder seu título.",
  "✅ Confirm you sent {{amount}} {{currencyCode}}?": "✅ Confirmar que você enviou {{amount}} {{currencyCode}}?",
  "#61": "Phrases in components/TradeBox/Dialogs/ConfirmUndoFiatSent.tsx",
  "READ. In case your payment to the seller has been blocked and it is absolutely impossible to finish the trade, you can revert your confirmation of \"Fiat sent\". Do so only if you and the seller have ALREADY AGREED in the chat to proceed to a collaborative cancellation. After confirming, the \"Collaborative cancel\" button will be visible again. Only click this button if you know what you are doing. First time users of RoboSats are highly discouraged from performing this action! Make 100% sure your payment has failed and the amount is in your account.": "LEIA. Caso seu pagamento ao vendedor tenha sido bloqueado e seja absolutamente impossível finalizar a negociação, você pode reverter sua confirmação de \"Fiat enviado\". Faça isso apenas se você e o vendedor já concordaram no chat em prosseguir para um cancelamento colaborativo. Após confirmar, o botão \"Cancelar colaborativamente\" ficará visível novamente. Clique neste botão apenas se souber o que está fazendo. Usuários de primeira viagem do RoboSats são altamente desencorajados a realizar esta ação! Certifique-se 100% de que seu pagamento falhou e o valor está na sua conta.",
  "Revert the confirmation of fiat sent?": "Reverter a confirmação de fiat enviado?",
  "Wait ({{time}})": "Espere ({{time}})",
  "#62": "Phrases in components/TradeBox/EncryptedChat/ChatHeader/index.tsx",
  "...waiting": "...esperando",
  "Activate slow mode (use it when the connection is slow)": "Ativar modo lento (use-o quando a conexão estiver lenta)",
  "Peer": "Par",
  "You": "Você",
  "connected": "conectado",
  "disconnected": "desconectado",
  "#63": "Phrases in components/TradeBox/EncryptedChat/EncryptedSocketChat/index.tsx",
  "Type a message": "Digite uma mensagem",
  "#64": "Phrases in components/TradeBox/EncryptedChat/EncryptedTurtleChat/index.tsx",
  "Send": "Enviar",
  "#65": "Phrases in components/TradeBox/EncryptedChat/MessageCard/index.tsx",
  "#66": "Phrases in components/TradeBox/Forms/LightningPayout.tsx",
  "Advanced options": "Opções avançadas",
  "Invoice to wrap": "Invoice para embrulhar",
  "Payout Lightning Invoice": "Pagamento Lightning Invoice",
  "Proxy Budget": "Orçamento de Proxy",
  "Routing Budget": "Orçamento de Roteamento",
  "Server": "Servidor",
  "Submit invoice for {{amountSats}} Sats": "Enviar invoice para {{amountSats}} Sats",
  "Use Lnproxy": "Use Lnproxy",
  "Wrap": "Embrulhar",
  "Wrapped invoice": "Invoice embrulhada",
  "#67": "Phrases in components/TradeBox/Forms/OnchainPayout.tsx",
  "Bitcoin Address": "Endereço Bitcoin",
  "Final amount you will receive": "Valor final que você receberá",
  "Invalid": "Inválido",
  "Mining Fee": "Taxa de Mineração",
  "RoboSats coordinator will do a swap and send the Sats to your onchain address.": "O coordenador do RoboSats fará um swap e enviará os Sats para o seu endereço onchain.",
  "Swap fee": "Taxa de troca",
  "#68": "Phrases in components/TradeBox/Prompts/Chat.tsx",
  "Audit Chat": "Audit Chat",
  "Beware scams": "Cuidado com golpes",
  "Collaborative Cancel": "Cancelamento colaborativo",
  "Confirm {{amount}} {{currencyCode}} received": "Confirmar que recebeu {{amount}} {{currencyCode}}",
  "Confirm {{amount}} {{currencyCode}} sent": "Confirmar o envio de {{amount}} {{currencyCode}}",
  "Export": "Exportar",
  "Open Dispute": "Abrir disputa",
  "Order options": "Order options",
  "Payment failed?": "Pagamento falhou?",
  "Say hi! Be helpful and concise. Let them know how to send you {{amount}} {{currencyCode}}.": "Diga oi! Seja útil e conciso. Avise como enviar {{amount}} {{currencyCode}} para você.",
  "To open a dispute you need to wait": "Para abrir uma disputa, você precisa esperar",
  "Wait for the seller to confirm he has received the payment.": "Aguarde o vendedor confirmar que recebeu o pagamento.",
  "#69": "Phrases in components/TradeBox/Prompts/Dispute.tsx",
  "Attach chat logs": "Anexar logs de chat",
  "Attaching chat logs helps the dispute resolution process and adds transparency. However, it might compromise your privacy.": "Anexar logs de chat ajuda no processo de resolução de disputas e adiciona transparência. No entanto, pode comprometer sua privacidade.",
  "Contact method": "Método de contato",
  "Other": "Outro",
  "Please, submit your statement. Be clear and specific about what happened and provide the necessary evidence. You MUST provide a contact method: burner email, SimpleX incognito link or telegram (make sure to create a searchable username) to follow up with the dispute solver (your trade host/coordinator). Disputes are solved at the discretion of real robots (aka humans), so be as helpful as possible to ensure a fair outcome.": "Por favor, envie sua declaração. Seja claro e específico sobre o que aconteceu e forneça as evidências necessárias. Você DEVE fornecer um método de contato: email descartável, link anônimo do SimpleX ou telegram (certifique-se de criar um nome de usuário pesquisável) para acompanhar com o solucionador de disputas (seu hospedeiro/coordenador de negociação). As disputas são resolvidas à discrição de robôs reais (também conhecidos como humanos), então seja o mais útil possível para garantir um resultado justo.",
  "Select a contact method": "Selecione um método de contato",
  "Submit dispute statement": "Enviar declaração de disputa",
  "#70": "Phrases in components/TradeBox/Prompts/DisputeLoser.tsx",
  "Unfortunately you have lost the dispute. If you think this is a mistake you can ask to re-open the case by contacting your coordinator. If you think your coordinator was unfair, please fill a claim via email to robosats@protonmail.com": "Infelizmente você perdeu a disputa. Se acha que isso é um erro, pode pedir para reabrir o caso entrando em contato com o seu coordenador. Se acha que seu coordenador foi injusto, por favor preencha uma reclamação por email para robosats@protonmail.com",
  "#71": "Phrases in components/TradeBox/Prompts/DisputeWaitPeer.tsx",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself using that information if you contact your trade coordinator.": "Por favor, salve as informações necessárias para identificar seu pedido e seus pagamentos: ID do pedido; hashes de pagamento dos títulos ou caução (verifique sua carteira lightning); quantidade exata de satoshis; e apelido do robô. Você terá que se identificar usando essas informações se entrar em contato com o coordenador da sua negociação.",
  "We are waiting for your trade counterpart statement. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods.": "Estamos aguardando a declaração da sua contraparte de negociação. Se estiver hesitante sobre o estado da disputa ou quiser adicionar mais informações, entre em contato com o coordenador de negociação do seu pedido (o hospedeiro) através de um dos métodos de contato deles.",
  "#72": "Phrases in components/TradeBox/Prompts/DisputeWaitResolution.tsx",
  "Both statements have been received, wait for the staff to resolve the dispute. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods. If you did not provide a contact method, or are unsure whether you wrote it right, write your coordinator immediately.": "Ambas as declarações foram recebidas, aguarde que a equipe resolva a disputa. Se estiver hesitante sobre o estado da disputa ou quiser adicionar mais informações, entre em contato com o coordenador de negociação do seu pedido (o hospedeiro) através de um dos métodos de contato deles. Se não forneceu um método de contato ou não tem certeza se escreveu corretamente, escreva para o seu coordenador imediatamente.",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself as the user involved in this trade via email (or other contact methods).": "Por favor, salve as informações necessárias para identificar seu pedido e seus pagamentos: ID do pedido; hashes de pagamento dos títulos ou caução (verifique sua carteira lightning); quantidade exata de satoshis; e apelido do robô. Você terá que se identificar como o usuário envolvido nesta negociação por email (ou outros métodos de contato).",
  "#73": "Phrases in components/TradeBox/Prompts/DisputeWinner.tsx",
  "You can claim the dispute resolution amount (escrow and fidelity bond) from your profile rewards. If there is anything the staff can help with, do not hesitate to contact to robosats@protonmail.com (or via your provided burner contact method).": "Você pode reivindicar o valor da resolução de disputas (caução e título de fidelidade) das recompensas do seu perfil. Se houver algo em que a equipe possa ajudar, não hesite em entrar em contato pelo email robosats@protonmail.com (ou através do método de contato descartável fornecido).",
  "#74": "Phrases in components/TradeBox/Prompts/EscrowWait.tsx",
  "Just hang on for a moment. If the seller does not deposit, you will get your bond back automatically. In addition, you will receive a compensation (check the rewards in your profile).": "Apenas espere um momento. Se o vendedor não depositar, você receberá seu título de volta automaticamente. Além disso, você receberá uma compensação (verifique as recompensas em seu perfil).",
  "We are waiting for the seller to lock the trade amount.": "Estamos aguardando o vendedor bloquear o valor da negociação.",
  "#75": "Phrases in components/TradeBox/Prompts/Expired.tsx",
  "Renew Order": "Renovar pedido",
  "#76": "Phrases in components/TradeBox/Prompts/LockInvoice.tsx",
  "Copy to clipboard": "Copiar para a área de transferência",
  "This is a hold invoice, it will freeze in your wallet. It will be charged only if you cancel or lose a dispute.": "Esta é uma invoice de espera, ela ficará congelada em sua carteira. Será cobrada apenas se você cancelar ou perder uma disputa.",
  "This is a hold invoice, it will freeze in your wallet. It will be released to the buyer once you confirm to have received the {{currencyCode}}.": "Esta é uma invoice de espera, ela ficará congelada em sua carteira. Será liberada para o comprador assim que você confirmar que recebeu o {{currencyCode}}.",
  "#77": "Phrases in components/TradeBox/Prompts/Paused.tsx",
  "Unpause Order": "Retomar pedido",
  "Your public order has been paused. At the moment it cannot be seen or taken by other robots. You can choose to unpause it at any time.": "Seu pedido público foi pausado. No momento, não pode ser visto ou aceito por outros robôs. Você pode optar por retomá-lo a qualquer momento.",
  "#78": "Phrases in components/TradeBox/Prompts/Payout.tsx",
  "Before letting you send {{amountFiat}} {{currencyCode}}, we want to make sure you are able to receive the BTC.": "Antes de permitir que você envie {{amountFiat}} {{currencyCode}}, queremos garantir que você consiga receber o BTC.",
  "Lightning": "Lightning",
  "Onchain": "Onchain",
  "#79": "Phrases in components/TradeBox/Prompts/PayoutWait.tsx",
  "Just hang on for a moment. If the buyer does not cooperate, you will get back the trade collateral and your bond automatically. In addition, you will receive a compensation (check the rewards in your profile).": "Apenas espere um momento. Se o comprador não cooperar, você receberá de volta a garantia da negociação e seu título automaticamente. Além disso, você receberá uma compensação (verifique as recompensas em seu perfil).",
  "We are waiting for the buyer to post a lightning invoice. Once he does, you will be able to directly communicate the payment details.": "Estamos aguardando o comprador postar uma invoice lightning. Assim que ele fizer isso, você poderá comunicar diretamente os detalhes do pagamento.",
  "#80": "Phrases in components/TradeBox/Prompts/PublicWait.tsx",
  "Among public {{currencyCode}} orders (higher is cheaper)": "Entre pedidos públicos de {{currencyCode}} (mais alto é mais barato)",
  "If the order expires untaken, your bond will return to you (no action needed).": "Se o pedido expirar sem ser aceite, seu título será devolvido a você (nenhuma ação necessária).",
  "Pause the public order": "Pausar o pedido público",
  "Premium rank": "Classificação de prêmio",
  "Public orders for {{currencyCode}}": "Pedidos públicos para {{currencyCode}}",
  "#81": "Phrases in components/TradeBox/Prompts/RoutingFailed.tsx",
  "Failure reason:": "Motivo da falha:",
  "Next attempt in": "Próxima tentativa em",
  "Retrying!": "Tentando novamente!",
  "RoboSats will try to pay your invoice 3 times with a one minute pause in between. If it keeps failing, you will be able to submit a new invoice. Check whether you have enough inbound liquidity. Remember that lightning nodes must be online in order to receive payments.": "O RoboSats tentará pagar sua invoice 3 vezes com uma pausa de um minuto entre elas. Se continuar falhando, você poderá enviar uma nova invoice. Verifique se você tem liquidez de entrada suficiente. Lembre-se de que os nós lightning devem estar online para receber pagamentos.",
  "Your invoice has expired or more than 3 payment attempts have been made. Submit a new invoice.": "Sua invoice expirou ou mais de 3 tentativas de pagamento foram feitas. Envie uma nova invoice.",
  "#82": "Phrases in components/TradeBox/Prompts/SendingSats.tsx",
  "Lightning payments are usually instantaneous, but sometimes a node in the route may be down, which can cause your payout to take up to 24 hours to arrive in your wallet.": "Os pagamentos lightning são geralmente instantâneos, mas às vezes um nó na rota pode estar offline, o que pode fazer com que seu pagamento leve até 24 horas para chegar à sua carteira.",
  "RoboSats is trying to pay your lightning invoice. Remember that lightning nodes must be online in order to receive payments.": "O RoboSats está tentando pagar sua invoice lightning. Lembre-se de que os nós lightning devem estar online para receber pagamentos.",
  "Taking too long?": "Demorando muito?",
  "#83": "Phrases in components/TradeBox/Prompts/Successful.tsx",
  "Rate your host": "Avalie seu hospedeiro",
  "Rate your trade experience": "Avalie sua experiência de negociação",
  "Renew": "Renovar",
  "RoboSats gets better with more liquidity and users. Tell a bitcoiner friend about Robosats!": "O RoboSats melhora com mais liquidez e usuários. Conte a um amigo bitcoiner sobre o Robosats!",
  "Sending coins": "Sending coins",
  "Start Again": "Comece de novo",
  "Thank you for using Robosats!": "Obrigado por usar o Robosats!",
  "Thank you! {{shortAlias}} loves you too": "Obrigado! {{shortAlias}} também te ama",
  "You need to enable nostr to rate your coordinator.": "Você precisa ativar o nostr para avaliar seu coordenador.",
  "Your TXID": "Seu TXID",
  "#84": "Phrases in components/TradeBox/Prompts/TakerFound.tsx",
  "Please wait for the taker to lock a bond. If the taker does not lock a bond in time, the order will be made public again.": "Por favor, espere que o tomador bloqueie um título. Se o tomador não bloquear um título a tempo, o pedido será tornado público novamente.",
  "#85": "Phrases in pro/LandingDialog/index.tsx",
  "A robot technician has arrived!": "Um técnico de robô chegou!",
  "I bring my own robots, here they are. (Drag and drop workspace.json)": "Trouxe meus próprios robôs, aqui estão eles. (Arraste e solte workspace.json)",
  "My first time here. Generate a new Robot Garage and extended robot token (xToken).": "Minha primeira vez aqui. Gere uma nova Garagem de Robôs e token de robô estendido (xToken).",
  "#86": "Phrases in pro/ToolBar/index.tsx",
  "Customize viewports": "Personalizar áreas de visualização",
  "Freeze viewports": "Congelar áreas de visualização",
  "unsafe_alert": "Para proteger seus dados e privacidade, use<1 o Tor Browser e visite um site Onion hospedado por uma federação. Ou hospede seu próprio cliente.",
  "let_us_know_hot_to_improve": "Deixe-nos saber como a plataforma pode melhorar (<1>Telegram / <3>Github)",
  "open_dispute": "Para abrir uma disputa, você precisa esperar <1><1/>",
  "Waiting for maker bond": "Aguardando título do criador",
  "Public": "Público",
  "Waiting for taker bond": "Aguardando título do tomador",
  "Cancelled": "Cancelado",
  "Expired": "Expirado",
  "Waiting for trade collateral and buyer invoice": "Aguardando garantia de negociação e invoice do comprador",
  "Waiting only for seller trade collateral": "Aguardando apenas a garantia de negociação do vendedor",
  "Waiting only for buyer invoice": "Aguardando apenas a invoice do comprador",
  "Sending fiat - In chatroom": "Enviando fiat - No chatroom",
  "Fiat sent - In chatroom": "Fiat enviado - No chatroom",
  "In dispute": "Em disputa",
  "Collaboratively cancelled": "Cancelado colaborativamente",
  "Sending satoshis to buyer": "Enviando satoshis para o comprador",
  "Successful trade": "Negociação bem-sucedida",
  "Failed lightning network routing": "Falha no roteamento da rede Lightning",
  "Wait for dispute resolution": "Aguardar resolução da disputa",
  "Maker lost dispute": "Criador perdeu a disputa",
  "Taker lost dispute": "Tomador perdeu a disputa",
  "Invoice expired. You did not confirm publishing the order in time. Make a new order.": "Invoice expirada. Você não confirmou a publicação do pedido a tempo. Faça um novo pedido.",
  "This order has been cancelled by the maker": "Este pedido foi cancelado pelo criador",
  "Invoice expired. You did not confirm taking the order in time.": "Invoice expirada. Você não confirmou a aceitação do pedido a tempo.",
  "Invalid Order Id": "ID de Ordem inválido",
  "You must have a robot avatar to see the order details": "Você precisa ter um avatar de robô para ver os detalhes do pedido",
  "This order has been cancelled collaborativelly": "Este pedido foi cancelado colaborativamente",
  "This order is not available": "Este pedido não está disponível",
  "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/RoboSats/robosats/issues": "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/RoboSats/robosats/issues"
}
