{
  "#1": "Phrases in basic/Main.tsx",
  "Using Testnet Bitcoin": "Kutumia Testnet Bitcoin",
  "#2": "Phrases in basic/BookPage/index.tsx",
  "Chart": "Chatu",
  "List": "Orodha",
  "Map": "Map",
  "Search": "Search",
  "#3": "Phrases in basic/MakerPage/index.tsx",
  "Existing orders match yours!": "Amri zilizopo zinafanana na yako!",
  "#4": "Phrases in basic/NavBar/AppBar/index.tsx",
  "Garage": "Ghala",
  "Offers": "Ofa",
  "#5": "Phrases in basic/NavBar/DesktopBar/MoreTooltip.tsx",
  "Community and public support": "Jumuiya na msaada wa umma",
  "Exchange summary": "Muhtasari wa Ubadilishanaji",
  "Learn RoboSats": "Jifunze RoboSats",
  "RoboSats information": "Taarifa za RoboSats",
  "client for nerds": "mteja kwa wenye maarifa",
  "#6": "Phrases in basic/NavBar/DesktopBar/index.tsx",
  "Create": "Unda",
  "More": "Zaidi",
  "Order": "Amri",
  "Settings": "Mipangilio",
  "#7": "Phrases in basic/OrderPage/index.tsx",
  "Contract": "Mkataba",
  "Finish": "Kumaliza",
  "Publish": "Chapisha",
  "Setup": "Weka",
  "Take": "Chukua",
  "Trade": "Biashara",
  "Wait": "Subiri",
  "#8": "Phrases in basic/RobotPage/Onboarding.tsx",
  "1. Generate a token": "1. Unda alama",
  "2. Meet your robot identity": "2. Tambua utambulisho wako wa roboti",
  "3. Browse or create an order": "3. Tafuta au unda amri",
  "Building your robot!": "Kujenga roboti yako!",
  "Continue": "Endelea",
  "Generate token": "Unda alama",
  "Hi! My name is": "Halo! Jina langu ni",
  "If you need help on your RoboSats journey join our public support": "Ikiwa unahitaji msaada katika safari yako ya RoboSats, jiunge na msaada wetu wa umma",
  "RoboSats is a peer-to-peer marketplace. You can browse the public offers or create a new one.": "RoboSats ni soko la mtu kwa mtu. Unaweza kutazama ofa za umma au kuunda moja mpya.",
  "See profile": "Angalia wasifu",
  "SimpleX group": "SimpleX group",
  "Store it somewhere safe!": "Uihifadhi mahali salama!",
  "This is your trading avatar": "Hii ni avatar yako ya biashara",
  "This temporary key gives you access to a unique and private robot identity for your trade.": "Funguo hii ya muda inakupa ufikiaji wa utambulisho wa roboti wa kipekee na binafsi kwa biashara yako.",
  "You can also add your own random characters into the token or": "Pia unaweza kuongeza wahusika wako wa nasibu ndani ya alama au",
  "or visit the robot school for documentation.": "au tembelea shule ya roboti kwa nyaraka.",
  "roll again": "chezesha tena",
  "#9": "Phrases in basic/RobotPage/RobotProfile.tsx",
  "Active order #{{orderID}}": "Amri hai #{{orderID}}",
  "Add Robot": "Ongeza Roboti",
  "Building...": "Inajengwa...",
  "Claim Rewards": "Claim Rewards",
  "Delete Robot": "Futa Roboti",
  "Last order #{{orderID}}": "Amri ya mwisho #{{orderID}}",
  "Looking for orders!": "Inatafuta amri!",
  "No existing orders found": "Hakuna amri zilizopo zilizopatikana",
  "Reusing trading identity degrades your privacy against other users, coordinators and observers.": "Kutumia tena utambulisho wa biashara hupunguza faragha yako dhidi ya watumiaji wengine, waongozaji na waangalizi.",
  "Robot Garage": "Ghala la Roboti",
  "Store your token safely": "Hifadhi alama yako kwa usalama",
  "#10": "Phrases in basic/RobotPage/TokenInput.tsx",
  "Copied!": "Imekopiwa!",
  "Not enough entropy, make it more complex": "Utaratibu haifai, ifanye kuwa ngumu zaidi",
  "The token is too short": "Alama ni fupi sana",
  "#11": "Phrases in basic/RobotPage/Welcome.tsx",
  "A Simple and Private LN P2P Exchange": "Kubadilishana LN P2P Rahisi na Binafsi",
  "Create a new robot and learn to use RoboSats": "Unda roboti mpya na ujifunze kutumia RoboSats",
  "Fast Generate Order": "Kuunda Agizo kwa Haraka",
  "Recover an existing robot using your token": "Rejesha roboti iliyopo kwa kutumia alama yako",
  "Recovery": "Kurejesha",
  "Search for Orders": "Search for Orders",
  "Start": "Anza",
  "#12": "Phrases in basic/SettingsPage/Coordinators.tsx",
  "Coordinators": "Waongozaji",
  "#13": "Phrases in basic/TopBar/index.tsx",
  "You need to enable nostr to receive notifications.": "You need to enable nostr to receive notifications.",
  "#14": "Phrases in basic/TopBar/MenuDrawer/index.tsx",
  "Client info": "Client info",
  "Community": "Jumuiya",
  "Connected to Tor network": "Imeunganishwa kwenye mtandao wa Tor",
  "Connecting to Tor network": "Inaunganisha kwa mtandao wa Tor",
  "Connection error": "Hitilafu ya muunganisho",
  "Initializing Tor daemon": "Inaanzisha Tor daemon",
  "RoboSats": "RoboSats",
  "#15": "Phrases in components/BookTable/BookControl.tsx",
  "ANY": "YOYOTE",
  "Buy": "Nunua",
  "DESTINATION": "MARUDIO",
  "I want to": "Nataka",
  "METHOD": "NJIA",
  "Select Host": "Chagua Mwenyeji",
  "Select Order Type": "Chagua Aina ya Agizo",
  "Select Payment Currency": "Chagua Sarafu ya Malipo",
  "Select Payment Method": "Chagua Njia ya Malipo",
  "Sell": "Uza",
  "Swap In": "Badilisha Ndani",
  "Swap Out": "Badilisha Nje",
  "and use": "na tumia",
  "hosted by": "kilichohifadhiwa na",
  "pay with": "lipa kwa",
  "#16": "Phrases in components/BookTable/index.tsx",
  "Add filter": "Ongeza kichujio",
  "Amount": "Kiasi",
  "An error occurred.": "Kuna hitilafu iliyotokea.",
  "And": "Na",
  "Be the first one to create an order": "Kuwa wa kwanza kuunda agizo",
  "Bond": "Dhamana",
  "Column title": "Kichwa cha Kolaamu",
  "Columns": "Kolaamu",
  "Currency": "Sarafu",
  "Delete": "Futa",
  "Destination": "Eneo la Kusudi",
  "Expiry": "Muda wa Kukamilika",
  "Filter": "Chuja",
  "Filter value": "Thamani ya Kichujio",
  "Find column": "Tafuta kolaamu",
  "Hide": "Ficha",
  "Hide all": "Ficha yote",
  "Is": "Ni",
  "Logic operator": "Msimamizi wa mantiki",
  "Manage columns": "Simamia kolaamu",
  "Menu": "Menyu",
  "No orders found to buy BTC for {{currencyCode}}": "Hakuna amri zilizopatikana za kununua BTC kwa {{currencyCode}}",
  "No orders found to sell BTC for {{currencyCode}}": "Hakuna amri zilizopatikana za kuuza BTC kwa {{currencyCode}}",
  "No results found.": "Hakuna matokeo yaliyopatikana.",
  "Operator": "Msimamizi",
  "Or": "Au",
  "Others": "Wengine",
  "Pay": "Lipia",
  "Payment Method": "Njia ya Malipo",
  "Premium": "Malipo ya Ziada",
  "Price": "Bei",
  "Reorder column": "Panga upya kolaamu",
  "Robot": "Roboti",
  "Sats now": "Sats sasa",
  "Select columns": "Chagua kolaamu",
  "Show all": "Onesha yote",
  "Show columns": "Onesha kolaamu",
  "Show filters": "Onesha vichujio",
  "Sort": "Panga",
  "Sort by ASC": "Panga kwa Kupanda",
  "Sort by DESC": "Panga kwa Kushuka",
  "Timer": "Muda",
  "Unsort": "Sitapanga",
  "Value": "Thamani",
  "any": "yoyote",
  "contains": "ina",
  "ends with": "inaisha na",
  "equals": "inafanana na",
  "false": "sio kweli",
  "is": "ni",
  "is after": "ni baada ya",
  "is any of": "ni moja kati ya",
  "is before": "ni kabla ya",
  "is empty": "ni tupu",
  "is not": "sio",
  "is not empty": "si tupu",
  "is on or after": "ni juu au baada ya",
  "is on or before": "ni juu au kabla ya",
  "no": "hapana",
  "starts with": "inaanza na",
  "true": "kweli",
  "yes": "ndio",
  "#17": "Phrases in components/Charts/DepthChart/index.tsx",
  "#18": "Phrases in components/Charts/MapChart/index.tsx",
  "Accept": "Kubali",
  "By doing so, you will be fetching map tiles from a third-party provider. Depending on your setup, private information might be leaked to servers outside the RoboSats federation.": "Kwa kufanya hivyo, utakuwa unachukua vigae vya ramani kutoka kwa mtoa huduma wa tatu. Kulingana na usanidi wako, taarifa za siri zinaweza kuvuja kwa seva nje ya shirikisho la RoboSats.",
  "Close": "Funga",
  "Download high resolution map?": "Pakua ramani ya ubora wa juu?",
  "Show tiles": "Onyesha vigae",
  "#19": "Phrases in components/Charts/helpers/OrderTooltip/index.tsx",
  "#20": "Phrases in components/Dialogs/About.tsx",
  "(GitHub).": "(GitHub).",
  "(SimpleX)": "(SimpleX)",
  ". RoboSats developers will never contact you. The developers or the coordinators will definitely never ask for your robot token.": ". Watengenezaji wa RoboSats hawatakutafuta. Watengenezaji au waongozaji hawatakaa kuomba kitambulisho chako cha roboti.",
  "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.": "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.",
  "Are there trade limits?": "Je, kuna mipaka ya biashara?",
  "At no point, AnonymousAlice01 and BafflingBob02 have to entrust the bitcoin funds to each other. In case they have a conflict, the RoboSats coordinator will help resolving the dispute.": "Hakuna wakati wowote, AnonymousAlice01 na BafflingBob02 wanapaswa kutoa fedha za bitcoin kwa kila mmoja. Iwapo watakuwa na mgogoro, mratibu wa RoboSats atasaidia kusuluhisha mzozo.",
  "Be aware your fiat payment provider might charge extra fees. In any case, the buyer bears the costs of sending fiat. That includes banking charges, transfer fees and foreign exchange spreads. The seller must receive exactly the amount stated in the order details.": "Kumbuka kuwa mtoa huduma wako wa malipo ya fiat anaweza kutoza ada za ziada. Katika hali yoyote, mnunuzi anabeba gharama za kutuma fiat. Hii inajumuisha ada za benki, ada za uhamisho, na tofauti za foreign exchange. Muuzaji lazima apokee kiasi kilichotajwa kwenye maelezo ya agizo.",
  "Disclaimer": "Taarifa",
  "During a typical order, your trading peer is the only one who can potentially guess anything about you. Keep your chat short and concise. Avoid providing non-essential information other than strictly necessary for the fiat payment.": "Wakati wa agizo la kawaida, mwenzako wa biashara ndiye pekee anayeweza kubashiri lolote kuhusu wewe. Weka gumzo lako fupi na lenye ufupi. Epuka kutoa maelezo yasiyo ya lazima zaidi ya yale tu yanayohitajika kwa malipo ya fiat.",
  "Each RoboSats coordinator will set a maximum trade size to minimize the hassle of lightning routing failures. There is no limits to the number of trades per day. A robot can only have one order at a time. However, you can use multiple robots simultaneously using the Robot garage. Remember to back up your robot tokens!": "Kila mratibu wa RoboSats ataweka kiwango cha juu cha biashara ili kupunguza usumbufu wa kushindwa kwa urambazaji wa umeme. Hakuna mipaka kwa idadi ya biashara kwa siku. Roboti inaweza kuwa na agizo moja tu kwa wakati mmoja. Walakini, unaweza kutumia roboti nyingi wakati mmoja kwa kutumia ghala la roboti. Kumbuka kuhifadhi alama zako za roboti!",
  "How does it work?": "Inafanyaje kazi?",
  "How it works": "Inafanyaje kazi",
  "How to use": "Jinsi ya kutumia",
  "In many countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply.": "Katika nchi nyingi, kutumia RoboSats hakuna tofauti na kutumia Ebay au Craiglist. Udhibiti wako unaweza kutofautiana. Ni jukumu lako kufuata.",
  "Is RoboSats legal in my country?": "Je, RoboSats ni halali katika nchi yangu?",
  "Is RoboSats private?": "Je, RoboSats ni ya faragha?",
  "It is a BTC/FIAT peer-to-peer exchange over lightning.": "Ni ubadilishanaji wa P2P wa BTC/FIAT kupitia umeme.",
  "It simplifies matchmaking and minimizes the need of trust. RoboSats focuses in privacy and speed.": "Inarahisisha kupatanisha na inapunguza haja ya kuaminiana. RoboSats inazingatia faragha na kasi.",
  "Project source code": "Nambari ya chanzo ya mradi",
  "RoboSats is a decentralized exchange with multiple, fully redundant, trade coordinators. The coordinator provides the infrastructure for your trade: mantains the intermediary lightning node, does book keeping, and relays your encrypted chat messages. The coordinator is also the judge in case your order enters a dispute. The coordinator is a trusted role, make sure you trust your coordinator by exploring its profile, webpage, social media and the comments from other users online.": "RoboSats is a decentralized exchange with multiple, fully redundant, trade coordinators. The coordinator provides the infrastructure for your trade: mantains the intermediary lightning node, does book keeping, and relays your encrypted chat messages. The coordinator is also the judge in case your order enters a dispute. The coordinator is a trusted role, make sure you trust your coordinator by exploring its profile, webpage, social media and the comments from other users online.",
  "RoboSats is an open source project ": "RoboSats ni mradi wa chanzo wazi ",
  "The RoboSats client, which you run on your local machine or browser, does not collect or share your IP address, location, name, or personal data. The client encrypts your private messages, which can only be decrypted by your trade partner.": "Mteja wa RoboSats, ambao unaendesha kwenye mashine yako ya ndani au kivinjari, haukusanyi au kushiriki anwani yako ya IP, eneo, jina, au data ya kibinafsi. Mteja anaficha ujumbe wako wa kibinafsi, ambao unaweza kufutwa tu na mwenzako wa biashara.",
  "The coordinator you choose will maintain a database of pseudonymous robots and orders for the application to function correctly. You can further enhance your privacy by using proxy nodes or coinjoining.": "Mratibu unayemchagua ataweka hifadhidata ya roboti za uwongo na maagizo ili programu ifanye kazi kwa usahihi. Unaweza kuboresha faragha yako zaidi kwa kutumia nodi za wakala au kuunganisha sarafu.",
  "The seller faces the same charge-back risk as with any other peer-to-peer service. Paypal or credit cards are not recommended.": "Muuzaji anakabiliwa na hatari ile ile ya kurejesha malipo kama huduma nyingine yoyote ya P2P. Paypal au kadi za mkopo hazipendekezwi.",
  "The trade fee is collected by the robosats coordinator as a compensation for their service. You can see the fees of each coordinator by checking out their profile. The trade fee is split to be covered by both: the order maker and the order taker. Typically, the maker fee will be significantly smaller than the taker fee. In case an onchain address is used to received the Sats a variable swap fee applies. The onchain payout fee can also be seen in the profile of the coordinator.": "Ada ya biashara inakusanywa na mratibu wa robosats kama malipo kwa huduma yao. Unaweza kuona ada za kila mratibu kwa kuangalia wasifu wao. Ada ya biashara imegawanywa ili kufunikwa na wawili: mtengenezaji wa agizo na mpokeaji wa agizo. Kawaida, ada ya mtengenezaji itakuwa ndogo sana kuliko ada ya mpokeaji. Iwapo anwani ya mtandaoni itatumika kupokea Sats, ada ya mabadilishano inayobadilika inatumika. Ada ya malipo ya mtandaoni pia inaweza kuonekana kwenye wasifu wa mratibu.",
  "This is an experimental application, things could go wrong. Trade small amounts!": "Hii ni programu ya majaribio, mambo yanaweza kwenda vibaya. Fanya biashara kwa kiasi kidogo!",
  "This lightning application is provided as is. It is in active development: trade with the utmost caution. There is no private support. Support is only offered via public channels ": "Programu hii ya umeme inatolewa inavyokuwa. Iko katika maendeleo ya kazi: fanya biashara kwa tahadhari kubwa. Hakuna msaada wa kibinafsi. Msaada hutolewa tu kupitia njia za umma ",
  "What are the fees?": "Ada ni zipi?",
  "What are the risks?": "Hatari ni zipi?",
  "What happens if my coordinator goes offline forever?": "Nini kitatokea ikiwa mratibu wangu ataondoka mtandaoni milele?",
  "What is RoboSats?": "RoboSats ni nini?",
  "What is a coordinator?": "Mratibu ni nini?",
  "What is the trust model?": "Mfano wa kuaminiana ni upi?",
  "What payment methods are accepted?": "Njia zipi za malipo zinakubaliwa?",
  "You can also check the full guide in ": "Unaweza pia kuangalia mwongozo kamili kwenye ",
  "You can build more trust on the RoboSats and coordinator infrastructure by inspecting the source code.": "Unaweza kujenga uaminifu zaidi kwenye miundombinu ya RoboSats na mratibu kwa kuchunguza nambari ya chanzo.",
  "You can find a step-by-step description of the trade pipeline in ": "Unaweza kupata maelezo ya hatua kwa hatua ya mchakato wa biashara kwenye ",
  "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if the coordinator goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if the coordinator disappears. This window is usually about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels or directly to your trade coordinator using one of the contact methods listed on their profile.": "Sats zako zitakurudia. Ankara ya kushikilia yoyote ambayo haijalipwa ingerudiwa kiotomatiki hata kama mratibu atapungua milele. Hili ni kweli kwa dhamana zilizofungiwa na amana za biashara. Walakini, kuna dirisha ndogo kati ya muuzaji anapothibitisha FIAT IMEPOKELEWA na wakati mnunuzi anapokea satoshis wakati fedha zinaweza kupotea kabisa ikiwa mratibu atatoweka. Dirisha hili kwa kawaida huwa ni sekunde 1 hivi. Hakikisha una likwidi ya kutosha ili kuepuka hitilafu za urambazaji. Ikiwa una tatizo lolote, wasiliana kupitia njia za umma za RoboSats au moja kwa moja kwa mratibu wako wa biashara kwa kutumia mojawapo ya njia za mawasiliano zilizoorodheshwa kwenye wasifu wao.",
  "Your trade partner will not know the destination of the Lightning payment. The permanence of the data collected by the coordinators depend on their privacy and data policies. If a dispute arises, a coordinator may request additional information. The specifics of this process can vary from coordinator to coordinator.": "Mwenzako wa biashara hatajua mahali malipo ya Lightning yanakoenda. Ukaaji wa data zilizokusanywa na waandaaji hutegemea sera zao za faragha na data. Ikiwa kutakuwa na mzozo, mratibu anaweza kuomba maelezo ya ziada. Maelezo ya mchakato huu yanaweza kutofautiana kutoka kwa mratibu hadi mratibu.",
  "#21": "Phrases in components/Dialogs/AddNewPaymentMethodDialog.tsx",
  "Add custom payment method": "Ongeza njia ya malipo ya desturi",
  "Add payment method": "Ongeza njia ya malipo",
  "Cancel": "Futa",
  "GitHub": "GitHub",
  "If you want to see it available, consider submitting a request on our ": "Ikiwa unataka kuiona inapatikana, fikiria kuwasilisha ombi kwenye yetu ",
  "Payment method": "Njia ya malipo",
  "Use this free input to add any payment method you would like to offer.": "Tumia pembejeo hii huru kuongeza njia yoyote ya malipo unayotaka kutoa.",
  "#22": "Phrases in components/Dialogs/AuditPGP.tsx",
  "Go back": "Rudi nyuma",
  "Keys": "Funguo",
  "Learn how to verify": "Jifunze jinsi ya kuthibitisha",
  "Messages": "Ujumbe",
  "PGP": "PGP",
  "Peer public key": "Funguo la umma la Mwenzako",
  "Save credentials as a JSON file": "Hifadhi sifa kama faili la JSON",
  "Save messages as a JSON file": "Hifadhi ujumbe kama faili la JSON",
  "The passphrase to decrypt your private key. Only you know it! Do not share. It is also your robot token.": "Nenosiri la kufuta funguo yako binafsi. Wewe pekee ndiye unayelijua! Usiwekeeni wengine. Pia ni nembo yako ya roboti.",
  "Your PGP public key. Your peer uses it to encrypt messages only you can read.": "Funguo la umma la PGP lako. Mwenza wako anatumia hilo kufuta ujumbe ambao unaweza kusoma tu.",
  "Your communication is end-to-end encrypted with OpenPGP. You can verify the privacy of this chat using any tool based on the OpenPGP standard.": "Mawasiliano yako yamefichwa mwisho hadi mwisho kwa kutumia OpenPGP. Unaweza kuthibitisha faragha ya mazungumzo haya kwa kutumia zana yoyote inayotegemea viwango vya OpenPGP.",
  "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.": "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.",
  "Your encrypted private key": "Funguo yako binafsi iliyofutwa",
  "Your encrypted private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "Funguo yako binafsi iliyofutwa. Unaitumia kufuta ujumbe ambao mwenza wako alifuta kwa ajili yako. Pia unaitumia kutia sahihi ujumbe unaoituma.",
  "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.",
  "Your nostr public key. Your peer uses it to encrypt messages only you can read.": "Your nostr public key. Your peer uses it to encrypt messages only you can read.",
  "Your peer PGP public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "Funguo la umma la PGP la mwenzako. Unaitumia kufuta ujumbe ambao yeye tu anaweza kusoma na kuthibitisha kuwa mwenza wako alisaini ujumbe wa kuingia.",
  "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.",
  "Your private key": "Your private key",
  "Your private key passphrase (keep secure!)": "Nenosiri la funguo binafsi lako (lihifadhiwe salama!)",
  "Your public key": "Funguo lako la umma",
  "nostr": "nostr",
  "#23": "Phrases in components/Dialogs/CancelOrder.tsx",
  "Back": "Nyuma",
  "Cancel the order?": "Futa agizo?",
  "Confirm cancellation": "Thibitisha kughairi",
  "If the order is cancelled now but you already tried to pay the invoice, you might loose your bond.": "If the order is cancelled now but you already tried to pay the invoice, you might loose your bond.",
  "#24": "Phrases in components/Dialogs/Client.tsx",
  "... somewhere on Earth!": "... mahali popote duniani!",
  "Made with": "Imetengenezwa kwa",
  "RoboSats client version": "Toleo la mteja wa RoboSats",
  "and": "na",
  "#25": "Phrases in components/Dialogs/Community.tsx",
  "Follow RoboSats in Nostr": "Fuata RoboSats katika Nostr",
  "Github Issues - The Robotic Satoshis Open Source Project": "Masuala ya Github - Mradi wa Chanzo Wazi wa Robotic Satoshis",
  "Join RoboSats SimpleX group": "Jiunge na kikundi cha SimpleX cha RoboSats",
  "Nostr Official Account": "Akaunti Rasmi ya Nostr",
  "RoboSats main public support": "Msaada mkuu wa umma wa RoboSats",
  "Support is only offered via SimpleX. Join our community if you have questions or want to hang out with other cool robots. Please, use our Github Issues if you find a bug or want to see new features!": "Msaada unatolewa tu kupitia SimpleX. Jiunge na jumuiya yetu ikiwa una maswali au unataka kucheza na roboti nyingine nzuri. Tafadhali, tumia Masuala yetu ya Github ikiwa utapata mdudu au unataka kuona huduma mpya!",
  "Tell us about a new feature or a bug": "Tuambie kuhusu huduma mpya au mdudu",
  "#26": "Phrases in components/Dialogs/Coordinator.tsx",
  "...Opening on Nostr gateway. Pubkey copied!": "...Kufungua kupitia lango la Nostr. Ufunguo wa umma umekopwa!",
  "24h contracted volume": "Kiasi kilichoidhinishwa kwa masaa 24",
  "24h non-KYC bitcoin premium": "24h non-KYC bitcoin premium",
  "Book liquidity": "Kitabu cha Likwiditi",
  "CLN version": "Toleo la CLN",
  "Client": "Mteja",
  "Coordinator": "Mratibu",
  "Coordinator Notice": "Notisi ya Mratibu",
  "Coordinator commit hash": "Hash ya ahadi ya Mratibu",
  "Coordinator description": "Maelezo ya Mratibu",
  "Coordinator hosted web app": "Programu ya wavuti iliyoshikiliwa na Mratibu",
  "Coordinator offline": "Mratibu hayupo mtandaoni",
  "Current onchain payout fee": "Ada ya sasa ya malipo ya mtandaoni",
  "Current onchain payout status": "Hali ya sasa ya malipo ya mtandaoni",
  "Development fund supporter: donates {{percent}}% to make RoboSats better.": "Mchangiaji wa mfuko wa maendeleo: anatoa {{percent}}% ili kuboresha RoboSats.",
  "Does not have large trade limits.": "Haina mipaka mikubwa ya biashara.",
  "Download PGP Pubkey. Fingerprint: ": "Pakua PGP Pubkey. Alama ya kidole: ",
  "Established": "Ilianzishwa",
  "Founder: coordinating trades since the testnet federation.": "Mwanzilishi: inaratibu biashara tangu shirikisho la testnet.",
  "Good OpSec: the coordinator follows best practices to protect his and your privacy.": "Usimamizi mzuri wa Uendeshaji: mratibu hufuata mbinu bora za kulinda faragha yake na yako.",
  "LN Node": "Node ya LN",
  "LND version": "Toleo la LND",
  "Large limits: the coordinator has large trade limits.": "Mipaka mikubwa: mratibu ana mipaka mikubwa ya biashara.",
  "Lifetime contracted volume": "Kiasi cha maisha kilichoidhinishwa",
  "Maker fee": "Ada ya Muumba",
  "Market price sources (for multiple the median is calculated)": "Vyanzo vya bei ya soko (kwa kadhaa hesabu ya kati inapatikana)",
  "Matrix channel copied! {{matrix}}": "Njia ya Matrix imekopwa! {{matrix}}",
  "Maximum onchain swap size": "Ukubwa wa juu wa mabadilishano wa mtandaoni",
  "Maximum order size": "Ukubwa wa juu wa agizo",
  "Not a federation founder": "Sio mwanzilishi wa shirikisho",
  "Onchain payouts disabled": "Malipo ya mtandaoni yamezimwa",
  "Policies": "Sera",
  "Public buy orders": "Maagizo ya umma ya kununua",
  "Public sell orders": "Maagizo ya umma ya kuuza",
  "Reddit": "Reddit",
  "RoboSats version": "Toleo la RoboSats",
  "Send Email": "Tuma Barua pepe",
  "Simplex": "Simplex",
  "Stats for Nerds": "Takwimu kwa Wana maarifa",
  "Summary": "Muhtasari",
  "Taker fee": "Ada ya Mpokeaji",
  "Telegram": "Telegram",
  "The privacy practices of this coordinator could improve": "Mazoea ya faragha ya mratibu huyu yanaweza kuboreshwa",
  "Today active robots": "Roboti zinazofanya kazi leo",
  "Website": "Tovuti",
  "X": "X",
  "Zaps voluntarily for development": "Zaps kwa hiari kwa ajili ya maendeleo",
  "#27": "Phrases in components/Dialogs/DeleteRobotConfirmation.tsx",
  "Are you sure you want to permanently delete \"{{robotName}}\"?": "Je, una uhakika unataka kufuta mabaki \"{{robotName}}\"?",
  "Are you sure you want to permanently delete this robot?": "Je, una uhakika unataka kufuta kabisa roboti hii?",
  "Before deleting, make sure you have:": "Kabla ya kufuta, hakikisha una:",
  "Delete Robot?": "Futa Roboti?",
  "Exported any important data": "Imesafirishwa data yoyote muhimu",
  "No active or pending orders": "Hakuna maagizo yanayofanya kazi au yanayosubiri",
  "Stored your robot token safely": "Ihifadhi alama yako ya roboti kwa usalama",
  "⚠️ This action cannot be undone!": "⚠️ Hatua hii haiwezi kubatilishwa!",
  "#28": "Phrases in components/Dialogs/EnableTelegram.tsx",
  "Browser": "Kivinjari",
  "Enable": "Washa",
  "Enable TG Notifications": "Washa Arifa za TG",
  "You will be taken to a conversation with RoboSats telegram bot. Simply open the chat and press Start. Note that by enabling telegram notifications you might lower your level of anonymity.": "Utaelekezwa kwenye mazungumzo na botu ya telegram ya RoboSats. Fungua tu gumzo na bonyeza Anza. Kumbuka kuwa kwa kuwezesha arifa za telegram unaweza kupunguza kiwango chako cha kutotambulika.",
  "#29": "Phrases in components/Dialogs/Exchange.tsx",
  "Enabled RoboSats coordinators": "Waongozaji wa RoboSats walioruhusiwa",
  "Exchange Summary": "Muhtasari wa Kubadilishana",
  "Online RoboSats coordinators": "Waongozaji wa RoboSats mtandaoni",
  "#30": "Phrases in components/Dialogs/F2fMap.tsx",
  "Choose a location": "Chagua eneo",
  "Save": "Hifadhi",
  "#31": "Phrases in components/Dialogs/GoToOrder.tsx",
  "Order URL": "URL ya Agizo",
  "Search order": "Tafuta agizo",
  "#32": "Phrases in components/Dialogs/Learn.tsx",
  "You are about to visit Learn RoboSats. It hosts tutorials and documentation to help you learn how to use RoboSats and understand how it works.": "Unakaribia kutembelea Jifunze RoboSats. Ina tutoriali na nyaraka za kukusaidia kujifunza jinsi ya kutumia RoboSats na kuelewa jinsi inavyofanya kazi.",
  "#33": "Phrases in components/Dialogs/NoRobot.tsx",
  "Generate a robot avatar first. Then create your own order.": "Zalisha avatar ya roboti kwanza. Kisha unda agizo lako mwenyewe.",
  "You do not have a robot avatar": "Huna avatar ya roboti",
  "#34": "Phrases in components/Dialogs/OrderDescription.tsx",
  "Order description": "Order description",
  "{{description}}": "{{description}}",
  "#35": "Phrases in components/Dialogs/Profile.tsx",
  "Coordinators that know your robot:": "Waongozaji wanaomjua roboti yako:",
  "Your Robot": "Roboti yako",
  "#36": "Phrases in components/Dialogs/Recovery.tsx",
  "Enter your robot token to re-build your robot and gain access to its trades.": "Ingiza alama ya roboti yako ili kuijenga upya na kupata ufikiaji wa biashara zake.",
  "Paste token here": "Bandika alama hapa",
  "Recover": "Rejesha",
  "Robot recovery": "Kurejesha roboti",
  "#37": "Phrases in components/Dialogs/Search.tsx",
  "Are you looking to sell your Bitcoins or buy some?": "Are you looking to sell your Bitcoins or buy some?",
  "Choose a currency": "Choose a currency",
  "Do you want to swap from on-chain into Lightning or vice versa?": "Do you want to swap from on-chain into Lightning or vice versa?",
  "Search for orders": "Search for orders",
  "Swap into LN": "Swap into LN",
  "Swap out of LN": "Swap out of LN",
  "You can specify the currency you want to use for your trade.": "You can specify the currency you want to use for your trade.",
  "#38": "Phrases in components/Dialogs/StoreToken.tsx",
  "Back it up!": "Fanya nakala rudufu!",
  "Done": "Imekamilika",
  "Store your robot token": "Hifadhi alama yako ya roboti",
  "You might need to recover your robot avatar in the future: store it safely. You can simply copy it into another application.": "Huenda ukahitaji kurejesha avatar yako ya roboti baadaye: ihifadhi kwa usalama. Unaweza tu kuikopi kwenye programu nyingine.",
  "#39": "Phrases in components/Dialogs/ThirdParty.tsx",
  "Third party description": "Maelezo ya chama cha tatu",
  "#40": "Phrases in components/Dialogs/Update.tsx",
  "Download RoboSats {{coordinatorString}} APK from Github releases": "Pakua RoboSats {{coordinatorString}} APK kutoka kwa matoleo ya Github",
  "Go away!": "Ondoka!",
  "On Android RoboSats app ": "Kwenye programu ya Android ya RoboSats ",
  "On Tor Browser client simply refresh your tab (click here or press Ctrl+Shift+R)": "Katika mteja wa Tor Browser rudufisha tu kichupo chako (bonyeza hapa au bonyeza Ctrl+Shift+R)",
  "On remotely served browser client": "Katika mteja wa kivinjari kinachotolewa kwa mbali",
  "On your own soverign node": "On your own soverign node",
  "The RoboSats coordinator is on version {{coordinatorString}}, but your client app is {{clientString}}. This version mismatch might lead to a bad user experience.": "Mratibu wa RoboSats yuko katika toleo la {{coordinatorString}}, lakini programu yako ya mteja ni {{clientString}}. Mismatch ya toleo hili inaweza kusababisha uzoefu mbaya wa mtumiaji.",
  "Update your RoboSats client": "Sasisha mteja wako wa RoboSats",
  "#41": "Phrases in components/Dialogs/VisitThirdParty.tsx",
  "Open external order": "Fungua agizo la nje",
  "This order is not managed by a RoboSats coordinator. Please ensure you are comfortable with the privacy and trust trade-offs. You will open an external link or app": "Agizo hili halisimamiwi na mratibu wa RoboSats. Tafadhali hakikisha unajisikia raha na faragha na mabadilishano ya kuaminiana. Utafungua kiungo cha nje au programu",
  "#42": "Phrases in components/Dialogs/Warning.tsx",
  "Coordinators of p2p trades are the source of trust, provide the infrastructure, pricing and will mediate in case of dispute. Make sure you research and trust \"{{coordinator_name}}\" before locking your bond. A malicious p2p coordinator can find ways to steal from you.": "Waandaaji wa biashara za p2p ndio chanzo cha uaminifu, wanatoa miundombinu, bei na watasimamia iwapo kutatokea mzozo. Hakikisha unachunguza na kumwamini \"{{coordinator_name}}\" kabla ya kufunga dhamana yako. Mratibu mmbaya wa p2p anaweza kupata njia za kukuibia.",
  "I understand": "Ninaelewa",
  "Warning": "Onyo",
  "#43": "Phrases in components/FederationTable/index.tsx",
  "Add Coordinator": "Add Coordinator",
  "Add coordinator": "Add coordinator",
  "Alias": "Taaluma",
  "Alias already exists": "Taaluma tayari ipo",
  "Enabled": "Imewashwa",
  "Invalid Onion URL": "URL ya Onion si sahihi",
  "Invalid ratings have been filtered.": "Rating ambazo si sahihi zimetengwa.",
  "No coordinators found.": "Hakuna waandaaji waliopatikana.",
  "Rating": "Rating",
  "Reloading. Invalid ratings will be filtered.": "Inapakia upya. Rating ambazo si sahihi zitatengwa.",
  "URL": "URL",
  "Up": "Juu",
  "Verify ratings": "Thibitisha rating",
  "Verifying all ratings might take some time; this window may freeze for a few seconds while the cryptographic certification is in progress.": "Kudhibitisha rating zote kunaweza kuchukua muda; dirisha hili linaweza kuganda kwa sekunde chache wakati uthibitishaji wa kriptografia unaendelea.",
  "#44": "Phrases in components/HostAlert/SelfhostedAlert.tsx",
  "RoboSats client is served from your own node granting you the strongest security and privacy.": "Mteja wa RoboSats anahudumiwa kutoka kwenye node yako mwenyewe ikikupa usalama na faragha imara kabisa.",
  "You are self-hosting RoboSats": "Unaweka mwenyewe RoboSats",
  "#45": "Phrases in components/HostAlert/UnsafeAlert.tsx",
  "You are not using RoboSats privately": "Hutumii RoboSats kibinafsi",
  "#46": "Phrases in components/MakerForm/AmountRange.tsx",
  "From": "Kutoka",
  "to": "hadi",
  "#47": "Phrases in components/MakerForm/MakerForm.tsx",
  " at a {{discount}}% discount": " kwa punguzo la {{discount}}%",
  " at a {{premium}}% premium": " kwa faida ya {{premium}}%",
  " at market price": " kwa bei ya soko",
  "Add New": "Ongeza Mpya",
  "Add geolocation for a face to face trade": "Ongeza geolocation kwa biashara ya uso kwa uso",
  "Amount Range": "Upeo wa Kiasi",
  "Amount of BTC to swap for LN Sats": "Kiasi cha BTC cha kubadilishana kwa LN Sats",
  "Amount of fiat to exchange for bitcoin": "Kiasi cha fiat cha kubadilishana kwa bitcoin",
  "Buy BTC for ": "Nunua BTC kwa ",
  "Buy or Sell Bitcoin?": "Nunua au Uza Bitcoin?",
  "Clear form": "Futa fomu",
  "Description": "Maelezo",
  "Edit order": "Hariri agizo",
  "Enable advanced options": "Washa chaguzi za juu",
  "Enter the destination of the Lightning swap": "Ingiza marudio ya kubadilisha umeme",
  "Escrow/Invoice Timer (HH:mm)": "Muda wa Escrow/Ankara (HH:mm)",
  "Escrow/invoice step length": "Urefu wa hatua ya Escrow/Ankara",
  "Exact Amount": "Kiasi Sahihi",
  "Face to Face Location": "Eneo la Uso kwa Uso",
  "Fiat Payment Method(s)": "Njia za Malipo ya Fiat",
  "Fidelity Bond Size": "Ukubwa wa Dhamana ya Uaminifu",
  "In or Out of Lightning?": "Ndani au Nje ya Umeme?",
  "Must be equal to or shorter than 240 characters": "Must be equal to or shorter than 240 characters",
  "Must be less than {{maxAmount}}": "Lazima iwe chini ya {{maxAmount}}",
  "Must be less than {{max}}%": "Lazima iwe chini ya {{max}}%",
  "Must be more than {{minAmount}}": "Lazima iwe zaidi ya {{minAmount}}",
  "Must be more than {{min}}%": "Lazima iwe zaidi ya {{min}}%",
  "Must be shorter than 65 characters": "Lazima iwe fupi kuliko herufi 65",
  "Onchain amount to receive (BTC)": "Kiasi cha mtandaoni cha kupokea (BTC)",
  "Onchain amount to send (BTC)": "Kiasi cha mtandaoni kwa kutuma (BTC)",
  "Order current rate:": "Kiwango cha sasa cha agizo:",
  "Order for ": "Agizo la ",
  "Password": "Nenosiri",
  "Premium over Market (%)": "Faida juu ya Soko (%)",
  "Public Duration (HH:mm)": "Muda wa Umma (HH:mm)",
  "Public order length": "Urefu wa agizo la umma",
  "Sell BTC for ": "Uza BTC kwa ",
  "Set the skin-in-the-game, increase for higher safety assurance": "Weka ngozi-in-the-game, ongeza kwa uhakikisho wa usalama zaidi",
  "Swap Destination(s)": "Marudio ya Kubadilisha",
  "Swap into LN ": "Badilisha kwa LN ",
  "Swap of ": "Mabadilishano ya ",
  "Swap out of LN ": "Badilisha kutoka LN ",
  "Swap?": "Badilisha?",
  "To protect your privacy, the exact location you pin will be slightly randomized.": "Ili kulinda faragha yako, eneo halisi unaloweka litabadilishwa kuwa la nasibu.",
  "You can add more details about your order.": "You can add more details about your order.",
  "You can optionally set a password so that only the robots you share it with can take this order.": "You can optionally set a password so that only the robots you share it with can take this order.",
  "You must fill the form correctly": "Lazima ujaze fomu kwa usahihi",
  "You receive approx {{swapSats}} LN Sats (fees might vary)": "Unapokea takribani {{swapSats}} LN Sats (ada inaweza kutofautiana)",
  "You send approx {{swapSats}} LN Sats (fees might vary)": "Unatuma takribani {{swapSats}} LN Sats (ada inaweza kutofautiana)",
  "#48": "Phrases in components/MakerForm/SelectCoordinator.tsx",
  "Disabled": "Imezimwa",
  "Loading coordinator info...": "Loading coordinator info...",
  "Maker": "Muumba",
  "Not on-chain swaps.": "Not on-chain swaps.",
  "On-chain swaps.": "On-chain swaps.",
  "Onchain payouts enabled": "Malipo ya mtandaoni yamewezeshwa",
  "Taker": "Mpokeaji",
  "The provider the lightning and communication infrastructure. The host will be in charge of providing support and solving disputes. The trade fees are set by the host. Make sure to only select order hosts that you trust!": "Mtoa huduma wa miundombinu ya umeme na mawasiliano. Mwenyeji atakuwa na jukumu la kutoa msaada na kutatua mizozo. Ada za biashara zimewekwa na mwenyeji. Hakikisha unachagua tu wenyeji wa agizo ambao unawaamini!",
  "#49": "Phrases in components/OrderDetails/TakeButton.tsx",
  "Amount {{currencyCode}}": "Kiasi {{currencyCode}}",
  "Enter amount of fiat to exchange for bitcoin": "Ingiza kiasi cha fiat kubadilishana na bitcoin",
  "Take Order": "Chukua Agizo",
  "Too high": "Juu sana",
  "Too low": "Chini sana",
  "Wait until you can take an order": "Subiri hadi uweze kuchukua agizo",
  "You must specify an amount first": "Lazima uweke kiasi kwanza",
  "You will receive {{satoshis}} Sats (Approx)": "Utapokea {{satoshis}} Sats (Takriban)",
  "You will send {{satoshis}} Sats (Approx)": "Utatuma {{satoshis}} Sats (Takriban)",
  "#50": "Phrases in components/OrderDetails/index.tsx",
  "Accepted payment methods": "Njia za malipo zilizokubaliwa",
  "Acknowledged": "Thibitisha",
  "Amount of Satoshis": "Kiasi cha Satoshis",
  "Deposit": "Amana",
  "Expires in": "Inamalizika ndani ya",
  "F2F location": "Eneo la F2F",
  "ID": "ID",
  "If you receive a fiat transaction, it can be unilatery reverted up to 80 days after the trade has been completed.": "Ikiwa unapokea muamala wa fiat, inaweza kubatilishwa kwa upande mmoja hadi siku 80 baada ya biashara kukamilika.",
  "Order Details": "Maelezo ya Agizo",
  "Order host": "Mwenyeji wa Agizo",
  "Penalty lifted, good to go!": "Adhabu imeondolewa, unaweza kuendelea!",
  "Premium over market price": "Faida juu ya bei ya soko",
  "Price and Premium": "Bei na Faida ya Ziada",
  "Reversible payments": "Reversible payments",
  "Robosats and their coordinators have no control over the legacy fiat system.": "Robosats na wakoodineta wao hawana udhibiti wa mfumo wa fiat wa urithi.",
  "Scammers can exploit this vulnerability in the legacy fiat system to take away both your bitcoin and your fiat.": "Wadanganyifu wanaweza kutumia udhaifu huu katika mfumo wa fiat wa urithi kuchukua bitcoin yako na pesa zako za fiat.",
  "Swap destination": "Marudio ya kubadilisha",
  "The order has expired": "Agizo limekwisha muda",
  "The pinned location is approximate. The exact location for the meeting place must be exchanged in the encrypted chat.": "Eneo lililowekwa ni takriban. Eneo sahihi la pahala pa mkutano lazima libadilishwe katika gumzo lililofichwa.",
  "This order offers one or multiple payment methods that the community has consistently reported as reverting their transactions.": "Agizo hili linatoa njia moja au nyingi za malipo ambazo jamii imeripoti mara kwa mara kuwa zinarudisha miamala yao.",
  "You cannot take an order yet! Wait {{timeMin}}m {{timeSec}}s": "Huwezi kuchukua agizo bado! Subiri {{timeMin}}m {{timeSec}}s",
  "You receive via {{method}} {{amount}}": "Unapokea kupitia {{method}} {{amount}}",
  "You receive {{amount}} Sats (Approx)": "Unapokea {{amount}} Sats (Takriban)",
  "You send via Lightning {{amount}} Sats (Approx)": "Unatuma kupitia Lightning {{amount}} Sats (Takriban)",
  "You send via {{method}} {{amount}}": "Unatuma kupitia {{method}} {{amount}}",
  "{{price}} {{currencyCode}}/BTC - Premium: {{premium}}%": "{{price}} {{currencyCode}}/BTC - Faida ya Ziada: {{premium}}%",
  "#51": "Phrases in components/RobotInfo/index.tsx",
  "Active order!": "Agizo la Kazi!",
  "Claim": "Dai",
  "Enable Telegram Notifications": "Washa Arifa za Telegram",
  "Finished order": "Finished order",
  "Inactive order": "Agizo lisilo hai",
  "Invoice for {{amountSats}} Sats": "Ankara kwa {{amountSats}} Sats",
  "No active orders": "Hakuna maagizo yanayofanya kazi",
  "No orders found": "No orders found",
  "One active order #{{orderID}}": "Agizo moja la kazi #{{orderID}}",
  "Submit": "Wasilisha",
  "Telegram enabled": "Telegram imewezeshwa",
  "There it goes!": "Hapo mwenda!",
  "Use stealth invoices": "Tumia ankara zisizoonekana",
  "You do not have previous orders": "Huna maagizo ya awali",
  "Your compensations": "Malipo yako",
  "Your current order": "Agizo lako la sasa",
  "Your last order #{{orderID}}": "Agizo lako la mwisho #{{orderID}}",
  "#52": "Phrases in components/SettingsForm/index.tsx",
  "API": "API",
  "Build-in": "Build-in",
  "Dark": "Giza",
  "Light": "Mwanga",
  "Mainnet": "Mainnet",
  "Off": "Off",
  "On": "On",
  "Orbot": "Orbot",
  "Testnet": "Testnet",
  "#53": "Phrases in components/TradeBox/CancelButton.tsx",
  "Cancel order": "Ghairi agizo",
  "Copy URL": "Nakili URL",
  "Copy order URL": "Nakili URL ya agizo",
  "Unilateral cancelation (bond at risk!)": "Kufuta kwa upande mmoja (dhamana iko hatarini!)",
  "#54": "Phrases in components/TradeBox/CollabCancelAlert.tsx",
  "You asked for a collaborative cancellation": "Uliomba kughairi kwa ushirikiano",
  "{{nickname}} is asking for a collaborative cancel": "{{nickname}} anaomba kughairi kwa ushirikiano",
  "#55": "Phrases in components/TradeBox/TradeSummary.tsx",
  "Buyer": "Mnunuzi",
  "Contract exchange rate": "Kiwango cha kubadilishana kwa mkataba",
  "Coordinator trade revenue": "Mapato ya biashara ya mratibu",
  "Export trade summary": "Hamisha muhtasari wa biashara",
  "Maker bond": "Dhamana ya Mtengenezaji",
  "Mining fee": "Ada ya Madini",
  "Onchain swap fee": "Ada ya kubadilisha mtandaoni",
  "Received": "Imepokelewa",
  "Routing budget": "Bajeti ya Njia",
  "Seller": "Muuzaji",
  "Sent": "Imetumwa",
  "Taker bond": "Dhamana ya Mpokeaji",
  "Trade Summary": "Muhtasari wa Biashara",
  "Unlocked": "Imefunguliwa",
  "User role": "Nafasi ya mtumiaji",
  "{{bondSats}} Sats ({{bondPercent}}%)": "{{bondSats}} Sats ({{bondPercent}}%)",
  "{{miningFeeSats}} Sats": "{{miningFeeSats}} Sats",
  "{{revenueSats}} Sats": "{{revenueSats}} Sats",
  "{{routingFeeSats}} Sats": "{{routingFeeSats}} Sats",
  "{{swapFeeSats}} Sats ({{swapFeePercent}}%)": "{{swapFeeSats}} Sats ({{swapFeePercent}}%)",
  "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)": "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)",
  "#56": "Phrases in components/TradeBox/WalletsButton.tsx",
  "See Compatible Wallets": "Angalia Wallets Zilizooana",
  "#57": "Phrases in components/TradeBox/Dialogs/ConfirmCancel.tsx",
  "Confirm Cancel": "Thibitisha Kughairi",
  "If the order is cancelled now you will lose your bond.": "Ikiwa agizo litaghairiwa sasa utapoteza dhamana yako.",
  "#58": "Phrases in components/TradeBox/Dialogs/ConfirmCollabCancel.tsx",
  "Accept Cancelation": "Kubali Kughairisha",
  "Ask for Cancel": "Omba Kughairisha",
  "Collaborative cancel the order?": "Ghairi agizo kwa ushirikiano?",
  "The trade escrow has been posted. The order can be cancelled only if both, maker and taker, agree to cancel.": "Escrow ya biashara imewekwa. Agizo linaweza kughairiwa tu ikiwa pande zote mbili, mtengenezaji na mpokeaji, wanakubaliana kughairi.",
  "Your peer has asked for cancellation": "Mwenzako ameomba kughairi",
  "#59": "Phrases in components/TradeBox/Dialogs/ConfirmDispute.tsx",
  "Agree and open dispute": "Kubali na fungua mzozo",
  "Disagree": "Pinga",
  "Do you want to open a dispute?": "Je, unataka kufungua mzozo?",
  "Make sure to EXPORT the chat log. The staff might request your exported chat log JSON in order to solve discrepancies. It is your responsibility to store it.": "Hakikisha KUSAFIRISHA log ya gumzo. Wafanyikazi wanaweza kuomba logi yako ya gumzo iliyosafirishwa ya JSON ili kutatua tofauti. Ni jukumu lako kuihifadhi.",
  "The RoboSats staff will examine the statements and evidence provided. You need to build a complete case, as the staff cannot read the chat. It is best to provide a burner contact method with your statement. The satoshis in the trade escrow will be sent to the dispute winner, while the dispute loser will lose the bond.": "Wafanyakazi wa RoboSats watachunguza maelezo na ushahidi uliotolewa. Unahitaji kujenga kesi kamili, kwani wafanyakazi hawawezi kusoma gumzo. Ni bora kutoa njia ya mawasiliano ya muda mfupi na taarifa yako. Satoshis zilizomo katika escrow ya biashara zitatumwa kwa mshindi wa mzozo, wakati mpotezaji wa mzozo atapoteza dhamana.",
  "#60": "Phrases in components/TradeBox/Dialogs/ConfirmFiatReceived.tsx",
  "Confirm": "Thibitisha",
  "Confirming will finalize the trade.": "Kuthibitisha kumaliza biashara.",
  "If you have received the payment and do not click confirm, you risk losing your bond.": "Ikiwa umepokea malipo na haukubofya kuthibitisha, unahatarisha kupoteza dhamana yako.",
  "Only confirm after {{amount}} {{currencyCode}} have arrived to your account.": "Thibitisha baada tu ya {{amount}} {{currencyCode}} kufika kwenye akaunti yako.",
  "Some fiat payment methods might reverse their transactions up to 80 days after they are completed. Please keep this token and your order data in case you need to use them as proof.": "Baadhi ya njia za malipo za fiat zinaweza kubatilisha miamala yao hadi siku 80 baada ya kukamilika. Tafadhali weka tokeni hii na data ya agizo lako endapo utahitaji kuitumia kama ushahidi.",
  "The satoshis in the escrow will be released to the buyer:": "Satoshis zilizomo ndani ya escrow zitaachiliwa kwa mnunuzi:",
  "✅ Confirm you received {{amount}} {{currencyCode}}?": "✅ Thibitisha unapokea {{amount}} {{currencyCode}}?",
  "#61": "Phrases in components/TradeBox/Dialogs/ConfirmFiatSent.tsx",
  "Confirming will allow your peer to finalize the trade.": "Kuthibitisha kutamruhusu mwenzako kumaliza biashara.",
  "If you have not yet sent it and you still proceed to falsely confirm, you risk losing your bond.": "Ikiwa bado hauijatuma na bado unaendelea kuthibitisha kimakosa, unahatarisha kupoteza dhamana yako.",
  "✅ Confirm you sent {{amount}} {{currencyCode}}?": "✅ Thibitisha unatuma {{amount}} {{currencyCode}}?",
  "#62": "Phrases in components/TradeBox/Dialogs/ConfirmUndoFiatSent.tsx",
  "READ. In case your payment to the seller has been blocked and it is absolutely impossible to finish the trade, you can revert your confirmation of \"Fiat sent\". Do so only if you and the seller have ALREADY AGREED in the chat to proceed to a collaborative cancellation. After confirming, the \"Collaborative cancel\" button will be visible again. Only click this button if you know what you are doing. First time users of RoboSats are highly discouraged from performing this action! Make 100% sure your payment has failed and the amount is in your account.": "SOMA. Iwapo malipo yako kwa muuzaji yamezuiwa na haiwezekani kabisa kumaliza biashara, unaweza kubadilisha uthibitisho wako wa \"Fiat imetumwa\". Fanya hivyo tu ikiwa wewe na muuzaji Tayari MMEkubaliana katika gumzo kuendelea na kughairiwa kwa ushirikiano. Baada ya kuthibitisha, kitufe cha \"Kughairi kwa Ushirikiano\" kitaonekana tena. Bonyeza kitufe hiki tu ikiwa unajua unachofanya. Watumiaji wa mara ya kwanza wa RoboSats wanaashauriwa sana kutekeleza hatua hii! Hakikisha kwa 100% kwamba malipo yako yameshindwa na kiasi kimo kwenye akaunti yako.",
  "Revert the confirmation of fiat sent?": "Rudisha uthibitisho wa fiat iliyotumwa?",
  "Wait ({{time}})": "Subiri ({{time}})",
  "#63": "Phrases in components/TradeBox/EncryptedChat/ChatHeader/index.tsx",
  "...waiting": "...inasubiri",
  "Activate slow mode (use it when the connection is slow)": "Wezesha hali ya upole (itumie wakati muunganisho ni polepole)",
  "Peer": "Mwenza",
  "You": "Wewe",
  "connected": "imeunganishwa",
  "disconnected": "imekatika",
  "#64": "Phrases in components/TradeBox/EncryptedChat/EncryptedSocketChat/index.tsx",
  "Type a message": "Andika ujumbe",
  "#65": "Phrases in components/TradeBox/EncryptedChat/EncryptedTurtleChat/index.tsx",
  "Send": "Tuma",
  "#66": "Phrases in components/TradeBox/EncryptedChat/MessageCard/index.tsx",
  "#67": "Phrases in components/TradeBox/Forms/LightningPayout.tsx",
  "Advanced options": "Chaguzi za hali ya juu",
  "Invoice to wrap": "Ankara ya kufunga",
  "Payout Lightning Invoice": "Ankara ya Malipo ya Umeme",
  "Proxy Budget": "Bajeti ya Wakala",
  "Routing Budget": "Bajeti ya Mara",
  "Server": "Kivinjari",
  "Submit invoice for {{amountSats}} Sats": "Wasilisha ankara kwa {{amountSats}} Sats",
  "Use Lnproxy": "Tumia Lnproxy",
  "Wrap": "Funika",
  "Wrapped invoice": "Ankara iliyofungwa",
  "#68": "Phrases in components/TradeBox/Forms/OnchainPayout.tsx",
  "Bitcoin Address": "Anwani ya Bitcoin",
  "Final amount you will receive": "Kiasi cha mwisho utakapopokea",
  "Invalid": "Batili",
  "Mining Fee": "Ada ya Madini",
  "RoboSats coordinator will do a swap and send the Sats to your onchain address.": "Mratibu wa RoboSats atafanya kubadilishana na kutuma Sats kwa anwani yako ya mtandaoni.",
  "Swap fee": "Ada ya Kubadilishana",
  "#69": "Phrases in components/TradeBox/Prompts/Chat.tsx",
  "Audit Chat": "Audit Chat",
  "Beware scams": "Kuwa makini na udanganyifu",
  "Collaborative Cancel": "Ghairi kwa Ushirikiano",
  "Confirm {{amount}} {{currencyCode}} received": "Thibitisha {{amount}} {{currencyCode}} imepokelewa",
  "Confirm {{amount}} {{currencyCode}} sent": "Thibitisha {{amount}} {{currencyCode}} imetumwa",
  "Export": "Hamisha",
  "Open Dispute": "Fungua Mzozo",
  "Order options": "Order options",
  "Payment failed?": "Malipo yameshindwa?",
  "Say hi! Be helpful and concise. Let them know how to send you {{amount}} {{currencyCode}}.": "Sema hi! Kuwa msaada na mafupi. Waambie jinsi ya kukutumia {{amount}} {{currencyCode}}.",
  "To open a dispute you need to wait": "Ili kufungua mzozo unahitaji kusubiri",
  "Wait for the seller to confirm he has received the payment.": "Subiri muuzaji kuthibitisha kuwa amepokea malipo.",
  "#70": "Phrases in components/TradeBox/Prompts/Dispute.tsx",
  "A contact method is required": "Njia ya mawasiliano inahitajika",
  "Attach chat logs": "Ambatanisha logi za gumzo",
  "Attaching chat logs helps the dispute resolution process and adds transparency. However, it might compromise your privacy.": "Kuweka pamoja logi za gumzo husaidia mchakato wa kutatua mzozo na kuongeza uwazi. Hata hivyo, inaweza kudhoofisha faragha yako.",
  "Contact method": "Njia ya mawasiliano",
  "Other": "Nyingine",
  "Please, submit your statement. Be clear and specific about what happened and provide the necessary evidence. You MUST provide a contact method: burner email, SimpleX incognito link or telegram (make sure to create a searchable username) to follow up with the dispute solver (your trade host/coordinator). Disputes are solved at the discretion of real robots (aka humans), so be as helpful as possible to ensure a fair outcome.": "Tafadhali, wasilisha taarifa yako. Kuwa wazi na kutoa maelezo kuhusu kilichotokea na toa ushahidi unaohitajika. LAZIMA utoe njia ya mawasiliano: barua pepe ya kuchoma, kiungo cha siri cha SimpleX au telegramu (hakikisha kuwa una jina la mtumiaji linaloweza kutafutika) ili kufuatilia suluhisho la mzozo (mwenyeji wako wa biashara / mratibu). Mizozo inatatuliwa kwa hiari ya roboti halisi (watu), kwa hivyo kuwa msaada kadiri iwezekanavyo ili kuhakikisha matokeo ya haki.",
  "Select a contact method": "Chagua njia ya mawasiliano",
  "Submit dispute statement": "Wasilisha taarifa ya mzozo",
  "The statement is too short. Make sure to be thorough.": "Taarifa ni fupi sana. Hakikisha kuwa na kina.",
  "#71": "Phrases in components/TradeBox/Prompts/DisputeLoser.tsx",
  "Unfortunately you have lost the dispute. If you think this is a mistake you can ask to re-open the case by contacting your coordinator. If you think your coordinator was unfair, please fill a claim via email to robosats@protonmail.com": "Kwa bahati mbaya umepoteza mzozo. Ikiwa unafikiri hili ni kosa, unaweza kuomba ufungue kesi tena kwa kuwasiliana na mratibu wako. Ikiwa unafikiri mratibu wako alikuwa asiye haki, tafadhali jaza dai kupitia barua pepe robosats@protonmail.com",
  "#72": "Phrases in components/TradeBox/Prompts/DisputeWaitPeer.tsx",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself using that information if you contact your trade coordinator.": "Tafadhali, hifadhi taarifa zinazohitajika kutambua agizo lako na malipo yako: ID ya agizo; vigezo vya malipo vya dhamana au escrow (angalia kwenye mkoba wako wa umeme); kiasi kamili cha satoshis; na jina la utani la roboti. Utalazimika kujitambulisha ukitumia taarifa hizo ikiwa utawasiliana na mratibu wako wa biashara.",
  "We are waiting for your trade counterpart statement. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods.": "Tunasubiri taarifa ya mwenzako wa kibiashara. Ikiwa unasita kuhusu hali ya mzozo au unataka kuongeza maelezo zaidi, wasiliana na mratibu wa agizo lako la biashara (mwenyeji) kupitia mojawapo ya njia zao za mawasiliano.",
  "#73": "Phrases in components/TradeBox/Prompts/DisputeWaitResolution.tsx",
  "Both statements have been received, wait for the staff to resolve the dispute. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods. If you did not provide a contact method, or are unsure whether you wrote it right, write your coordinator immediately.": "Taarifa zote mbili zimepokelewa, subiri kwa wafanyakazi kusuluhisha mzozo. Ikiwa unasita kuhusu hali ya mzozo au unataka kuongeza maelezo zaidi, wasiliana na mratibu wa agizo lako la biashara (mwenyeji) kupitia mojawapo ya njia zao za mawasiliano. Ikiwa hukupeana njia ya mawasiliano, au una uhakika ikiwa umeiandika vizuri, andika kwa mratibu wako mara moja.",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself as the user involved in this trade via email (or other contact methods).": "Tafadhali, hifadhi taarifa zinazohitajika kutambua agizo lako na malipo yako: ID ya agizo; vigezo vya malipo vya dhamana au escrow (angalia kwenye mkoba wako wa umeme); kiasi kamili cha satoshis; na jina la utani la roboti. Utalazimika kujitambulisha kama mtumiaji aliyehusika katika biashara hii kupitia barua pepe (au njia nyingine za mawasiliano).",
  "#74": "Phrases in components/TradeBox/Prompts/DisputeWinner.tsx",
  "You can claim the dispute resolution amount (escrow and fidelity bond) from your profile rewards. If there is anything the staff can help with, do not hesitate to contact to robosats@protonmail.com (or via your provided burner contact method).": "Unaweza kudai kiasi cha suluhisho la mzozo (escrow na dhamana ya ukweli) kutoka kwenye zawadi zako za wasifu. Ikiwa kuna jambo lolote ambalo wafanyakazi wanaweza kusaidia, usisite kuwasiliana na robosats@protonmail.com (au kupitia njia yako ya mawasiliano uliyopeana).",
  "#75": "Phrases in components/TradeBox/Prompts/EscrowWait.tsx",
  "Just hang on for a moment. If the seller does not deposit, you will get your bond back automatically. In addition, you will receive a compensation (check the rewards in your profile).": "Endelea kusubiri kwa muda. Ikiwa muuzaji hatoi amana, utapata dhamana yako tena moja kwa moja. Zaidi, utapokea fidia (angalia zawadi zako kwenye wasifu wako).",
  "We are waiting for the seller to lock the trade amount.": "Tunasubiri muuzaji afunge kiasi cha biashara.",
  "#76": "Phrases in components/TradeBox/Prompts/Expired.tsx",
  "Enter a password again": "Enter a password again",
  "Renew Order": "Fanya upya Agizo",
  "#77": "Phrases in components/TradeBox/Prompts/LockInvoice.tsx",
  "Copy to clipboard": "Nakili kwenye ubao wa kunakili",
  "This is a hold invoice, it will freeze in your wallet. It will be charged only if you cancel or lose a dispute.": "Hii ni ankara ya kushikilia, itafungia kwenye mkoba wako. Itakatwa tu ikiwa utaghairi au kupoteza mzozo.",
  "This is a hold invoice, it will freeze in your wallet. It will be released to the buyer once you confirm to have received the {{currencyCode}}.": "Hii ni ankara ya kushikilia, itafungia kwenye mkoba wako. Itaachiliwa kwa mnunuzi mara tu utakapothibitisha kuwa umepokea {{currencyCode}}.",
  "#78": "Phrases in components/TradeBox/Prompts/Paused.tsx",
  "Unpause Order": "Fungua Amri",
  "Your public order has been paused. At the moment it cannot be seen or taken by other robots. You can choose to unpause it at any time.": "Agizo lako la umma limezuiliwa. Kwa sasa halionekani wala kuchukuliwa na roboti wengine. Unaweza kuchagua kulifungua tena wakati wowote.",
  "#79": "Phrases in components/TradeBox/Prompts/Payout.tsx",
  "Before letting you send {{amountFiat}} {{currencyCode}}, we want to make sure you are able to receive the BTC.": "Kabla ya kukuruhusu kutuma {{amountFiat}} {{currencyCode}}, tunataka kuhakikisha unaweza kupokea BTC.",
  "Lightning": "Lightning",
  "Onchain": "Mtandao",
  "#80": "Phrases in components/TradeBox/Prompts/PayoutWait.tsx",
  "Just hang on for a moment. If the buyer does not cooperate, you will get back the trade collateral and your bond automatically. In addition, you will receive a compensation (check the rewards in your profile).": "Endelea kusubiri kwa muda. Ikiwa mnunuzi hatashirikiana, utapata dhamana ya biashara na dhamana yako kiotomatiki. Zaidi ya hayo, utapokea fidia (angalia tuzo kwenye wasifu wako).",
  "We are waiting for the buyer to post a lightning invoice. Once he does, you will be able to directly communicate the payment details.": "Tunasubiri mnunuzi aweke ankara ya Lightning. Mara atakapofanya hivyo, utaweza kuwasiliana moja kwa moja na maelezo ya malipo.",
  "#81": "Phrases in components/TradeBox/Prompts/PublicWait.tsx",
  "Among public {{currencyCode}} orders (higher is cheaper)": "Miongoni mwa maagizo ya umma ya {{currencyCode}} (ya kiwango cha juu ni ya bei nafuu)",
  "If the order expires untaken, your bond will return to you (no action needed).": "Ikiwa agizo litakufa bila kuchukuliwa, dhamana yako itakurudia (hakuna hatua inayohitajika).",
  "Pause the public order": "Zuia agizo la umma",
  "Premium rank": "Cheo cha Premium",
  "Public orders for {{currencyCode}}": "Maagizo ya umma ya {{currencyCode}}",
  "#82": "Phrases in components/TradeBox/Prompts/RoutingFailed.tsx",
  "Failure reason:": "Sababu ya kushindwa:",
  "Next attempt in": "Jaribio lifuatalo baada ya",
  "Retrying!": "Inajaribu tena!",
  "RoboSats will try to pay your invoice 3 times with a one minute pause in between. If it keeps failing, you will be able to submit a new invoice. Check whether you have enough inbound liquidity. Remember that lightning nodes must be online in order to receive payments.": "RoboSats itajaribu kulipa ankara yako mara 3 na kusubiri kwa dakika moja kila mara. Ikiwa itaendelea kushindwa, utaweza kuwasilisha ankara mpya. Hakikisha una utoshelevu wa fedha zinazoingia. Kumbuka kuwa nodi za lightning lazima ziwe mtandaoni ili kupokea malipo.",
  "Your invoice has expired or more than 3 payment attempts have been made. Submit a new invoice.": "Ankara yako imeisha muda au majaribio zaidi ya 3 ya malipo yamefanywa. Wasilisha ankara mpya.",
  "#83": "Phrases in components/TradeBox/Prompts/SendingSats.tsx",
  "Lightning payments are usually instantaneous, but sometimes a node in the route may be down, which can cause your payout to take up to 24 hours to arrive in your wallet.": "Malipo ya Lightning kwa kawaida ni ya papo hapo, lakini wakati mwingine node katika njia inaweza kuwa chini, ambayo inaweza kusababisha malipo yako kuchukua hadi masaa 24 kufika kwenye mkoba wako.",
  "RoboSats is trying to pay your lightning invoice. Remember that lightning nodes must be online in order to receive payments.": "RoboSats inajaribu kulipa ankara yako ya Lightning. Kumbuka kuwa nodi za lightning lazima ziwe mtandaoni ili kupokea malipo.",
  "Taking too long?": "Inachukua muda mrefu?",
  "#84": "Phrases in components/TradeBox/Prompts/Successful.tsx",
  "Rate your host": "Panga mwenyeji wako",
  "Rate your trade experience": "Panga uzoefu wako wa biashara",
  "Renew": "Fanya upya",
  "RoboSats gets better with more liquidity and users. Tell a bitcoiner friend about Robosats!": "RoboSats inaboreshwa kwa utoshelevu zaidi na watumiaji. Mwambie rafiki yako wa Bitcoin kuhusu RoboSats!",
  "Sending coins": "Sending coins",
  "Start Again": "Anza Tena",
  "Thank you for using Robosats!": "Asante kwa kutumia Robosats!",
  "Thank you! {{shortAlias}} loves you too": "Asante! {{shortAlias}} anakupenda pia",
  "You need to enable nostr to rate your coordinator.": "Unahitaji kuwezesha nostr ili kupanga mratibu wako.",
  "Your TXID": "Kitambulisho chako cha TX",
  "#85": "Phrases in components/TradeBox/Prompts/TakerFound.tsx",
  "Please wait for the taker to lock a bond. If the taker does not lock a bond in time, the order will be made public again.": "Tafadhali subiri mpokeaji aweke dhamana. Ikiwa mpokeaji hataweka dhamana kwa wakati, agizo litatangazwa tena kwa umma.",
  "#86": "Phrases in pro/LandingDialog/index.tsx",
  "A robot technician has arrived!": "Mfundi wa roboti amewasili!",
  "I bring my own robots, here they are. (Drag and drop workspace.json)": "Nimeleta roboti zangu mwenyewe, hapa zipo. (Buruta na weka workspace.json)",
  "My first time here. Generate a new Robot Garage and extended robot token (xToken).": "Kwa mara ya kwanza hapa. Unda Ghala mpya la Roboti na xToken",
  "#87": "Phrases in pro/ToolBar/index.tsx",
  "Customize viewports": "Sanidi maoni",
  "Freeze viewports": "Gandamiza maoni",
  "unsafe_alert": "Kulinda data na faragha yako tumia <1>Tor Browser</1> na tembelea tovuti ya <3>Onion</3> iliyohifadhiwa na shirikisho. Au mwenyeji yako mwenyewe <5>Client.</5>",
  "let_us_know_hot_to_improve": "Tuambie jinsi jukwaa linavyoweza kuboreshwa (<1>Telegram</1> / <3>Github</3>)",
  "open_dispute": "Kufungua mzozo unahitaji kusubiri <1><1/>",
  "Waiting for maker bond": "Kusubiri dhamana ya mtengenezaji",
  "Public": "Umma",
  "Waiting for taker bond": "Kusubiri dhamana ya mpokeaji",
  "Cancelled": "Imefutwa",
  "Expired": "Imekwisha muda",
  "Waiting for trade collateral and buyer invoice": "Kusubiri dhamana ya biashara na ankara ya mnunuzi",
  "Waiting only for seller trade collateral": "Kusubiri tu dhamana ya biashara ya muuzaji",
  "Waiting only for buyer invoice": "Kusubiri tu ankara ya mnunuzi",
  "Sending fiat - In chatroom": "Inatumwa fiat - Katika chumba cha mazungumzo",
  "Fiat sent - In chatroom": "Fiat imetumwa - Katika chumba cha mazungumzo",
  "In dispute": "Katika mzozo",
  "Collaboratively cancelled": "Kufutwa kwa ushirikiano",
  "Sending satoshis to buyer": "Inatuma satoshis kwa mnunuzi",
  "Successful trade": "Biashara imefanikiwa",
  "Failed lightning network routing": "Njia ya mtandao wa umeme imeshindwa",
  "Wait for dispute resolution": "Subiri suluhisho la mzozo",
  "Maker lost dispute": "Mtengenezaji amepoteza mzozo",
  "Taker lost dispute": "Mpokeaji amepoteza mzozo",
  "Invoice expired. You did not confirm publishing the order in time. Make a new order.": "Ankara imeisha muda. Hukuthibitisha kuchapisha agizo kwa wakati. Fanya agizo jipya.",
  "This order has been cancelled by the maker": "Agizo hili limefutwa na mtengenezaji",
  "Invoice expired. You did not confirm taking the order in time.": "Ankara imeisha muda. Hukuthibitisha kuchukua agizo kwa wakati.",
  "Invalid Order Id": "Kitambulisho cha Agizo Sio Halali",
  "You must have a robot avatar to see the order details": "Lazima uwe na avatar ya roboti ili kuona maelezo ya agizo",
  "This order has been cancelled collaborativelly": "Agizo hili limefutwa kwa ushirikiano",
  "This order is not available": "Agizo hili halipo",
  "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/RoboSats/robosats/issues": "Robotic Satoshis wanaofanya kazi katika ghala hawakukuelewa. Tafadhali, jaza Tatizo katika Github"
}
