{
  "#1": "Phrases in basic/Main.tsx",
  "Using Testnet Bitcoin": "Using Testnet Bitcoin",
  "#2": "Phrases in basic/BookPage/index.tsx",
  "Create": "Create",
  "List": "List",
  "Chart": "Chart",
  "#3": "Phrases in basic/RobotPage/RobotProfile.tsx",
  "Building your robot!": "Building your robot!",
  "This is your trading avatar": "โรบอทสำหรับซื้อขาย",
  "Welcome back!": "Welcome back!",
  "Active order #{{orderID}}": "Active order #{{orderID}}",
  "Last order #{{orderID}}": "Last order #{{orderID}}",
  "Reusing trading identity degrades your privacy against other users, coordinators and observers.": "Reusing trading identity degrades your privacy against other users, coordinators and observers.",
  "Add a new Robot": "Add a new Robot",
  "Logout": "Logout",
  "Store your token safely": "รักษา token ของคุณไว้ให้ดี",
  "Robot Garage": "Robot Garage",
  "Building...": "Building...",
  "Add Robot": "Add Robot",
  "Delete Garage": "Delete Garage",
  "#4": "Phrases in basic/RobotPage/TokenInput.tsx",
  "Copied!": "คัดลอกแล้ว!",
  "#5": "Phrases in basic/RobotPage/Onboarding.tsx",
  "1. Generate a token": "1. Generate a token",
  "This temporary key gives you access to a unique and private robot identity for your trade.": "This temporary key gives you access to a unique and private robot identity for your trade.",
  "Generate token": "Generate token",
  "Store it somewhere safe!": "Store it somewhere safe!",
  "You can also add your own random characters into the token or": "You can also add your own random characters into the token or",
  "roll again": "roll again",
  "Continue": "Continue",
  "2. Meet your robot identity": "2. Meet your robot identity",
  "Hi! My name is": "Hi! My name is",
  "3. Browse or create an order": "3. Browse or create an order",
  "RoboSats is a peer-to-peer marketplace. You can browse the public offers or create a new one.": "RoboSats is a peer-to-peer marketplace. You can browse the public offers or create a new one.",
  "Offers": "Offers",
  "If you need help on your RoboSats journey join our public support": "If you need help on your RoboSats journey join our public support",
  "Telegram group": "Telegram group",
  "or visit the robot school for documentation.": "or visit the robot school for documentation.",
  "Learn RoboSats": "เรียนรู้การใช้งาน",
  "See profile": "See profile",
  "#6": "Phrases in basic/RobotPage/index.tsx",
  "The token is too short": "The token is too short",
  "Not enough entropy, make it more complex": "Not enough entropy, make it more complex",
  "Connecting to TOR": "Connecting to TOR",
  "Connection encrypted and anonymized using TOR.": "Connection encrypted and anonymized using TOR.",
  "This ensures maximum privacy, however you might feel the app behaves slow. If connection is lost, restart the app.": "This ensures maximum privacy, however you might feel the app behaves slow. If connection is lost, restart the app.",
  "#7": "Phrases in basic/RobotPage/Recovery.tsx",
  "Robot recovery": "Robot recovery",
  "Enter your robot token to re-build your robot and gain access to its trades.": "Enter your robot token to re-build your robot and gain access to its trades.",
  "Paste token here": "Paste token here",
  "Recover": "Recover",
  "#8": "Phrases in basic/RobotPage/Welcome.tsx",
  "A Simple and Private LN P2P Exchange": "A Simple and Private LN P2P Exchange",
  "Create a new robot and learn to use RoboSats": "Create a new robot and learn to use RoboSats",
  "Start": "Start",
  "Recover an existing robot using your token": "Recover an existing robot using your token",
  "Recovery": "Recovery",
  "Fast Generate Robot": "Fast Generate Robot",
  "#9": "Phrases in basic/NavBar/MoreTooltip.tsx",
  "RoboSats information": "RoboSats information",
  "Community and public support": "Community and public support",
  "Coordinator summary": "Coordinator summary",
  "Stats for nerds": "Stats for nerds",
  "#10": "Phrases in basic/NavBar/NavBar.tsx",
  "Robot": "โรบอท",
  "Order": "รายการซื้อขาย",
  "Settings": "Settings",
  "More": "More",
  "#11": "Phrases in basic/OrderPage/index.tsx",
  "Contract": "Contract",
  "#12": "Phrases in basic/MakerPage/index.tsx",
  "Existing orders match yours!": "Existing orders match yours!",
  "#13": "Phrases in pro/LandingDialog/index.tsx",
  "A robot technician has arrived!": "A robot technician has arrived!",
  "My first time here. Generate a new Robot Garage and extended robot token (xToken).": "My first time here. Generate a new Robot Garage and extended robot token (xToken).",
  "I bring my own robots, here they are. (Drag and drop workspace.json)": "I bring my own robots, here they are. (Drag and drop workspace.json)",
  "#14": "Phrases in pro/ToolBar/index.tsx",
  "Customize viewports": "Customize viewports",
  "Freeze viewports": "Freeze viewports",
  "#15": "Phrases in components/UnsafeAlert.js",
  "Hide": "ซ่อน",
  "You are self-hosting RoboSats": "คูณกำลัง host RoboSats เอง",
  "RoboSats client is served from your own node granting you the strongest security and privacy.": "RoboSats client is served from your own node granting you the strongest security and privacy.",
  "You are not using RoboSats privately": "ระวัง! ข้อมูลส่วนตัวอาจรั่วไหล",
  "#16": "Phrases in components/TorConnection.tsx",
  "Initializing TOR daemon": "Initializing TOR daemon",
  "Connecting to TOR network": "Connecting to TOR network",
  "Connected to TOR network": "Connected to TOR network",
  "Connection error": "Connection error",
  "#17": "Phrases in components/Charts/DepthChart/index.tsx",
  "Others": "อื่นๆ",
  "Premium": "พรีเมี่ยม",
  "Price": "ราคา",
  "#18": "Phrases in components/OrderDetails/index.tsx",
  "The order has expired": "รายการหมดอายุแล้ว",
  "Penalty lifted, good to go!": "สามารถซื้อขายได้แล้ว!",
  "You cannot take an order yet! Wait {{timeMin}}m {{timeSec}}s": "คุณยังไม่สามารถดำเนินรายการได้! รออีก {{timeMin}} นาที {{timeSec}} วินาที",
  "You send via {{method}} {{amount}}": "You send via {{method}} {{amount}}",
  "You receive via Lightning {{amount}} Sats (Approx)": "You receive via Lightning {{amount}} Sats (Approx)",
  "You send via Lightning {{amount}} Sats (Approx)": "You send via Lightning {{amount}} Sats (Approx)",
  "You receive via {{method}} {{amount}}": "You receive via {{method}} {{amount}}",
  "Order maker": "maker ของรายการ",
  "Order taker": "taker ของรายการ",
  "Order Details": "รายละเอียดรายการ",
  "Order status": "สถานะรายการ",
  "Swap destination": "จุดหมาย",
  "Accepted payment methods": "วิธีชำระเงินเฟียตที่รองรับ",
  "{{price}} {{currencyCode}}/BTC - Premium: {{premium}}%": "{{price}} {{currencyCode}}/BTC - ค่าพรีเมี่ยม: {{premium}}%",
  "Price and Premium": "ราคาและค่าพรีเมี่ยม",
  "Amount of Satoshis": "ปริมาณ Satoshis",
  "Premium over market price": "พรีเมี่ยมจากราคาตลาด",
  "Order ID": "รหัสรายการซื้อขาย",
  "Deposit timer": "ผู้ขายต้องวางเหรียญที่จะขายภายใน",
  "Expires in": "หมดอายุใน",
  "#19": "Phrases in components/OrderDetails/TakeButton.tsx",
  "The maker is away": "ผู้ค้าออฟไลน์",
  "By taking this order you risk wasting your time. If the maker does not proceed in time, you will be compensated in satoshis for 50% of the maker bond.": "หากคุณดำเนินการต่ออาจเป็นการเสียเวลาปล่าวหากผู้ค้าไม่มาดำเนินรายการต่อภายในเวลาที่กำหนด ในกรณีนี้คุณจะได้รับค่าเสียเวลาเป็น satoshi คิดเป็น 50% ของ maker bond",
  "Go back": "กลับ",
  "Sounds fine": "Sounds fine",
  "Wait until you can take an order": "รอจนกว่าคุณจะสามารถรับรายการซื้อขายได้",
  "Take Order": "ดำเนินรายการต่อ",
  "Too low": "ต่ำเกินไป",
  "Too high": "สูงเกินไป",
  "Enter amount of fiat to exchange for bitcoin": "ระบุจำนวนเงินเฟียตที่จะแลกเปลี่ยนกับ bitcoin",
  "Amount {{currencyCode}}": "จำนวน {{currencyCode}}",
  "You must specify an amount first": "คุณต้องระบุจำนวนก่อน",
  "You will receive {{satoshis}} Sats (Approx)": "You will receive {{satoshis}} Sats (Approx)",
  "You will send {{satoshis}} Sats (Approx)": "You will send {{satoshis}} Sats (Approx)",
  "#20": "Phrases in components/Dialogs/StoreToken.tsx",
  "Store your robot token": "เก็บรักษา token โรบอทของคุณ",
  "You might need to recover your robot avatar in the future: store it safely. You can simply copy it into another application.": "คุณอาจต้องใช้โรบอทอีกในอนาคตจึงควรเก็บรักษามันไว้ให้ดี คุณสามารถคัดลอกมันไปเก็บไว้ในแอพพลิเคชั่นอื่นๆได้อย่างง่ายดาย",
  "Back it up!": "อย่าลืมบันทึก!",
  "Done": "เสร็จสิ้น",
  "#21": "Phrases in components/Dialogs/NoRobot.tsx",
  "You do not have a robot avatar": "คุณไม่มีโรบอท",
  "Generate a robot avatar first. Then create your own order.": "Generate a robot avatar first. Then create your own order.",
  "Generate Robot": "สร้างโรบอทใหม่",
  "#22": "Phrases in components/Dialogs/UpdateClient.tsx",
  "Update your RoboSats client": "Update your RoboSats client",
  "The RoboSats coordinator is on version {{coordinatorVersion}}, but your client app is {{clientVersion}}. This version mismatch might lead to a bad user experience.": "The RoboSats coordinator is on version {{coordinatorVersion}}, but your client app is {{clientVersion}}. This version mismatch might lead to a bad user experience.",
  "Download RoboSats {{coordinatorVersion}} APK from Github releases": "Download RoboSats {{coordinatorVersion}} APK from Github releases",
  "On Android RoboSats app ": "On Android RoboSats app ",
  "On your own soverign node": "On your own soverign node",
  "On Tor Browser client simply refresh your tab (click here or press Ctrl+Shift+R)": "On Tor Browser client simply refresh your tab (click here or press Ctrl+Shift+R)",
  "On remotely served browser client": "On remotely served browser client",
  "Go away!": "Go away!",
  "#23": "Phrases in components/Dialogs/EnableTelegram.tsx",
  "Enable TG Notifications": "ใช้การแจ้งเตือน Telegram",
  "You will be taken to a conversation with RoboSats telegram bot. Simply open the chat and press Start. Note that by enabling telegram notifications you might lower your level of anonymity.": "คุณจะเข้าไปยังแชทกับ telegram bot ของ RoboSats ให้คุณกด Start อย่างไรก็ตาม การใช้การแจ้งเตือน telegram จะลดระดับการปกปิดตัวตนของคุณ",
  "Browser": "Browser",
  "Enable": "เปิดใช้งาน",
  "#24": "Phrases in components/Dialogs/CoordinatorSummary.tsx",
  "Coordinator Summary": "Coordinator Summary",
  "Public buy orders": "จำนวนรายการซื้อ",
  "Public sell orders": "จำนวนรายการขาย",
  "Book liquidity": "สภาพคล่องทางบ้ญชี",
  "Today active robots": "จำนวนโรบอทที่ใช้งานในวันนี้",
  "Last 24h mean premium": "Last 24h mean premium",
  "Maker fee": "ค่าธรรมเนียม Maker",
  "Taker fee": "ค่าธรรมเนียม Taker",
  "Current onchain payout fee": "ค่าธรรมเนียมการจ่าย On-chain ตอนนี้",
  "#25": "Phrases in components/Dialogs/Info.tsx",
  "What is RoboSats?": "RoboSats คืออะไร?",
  "It is a BTC/FIAT peer-to-peer exchange over lightning.": "เราคือตลาดนัดสำหรับแลกเปลี่ยนระหว่างเงินเฟียตสกุลใดก็ได้กับ Bitcoin ที่ทำงานโดย lightning network.",
  "It simplifies matchmaking and minimizes the need of trust. RoboSats focuses in privacy and speed.": "เราทำให้การจับคู่ซื้อขายเป็นเรื่องง่ายและลดการอาศัยความไว้ใจ RoboSats มุ่งเน้นที่ความเป็นส่วนตัวและความสะดวกรวดเร็ว",
  "RoboSats is an open source project ": "RoboSats เป็นโปรเจค open source",
  "(GitHub).": "(GitHub)",
  "How does it work?": "มันทำงานอย่างไร?",
  "At no point, AnonymousAlice01 and BafflingBob02 have to entrust the bitcoin funds to each other. In case they have a conflict, RoboSats staff will help resolving the dispute.": "ไม่มีขั้นตอนใดที่ผู้ใช้งานนิรนามทั้ง 2 ฝ่ายจะต้องฝากเหรียญของตนไว้ให้อีกฝ่าย และถ้าหากทั้งคู่มีข้อพิพาทเกิดขึ้น ทีมงานของ RoboSats จะให้ความช่วยเหลือในการจัดการเรื่องร้องเรียนระหว่างผู้ใช้งานทั้งสอง",
  "You can find a step-by-step description of the trade pipeline in ": "คุณสามารถอ่านขั้นตอนการซื้อขายทีละขั้นได้ที่",
  "How it works": "มันทำงานอย่างไร",
  "You can also check the full guide in ": "และคุณสามารถอ่านรายละเอียดขั้นตอนการซื้อขายทั้งหมดได้ที่",
  "How to use": "วิธีการใช้งาน",
  "What payment methods are accepted?": "ต้องชำระเงินผ่านช่องทางไหน?",
  "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.": "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.",
  "Are there trade limits?": "มีขีดจำกัดการซื้อขายมั้ย?",
  "Maximum single trade size is {{maxAmount}} Satoshis to minimize lightning routing failure. There is no limits to the number of trades per day. A robot can only have one order at a time. However, you can use multiple robots simultaneously in different browsers (remember to back up your robot tokens!).": "ปริมาณการซื้อขายสูงสุดต่อรอบคือ {{maxAmount}} Satoshis เพื่อลดความเสี่ยงที่ lightning network routing จะล้มเหลว ไม่มีจำกัดจำนวนครั้งการซื้อขายต่อวัน โรบอท 1 ท่านจะสามารถทำการเทรดได้ครั้งละ 1 รายการ แต่คุณก็สามารถใช้งานโรบอทหลายตัวได้โดยการใช้งานผ่านหลายบราวเซอร์ (และอย่าลืมเก็บรักษา token ของโรบอทไว้ให้ดี!).",
  "What are the fees?": "ค่าธรรมเนียมเท่าไหร่?",
  "RoboSats total fee for an order is {{tradeFee}}%. This fee is split to be covered by both: the order maker ({{makerFee}}%) and the order taker ({{takerFee}}%). In case an onchain address is used to received the Sats a variable swap fee applies. Check the exchange details by tapping on the bottom bar icon to see the current swap fee.": "RoboSats จะเก็บค่าธรรมเนียม {{tradeFee}}% ต่อรายการเทรด โดยแบ่งเป็นค่าธรรมเนียมของฝ่าย Maker ({{makerFee}}%) และฝ่าย Taker({{takerFee}}%) และในกรณีการใช้ on-chain address จะมีค่าธรรมเนียมการ swap เพิ่มซึ่งจะไม่คงที่สามารถตรวจสอบอัตราค่า swap ได้ที่ไอคอนบนแถบด้านล่าง",
  "Be aware your fiat payment provider might charge extra fees. In any case, the buyer bears the costs of sending fiat. That includes banking charges, transfer fees and foreign exchange spreads. The seller must receive exactly the amount stated in the order details.": "ข้อควรระวัง สำหรับฝ่ายผู้ซื้อเหรียญ ค่าธรรมเนียมทั้งหมดที่เกี่ยวข้องสำหรับกระบวนการส่งเงินเฟียต และค่า swap เงินเฟียต ถือเป็นความรับผิดชอบของผู้ซื้อเหรียญ ผู้ขายจะต้องได้รับเงินตามจำนวนครบถ้วนเท่ากับที่ระบุไว้ในรายการซื้อขาย",
  "Is RoboSats private?": "RoboSats มีความเป็นส่วนตัวมั้ย?",
  "RoboSats will never ask you for your name, country or ID. RoboSats does not custody your funds and does not care who you are. RoboSats does not collect or custody any personal data. For best anonymity use Tor Browser and access the .onion hidden service.": "RoboSats จะไม่มีวันถาม ชื่อสกุล, ประเทศ หรือ รหัสบัตรประชาชน RoboSats จะไม่สามารถเก็บหรือควบคุมเงินของคุณได้และไม่สนใจด้วยซ้ำว่าคุณเป็นไร RoboSats จะไม่มีการเก็บข้อมูลส่วนตัวใดๆ และผู้ใช้งานควรเข้าใช้งานผ่าน Tor browser .onion hidden service เพื่อความเป็นส่วนตัวสูงสุด",
  "Your trading peer is the only one who can potentially guess anything about you. Keep your chat short and concise. Avoid providing non-essential information other than strictly necessary for the fiat payment.": "คู่ค้าของคุณคือผู้เดียวที่อาจสามารถเดาตัวตนหรือข้อมูลของคุณได้ ควรแชทกันอย่างกระชับและตรงประเด็น หลีกเลี่ยงการให้ข้อมูลที่ไม่จำเป็นหรือไม่เกี่ยวข้องกับกระบวนการชำระเงินเฟียต",
  "What are the risks?": "มีความเสี่ยงอะไรบ้าง?",
  "This is an experimental application, things could go wrong. Trade small amounts!": "เราเป็นแอพที่ยังอยู่ในระหว่างการพัฒนาอาจมีปัญหาที่ไม่คาดคิดเกิดขึ้นได้ดังนั้นจึงควรทำซื้อขายในปริมาณน้อยๆ",
  "The seller faces the same charge-back risk as with any other peer-to-peer service. Paypal or credit cards are not recommended.": "ผู้ขายเหรียญมีความเสี่ยงที่จะถูกเรียกเงินคืนเช่นเดียวกับการใช้แพล้ตฟอร์ม Peer-to-peer อื่นๆ ดังนั้นจึงควรหลีกเลี่ยงการรับชำระเงินผ่านทาง Paypal หรือบัตรเครดิต",
  "What is the trust model?": "รูปแบบความเชื่อถือเป็นอย่างไร?",
  "You can build more trust on RoboSats by inspecting the source code.": "คุณสามารถตรวจสอบ source code ของแพล้ตฟอร์มได้เพื่อให้คุณสามารถเชื่อมั่นใน RoboSats ได้มากขึ้น",
  "Project source code": "Project source code",
  "What happens if RoboSats suddenly disappears?": "ถ้าจู่ๆ RoboSats หายไปดื้อๆเลยจะเกิดอะไรขึ้น?",
  "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if RoboSats goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if RoboSats disappears. This window is about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels.": "เหรียญของคุณทั้งหมดจะถูกคืนให้คุณ hold invoice ที่ไม่ได้ชำระบัญชีจะถูกคืนอย่างอัตโนมัติไม่ว่า RoboSats จะล่มหนักแค่ไหนก็ตาม โดยจะคืนทั้งเหรียญที่กักใน bond และเหรียญที่เป็นหลักประกันที่นำมาขาย อย่างไรก็ตาม มันจะมีช่วงเวลาสั้นๆระหว่างที่ผู้ขายยืนยันว่าได้รับเงินเฟียตแล้วกับช่วงที่ผู้ซื้อจะได้รับเหรียญ เหรียญอาจหายไปตลอดกาลได้หาก RoboSats ล่มภายในช่วงเวลาดังกล่าวพอดี ช่วงเวลานี้จะกินเวลาประมาณ 1 วินาที ดังนั้นจึงควรมี inbound liquidity ที่เพียงพอเพื่อป้องกันการ routing ล้มเหลว และหากคุณมีปัญหาอะไรสามารถติดต่อเราได้ผ่านช่องทางสาธารณะทั้งหมดที่เรามี",
  "Is RoboSats legal in my country?": "RoboSats ถูกกฎหมายในประเทศที่ฉันอยู่หรือไม่?",
  "In many countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply.": "ในหลายประเทศการใช้ RoboSats ตามกฎหมายไม่แตกต่างกับ Ebay หรือ Craiglist กฎหมายแต่ละประเทศจะมีความแตกต่างกันและเป็นความรับผิดชอบของคุณในการปฏิบัติตามกฎหมาย",
  "Disclaimer": "ข้อความปฏิเสธความรับผิดชอบ",
  "This lightning application is provided as is. It is in active development: trade with the utmost caution. There is no private support. Support is only offered via public channels ": "แอพพลิเคชั่น lightning นี้เปิดให้ใช้งานโดยที่ยังอยู่ในระหว่างการพัฒนาจึงควรทำการซื้อขายอย่างระมัดระวัง ปัจจุบันยังไม่มีฝ่ายบริการลูกค้ารายบุคคล จำเป็นต้องใช้ช่องทางสาธารณะในการติดต่อขอความช่วยเหลือ",
  "(Telegram)": "(Telegram)",
  ". RoboSats will never contact you. RoboSats will definitely never ask for your robot token.": ". RoboSats จะไม่ติดต่อคุณและไม่มีทางขอ token ของโรบอทของคุณ",
  "Close": "ปิด",
  "#26": "Phrases in components/Dialogs/AuditPGP.tsx",
  "Your communication is end-to-end encrypted with OpenPGP. You can verify the privacy of this chat using any tool based on the OpenPGP standard.": "การสื่อสารของคุณถูกเข้ารหัสแบบ end-to-end ด้วย OpenPGP คุณสามารถตรวจสอบความเป็นส่วนตัวของคุณด้วยเครื่องมือใดก็ได้ที่รองรับมาตรฐาน OpenPGP",
  "Learn how to verify": "เรียนรู้วิธีการตรวจสอบ",
  "Your PGP public key. Your peer uses it to encrypt messages only you can read.": "PGP public key ของคุณ คู่ค้าของคุณใช้มันเข้ารหัสกับข้อความซึ่งทำให้มีแต่คุณเท่านั้นที่สามารถอ่านได้",
  "Your public key": "Public key ของคุณ",
  "Your peer PGP public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "PGP public key ของคู่ค้า ใช้ในการเข้ารหัสกับข้อความซึ่งทำให้มีแต่เขาเท่านั้นที่สามารภถอ่านได้และใช้ตรวจสอบข้อความที่คู่ค้าเข้ารหัสและส่งมาให้คุณ",
  "Peer public key": "Public key ของคู่ค้า",
  "Your encrypted private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "private key ที่ถูกเข้ารหัสของคุณ ใช้ในการถอดรหัสเพื่ออ่านข้อความที่คู่ค้าส่งให้คุณ และใช้ในการเซ็นต์เพื่อยืนยันว่าข้อความที่คุณส่งมาจากคุณจริงๆ",
  "Your encrypted private key": "private key ที่ถูกเข้ารหัสของคุณ",
  "The passphrase to decrypt your private key. Only you know it! Do not share. It is also your robot token.": "passphrase สำหรับถอดรหัส private key ของคุณ มีแต่คุณเท่านั้นที่รู้! ห้ามแชร์ให้ผู้อื่น นอกจากนี้มันยังเป็น token ของโรบอทของคุณอีกด้วย",
  "Your private key passphrase (keep secure!)": "passphrase ของ private key ของคุณ เก็บรักษาไว้ให้ดี!",
  "Save credentials as a JSON file": "บันทึกข้อมูลยืนยันตัวตนเป็นไฟล์ JSON",
  "Keys": "Keys",
  "Save messages as a JSON file": "บันทึกข้อความเป็นไฟล์ JSON",
  "Messages": "ข้อความ",
  "#27": "Phrases in components/Dialogs/Stats.tsx",
  "Stats For Nerds": "สถิติสำหรับผู้สนใจ",
  "Client": "Client",
  "Coordinator": "Coordinator",
  "RoboSats version": "RoboSats version",
  "LND version": "LND version",
  "LN Node": "LN Node",
  "Coordinator commit hash": "Coordinator commit hash",
  "24h contracted volume": "24h ปริมาณการซื้อขาย 24 ชั่วโมงที่แล้ว",
  "Lifetime contracted volume": "ปริมาณการซื้อขายตั้งแต่ก่อตั้งแพล้ตฟอร์ม",
  "Made with": "สร้างด้วย",
  "and": "และ",
  "... somewhere on Earth!": "... ซักที่ บนโลกใบนี้!",
  "#28": "Phrases in components/Dialogs/Community.tsx",
  "Community": "ชุมชน",
  "Support is only offered via public channels. Join our Telegram community if you have questions or want to hang out with other cool robots. Please, use our Github Issues if you find a bug or want to see new features!": "สามารถขอความช่วยเหลือผ่านช่องทางสาธารณะเท่านั้น เข้าร่วมกลุ่ม Telegram ถ้าคุณมีคำถามหรือต้องการมาสนุกกับชาวโรโบสุดเจ๋งคนอื่นๆ กรุณาใช้ช่องทาง Github Issues ในการแจ้งบัคหรือกรณีอยากเสนอเพิ่มฟีเจอร์ใหม่ๆ!",
  "Follow RoboSats in Twitter": "ติดตาม RoboSats บน Twitter",
  "Twitter Official Account": "Twitter Official Account",
  "RoboSats in Reddit": "RoboSats ใน Reddit",
  "RoboSats Telegram Communities": "ชุมชน RoboSats Telegram",
  "Join RoboSats Spanish speaking community!": "Join RoboSats Spanish speaking community!",
  "Join RoboSats Russian speaking community!": "Join RoboSats Russian speaking community!",
  "Join RoboSats Chinese speaking community!": "Join RoboSats Chinese speaking community!",
  "Join RoboSats English speaking community!": "Join RoboSats English speaking community!",
  "Join RoboSats Portuguese speaking community!": "Join RoboSats Portuguese speaking community!",
  "Tell us about a new feature or a bug": "บอกเราเกี่ยวกับฟีเจอร์ใหม่หรือบัค",
  "Github Issues - The Robotic Satoshis Open Source Project": "Github Issues - The Robotic Satoshis Open Source Project",
  "#29": "Phrases in components/Dialogs/Learn.tsx",
  "You are about to visit Learn RoboSats. It hosts tutorials and documentation to help you learn how to use RoboSats and understand how it works.": "คุณกำลังเข้าสู่หน้าการเรียนรู้การใช้งาน RoboSats คุณสามารถศึกษาวิธีการใช้งานแพล้ตฟอร์มและทำความเข้าใจการทำงานของแพล้ตฟอร์มได้ที่นี่",
  "Back": "กลับ",
  "#30": "Phrases in components/Dialogs/Profile.tsx",
  "Your Robot": "Your Robot",
  "Your robot": "โรบอทของคุณ",
  "One active order #{{orderID}}": "มี 1 รายการที่กำลังดำเนินการอยู่ #{{orderID}}",
  "Your current order": "รายการปัจจุบันของคุณ",
  "Your last order #{{orderID}}": "รายการล่าสุดของคุณ #{{orderID}}",
  "Inactive order": "รายการที่ไม่ได้ดำเนินการอยู่",
  "No active orders": "ไม่มีรายการที่กำลังดำเนินการอยู่",
  "You do not have previous orders": "คุณไม่มีรายการก่อนหน้านี้",
  "Telegram enabled": "เปิดใช้ Telegram แล้ว",
  "Enable Telegram Notifications": "เปิดใช้การแจ้งเตือนผ่านทาง Telegram",
  "Use stealth invoices": "ใช้งาน stealth invoices",
  "Your earned rewards": "รางวัลที่ตุณได้รับ",
  "Claim": "รับรางวัล",
  "Invoice for {{amountSats}} Sats": "Invoice สำหรับ {{amountSats}} Sats",
  "Submit": "ส่งข้อมูล",
  "Generate with Webln": "Generate with Webln",
  "There it goes, thank you!🥇": "เอาไปเลย ขอบคุณมาก!🥇",
  "#31": "Phrases in components/MakerForm/MakerForm.tsx",
  "Must be less than {{max}}%": "ต้องน้อยกว่า {{max}}%",
  "Must be more than {{min}}%": "ต้องมากกว่า {{min}}%",
  "Must be less than {{maxSats}": "ต้องน้อยกว่า {{maxSats}}",
  "Must be more than {{minSats}}": "ต้องมากกว่า {{minSats}}",
  "Amount": "จำนวน",
  "Onchain amount to send (BTC)": "Onchain amount to send (BTC)",
  "You receive approx {{swapSats}} LN Sats (fees might vary)": "You receive approx {{swapSats}} LN Sats (fees might vary)",
  "Onchain amount to receive (BTC)": "Onchain amount to receive (BTC)",
  "You send approx {{swapSats}} LN Sats (fees might vary)": "You send approx {{swapSats}} LN Sats (fees might vary)",
  "Order for ": "Order for ",
  "Swap of ": "Swap of ",
  "Buy BTC for ": "Buy BTC for ",
  "Swap into LN ": "Swap into LN ",
  "Sell BTC for ": "Sell BTC for ",
  "Swap out of LN ": "Swap out of LN ",
  " of {{satoshis}} Satoshis": " เป็น Satoshis จำนวน {{satoshis}} Sats",
  " at market price": " at market price",
  " at a {{premium}}% premium": " ในราคาแพงกว่าตลาด {{premium}}% ",
  " at a {{discount}}% discount": " ในราคาถูกกว่าตลาด {{discount}}% ",
  "Clear form": "Clear form",
  "Enable advanced options": "Enable advanced options",
  "Swap?": "Swap?",
  "Buy or Sell Bitcoin?": "คุณต้องการซื้อหรือขาย BTC?",
  "In or Out of Lightning?": "In or Out of Lightning?",
  "Buy": "ซื้อ",
  "Swap In": "Swap In",
  "Sell": "ขาย",
  "Swap Out": "Swap Out",
  "Amount of fiat to exchange for bitcoin": "ระบุจำนวนเงินเฟียตที่ต้องการใช้แลกเปลี่ยนกับ BTC",
  "Amount of BTC to swap for LN Sats": "Amount of BTC to swap for LN Sats",
  "Must be more than {{minAmount}}": "Must be more than {{minAmount}}",
  "Must be less than {{maxAmount}}": "Must be less than {{maxAmount}}",
  "Must be shorter than 65 characters": "ต้องสั้นกว่า 65 ตัวอักษร",
  "Swap Destination(s)": "Swap Destination(s)",
  "Fiat Payment Method(s)": "วิธีการชำระเงินเฟียต",
  "Enter the destination of the Lightning swap": "Enter the destination of the Lightning swap",
  "You can add new methods": "You can add new methods",
  "Add New": "เพิ่มวิธีการ",
  "Choose a Pricing Method": "เลือกวิธีการตั้งราคา",
  "Let the price move with the market": "ตั้งราคาให้มีการเปลี่ยนแปลงตามราคาเหรียญในตลาด",
  "Relative": "ตั้งตามราคาตลาด",
  "Set a fix amount of satoshis": "กำหนดจำนวน satoshis ที่ต้องการซื้อขาย",
  "Exact": "Exact",
  "Satoshis": "Satoshis",
  "Premium over Market (%)": "ค่าพรีเมี่ยมจากท้องตลาด (%)",
  "Public order length": "Public order length",
  "Public Duration (HH:mm)": "ประกาศรายการซื้อขายมีอายุ (ชม:นาที)",
  "Escrow/invoice step length": "Escrow/invoice step length",
  "Escrow/Invoice Timer (HH:mm)": "Escrow/Invoice Timer (HH:mm)",
  "Set the skin-in-the-game, increase for higher safety assurance": "การวางหลักประกันเยอะขึ้นจะช่วยลดแรงจูงใจของคนที่คิดจะโกง",
  "Fidelity Bond Size": "วงเงินหลักประกันความเสียหาย (bond)",
  "You must fill the form correctly": "You must fill the form correctly",
  "Edit order": "Edit order",
  "Your order fixed exchange rate": "คุณกำหนดอัตราแลกเปลี่ยนคงที่",
  "Order rate:": "Order rate:",
  "Order current rate:": "ราคาที่คุณกำหนด:",
  "#32": "Phrases in components/MakerForm/AmountRange.tsx",
  "From": "ตั้งแต่",
  "to": "ถึง",
  "#33": "Phrases in components/BookTable/BookControl.tsx",
  "and use": "และใช้",
  "pay with": "pay with",
  "I want to": "ฉันต้องการ",
  "Show Lightning swaps": "Show Lightning swaps",
  "Select Payment Currency": "เลือกสกุลเงิน",
  "ANY": "ANY",
  "DESTINATION": "DESTINATION",
  "METHOD": "METHOD",
  "Select Payment Method": "Select Payment Method",
  "#34": "Phrases in components/BookTable/index.tsx",
  "Orders per page:": "รายการต่อหน้า:",
  "No results found.": "ไม่พบผลลัพธ์",
  "An error occurred.": "เกิดความผิดพลาด",
  "Columns": "คอลัมน์",
  "Select columns": "เลือกคอลัมน์",
  "Find column": "ค้นหาคอลัมน์",
  "Column title": "ชื่อคอลัมน์",
  "Reorder column": "จัดเรียงคอลัมน์ใหม่",
  "Show all": "แสดงทั้งหมด",
  "Hide all": "ซ่อนทั้งหมด",
  "Add filter": "เพิ่มตัวกรอง",
  "Delete": "ลบ",
  "Logic operator": "ตัวดำเนินการ",
  "Operator": "ตัวดำเนินการ",
  "And": "และ",
  "Or": "หรือ",
  "Value": "ค่า",
  "Filter value": "กรองค่า",
  "contains": "มีเป็นองค์ประกอบ",
  "equals": "เท่ากับ",
  "starts with": "เริ่มต้นด้วย",
  "ends with": "ลงท้ายด้วย",
  "is": "เป็น",
  "is not": "ไม่ใช่",
  "is after": "is after",
  "is on or after": "is on or after",
  "is before": "is before",
  "is on or before": "is on or before",
  "is empty": "ว่างเปล่า",
  "is not empty": "ไม่ว่างเปล่า",
  "is any of": "เป็นอะไรก็ได้ของ",
  "any": "ทั้งหมด",
  "true": "จริง",
  "false": "เท็จ",
  "Menu": "รายการเลือก",
  "Show columns": "แสดงแถว",
  "Manage columns": "Manage columns",
  "Filter": "ตัวกรอง",
  "Unsort": "เลิกจัดเรียง",
  "Sort by ASC": "เรียงจากล่างขึ้นบน",
  "Sort by DESC": "เรียงจากบนลงล่าง",
  "Show filters": "แสดงตัวกรอง",
  "Sort": "จัดเรียง",
  "yes": "ใช่",
  "no": "ไม่ใช่",
  "Is": "เป็น",
  "Currency": "สกุลเงิน",
  "Payment Method": "วิธีการชำระเงิน",
  "Destination": "Destination",
  "Pay": "จ่าย",
  "Timer": "Timer",
  "Expiry": "Expiry",
  "Sats now": "Sats now",
  "Bond": "Bond",
  "No orders found to sell BTC for {{currencyCode}}": "ไม่มีรายการขาย BTC เป็นเงิน {{currencyCode}}",
  "No orders found to buy BTC for {{currencyCode}}": "ไม่มีรายการซื้อ BTC เป็นเงิน {{currencyCode}}",
  "Be the first one to create an order": "มาเป็นคนสร้างรายการซื้อขายคนแรก",
  "#35": "Phrases in components/TradeBox/CancelButton.tsx",
  "Cancel order and unlock bond instantly": "Cancel order and unlock bond instantly",
  "Unilateral cancelation (bond at risk!)": "Unilateral cancelation (bond at risk!)",
  "Cancel": "ยกเลิก",
  "Collaborative Cancel": "ร่วมกันยกเลิกการซื้อขาย",
  "#36": "Phrases in components/TradeBox/TradeSummary.tsx",
  "Trade Summary": "สรุปการซื้อขาย",
  "Export trade summary": "Export trade summary",
  "Maker": "Maker",
  "Taker": "Taker",
  "Buyer": "ผู้ซื้อ",
  "Seller": "ผู้ขาย",
  "User role": "บทบาทผู้ใข้งาน",
  "Sent": "ส่งแล้ว",
  "Received": "ได้รับแล้ว",
  "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)": "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)",
  "{{swapFeeSats}} Sats ({{swapFeePercent}}%)": "{{swapFeeSats}} Sats ({{swapFeePercent}}%)",
  "Onchain swap fee": "ค่าธรรมเนียมการสลับ Onchain",
  "{{miningFeeSats}} Sats": "{{miningFeeSats}} Sats",
  "Mining fee": "ค่าธรรมเนียมการขุด",
  "{{bondSats}} Sats ({{bondPercent}}%)": "{{bondSats}} Sats ({{bondPercent}}%)",
  "Maker bond": "Maker bond",
  "Taker bond": "Taker bond",
  "Unlocked": "ปลดล็อกแล้ว",
  "{{revenueSats}} Sats": "{{revenueSats}} Sats",
  "Coordinator trade revenue": "Coordinator trade revenue",
  "{{routingFeeSats}} MiliSats": "{{routingFeeSats}} MiliSats",
  "Routing budget": "Routing budget",
  "Contract exchange rate": "อัตราแลกเปลี่ยน",
  "Timestamp": "ประทับเวลา",
  "Completed in": "เสร็จสิ้นใน",
  "#37": "Phrases in components/TradeBox/WalletsButton.tsx",
  "See Compatible Wallets": "ดูกระเป๋าบิทคอยน์ (Wallets) ที่สามารถใช้งานได้",
  "#38": "Phrases in components/TradeBox/CollabCancelAlert.tsx",
  "{{nickname}} is asking for a collaborative cancel": "{{nickname}} ขอให้คุณร่วมกันยกเลิกการซื้อขาย",
  "You asked for a collaborative cancellation": "คุณขอให้อีกฝ่ายร่วมกันยกเลิกการซื้อขาย",
  "#39": "Phrases in components/TradeBox/EncryptedChat/EncryptedSocketChat/index.tsx",
  "Type a message": "พิมพ์ข้อความ",
  "Waiting for peer public key...": "Waiting for peer public key...",
  "Connecting...": "กำลังเชื่อมต่อ...",
  "Send": "ส่ง",
  "#40": "Phrases in components/TradeBox/EncryptedChat/MessageCard/index.tsx",
  "#41": "Phrases in components/TradeBox/EncryptedChat/ChatHeader/index.tsx",
  "You": "คุณ",
  "connected": "เชื่อมต่อแล้ว",
  "disconnected": "ตัดการเชื่อมต่อแล้ว",
  "Activate slow mode (use it when the connection is slow)": "Activate slow mode (use it when the connection is slow)",
  "Peer": "คู่ค้า",
  "...waiting": "...waiting",
  "#42": "Phrases in components/TradeBox/EncryptedChat/EncryptedTurtleChat/index.tsx",
  "#43": "Phrases in components/TradeBox/EncryptedChat/ChatBottom/index.tsx",
  "Verify your privacy": "ตรวจสอบความเป็นส่วนตัวของคุณ",
  "Audit PGP": "ตรวจสอบ PGP",
  "Save full log as a JSON file (messages and credentials)": "บันทึกข้อความและการยืนยันตัวตนในรูป JSON",
  "Export": "ส่งออก",
  "#44": "Phrases in components/TradeBox/Dialogs/ConfirmFiatReceived.tsx",
  "Confirm you received {{amount}} {{currencyCode}}?": "Confirm you received {{amount}} {{currencyCode}}?",
  "Confirming that you received {{amount}} {{currencyCode}} will finalize the trade. The satoshis in the escrow will be released to the buyer. Only confirm after {{amount}} {{currencyCode}} have arrived to your account. Note that if you if you have received the payment and do not click confirm, you risk losing your bond.": "Confirming that you received {{amount}} {{currencyCode}} will finalize the trade. The satoshis in the escrow will be released to the buyer. Only confirm after {{amount}} {{currencyCode}} have arrived to your account. Note that if you if you have received the payment and do not click confirm, you risk losing your bond.",
  "Confirm": "ยืนยัน",
  "#45": "Phrases in components/TradeBox/Dialogs/ConfirmCancel.tsx",
  "Cancel the order?": "จะยกเลิกรายการหรือไม่?",
  "If the order is cancelled now you will lose your bond.": "ถ้ารายการถูกยกเลิกในขั้นตอนนี้ คุณจะสูญเสีย bond",
  "Confirm Cancel": "ยืนยันยกเลิก",
  "#46": "Phrases in components/TradeBox/Dialogs/ConfirmCollabCancel.tsx",
  "Revert the confirmation of fiat sent?": "Revert the confirmation of fiat sent?",
  "READ. In case your payment to the seller has been blocked and it is absolutely impossible to finish the trade, you can revert your confirmation of \"Fiat sent\". Do so only if you and the seller have ALREADY AGREED in the chat to proceed to a collaborative cancellation. After confirming, the \"Collaborative cancel\" button will be visible again. Only click this button if you know what you are doing. First time users of RoboSats are highly discouraged from performing this action! Make 100% sure your payment has failed and the amount is in your account.": "READ. In case your payment to the seller has been blocked and it is absolutely impossible to finish the trade, you can revert your confirmation of \"Fiat sent\". Do so only if you and the seller have ALREADY AGREED in the chat to proceed to a collaborative cancellation. After confirming, the \"Collaborative cancel\" button will be visible again. Only click this button if you know what you are doing. First time users of RoboSats are highly discouraged from performing this action! Make 100% sure your payment has failed and the amount is in your account.",
  "Wait ({{time}})": "Wait ({{time}})",
  "#47": "Phrases in components/TradeBox/Dialogs/WebLN.tsx",
  "Collaborative cancel the order?": "ร่วมกันยกเลิกรายการหรือไม่",
  "The trade escrow has been posted. The order can be cancelled only if both, maker and taker, agree to cancel.": "ผู้ขายวางเหรียญแล้ว หากต้องการยกเลิกการซื้อขายจะต้องได้รับการยินยอมจากอีกฝั่งร่วมกับคุณ",
  "Your peer has asked for cancellation": "Your peer has asked for cancellation",
  "Accept Cancelation": "Accept Cancelation",
  "Ask for Cancel": "ขอให้ยกเลิก",
  "#48": "Phrases in components/TradeBox/Dialogs/ConfirmDispute.tsx",
  "WebLN": "WebLN",
  "Invoice not received, please check your WebLN wallet.": "Invoice not received, please check your WebLN wallet.",
  "Amount not yet locked, please check your WebLN wallet.": "Amount not yet locked, please check your WebLN wallet.",
  "You can close now your WebLN wallet popup.": "You can close now your WebLN wallet popup.",
  "#49": "Phrases in components/TradeBox/Prompts/LockInvoice.tsx",
  "Do you want to open a dispute?": "ต้องการร้องเรียนหรือไม่?",
  "The RoboSats staff will examine the statements and evidence provided. You need to build a complete case, as the staff cannot read the chat. It is best to provide a burner contact method with your statement. The satoshis in the trade escrow will be sent to the dispute winner, while the dispute loser will lose the bond.": "ทีมงาน RoboSats จะตรวจสอบคำแถลงและหลักฐานที่ได้รับ คุณจะต้องให้ข้อมูลเหตุการณ์ทั้งหมดอย่างละเอียดเนื่องจากทีมงานไม่สามารถอ่านข้อความในแชทซื้อขายได้ และคุณจะต้องระบุช่องทางสำหรับติดต่อคุณกลับมาในคำแถลงด้วย เหรียญที่ถูกกักกันไว้เพื่อซื้อขายจะถูกส่งให้ผู้ชนะการร้องเรียน และผู้แพ้จะสูญเสียเหรียญที่กักกันใน bond",
  "Make sure to EXPORT the chat log. The staff might request your exported chat log JSON in order to solve discrepancies. It is your responsibility to store it.": "คุณต้องทำการส่งออกบันทึกข้อความแชทไว้ด้วย เนื่องจากทีมงานอาจร้องขอบทสนาที่ถูกนำออกเพื่อใช้ในการแก้ไข้ปัญหา และคุณจะต้องรับผิดชอบการเก็บรักษามันไว้ด้วย",
  "Disagree": "ไม่ตกลง",
  "Agree and open dispute": "ตกลงและดำเนินการร้องเรียน",
  "#50": "Phrases in components/TradeBox/Prompts/Expired.tsx",
  "Confirm you sent {{amount}} {{currencyCode}}?": "Confirm you sent {{amount}} {{currencyCode}}?",
  "Confirming that you sent {{amount}} {{currencyCode}} will allow your peer to finalize the trade. If you have not yet sent it and you still proceed to falsely confirm, you risk losing your bond.": "Confirming that you sent {{amount}} {{currencyCode}} will allow your peer to finalize the trade. If you have not yet sent it and you still proceed to falsely confirm, you risk losing your bond.",
  "#51": "Phrases in components/TradeBox/Prompts/RoutingFailed.tsx",
  "This is a hold invoice, it will freeze in your wallet. It will be charged only if you cancel or lose a dispute.": "นี่คือ hold invoice มันจะกักกันเหรียญของคุณเอาไว้ใน wallet ของคุณและจะดำเนินการตัดจ่ายเหรียญเมื่อคุณยกเลิกรายการหรือแพ้ในกระบวนการร้องเรียน",
  "This is a hold invoice, it will freeze in your wallet. It will be released to the buyer once you confirm to have received the {{currencyCode}}.": "นี่คือ hold invoice มันจะกักกันเหรียญของคุณเอาไว้ใน wallet ของคุณ เหรียญจะถูกส่งให้ผู้ซื้อเมื่อคุณยืนยันว่าคุณได้รับเงินเฟียต {{currencyCode}} ครบถ้วนแล้ว",
  "Copy to clipboard": "คัดลอกไปยังคลิปบอร์ด",
  "#52": "Phrases in components/TradeBox/Prompts/Dispute.tsx",
  "Renew Order": "เริ่มรายการใหม่",
  "#53": "Phrases in components/TradeBox/Prompts/DisputeLoser.tsx",
  "Failure reason:": "เหตุผลที่ล้มเหลว",
  "Retrying!": "กำลังลองใหม่!",
  "Your invoice has expired or more than 3 payment attempts have been made. Submit a new invoice.": "Invoice หมดอายุ หรือเราได้ลองจ่ายเหรียญครบ 3 ครั้งแล้ว กรุณาส่ง invoice ใหม่ให้เรา",
  "RoboSats will try to pay your invoice 3 times with a one minute pause in between. If it keeps failing, you will be able to submit a new invoice. Check whether you have enough inbound liquidity. Remember that lightning nodes must be online in order to receive payments.": "RoboSats จะลองจ่ายเหรียญให้ invoice ของท่าน 3 ครั้ง ห่างกันครั้งละ 1 นาที หากครบ 3 ครั้งแล้วยังล้มเหลวคุณจะสามารถส่ง invoice มาใหม่ได้ ตรวจสอบว่าคุณมี inbound liquidity เพียงพอ และ lightning nodes จะต้องออนไลน์จึงจะรับเหรียญได้",
  "Next attempt in": "ลองใหม่ภายใน",
  "#54": "Phrases in components/TradeBox/Prompts/SendingSats.tsx",
  "Please, submit your statement. Be clear and specific about what happened and provide the necessary evidence. You MUST provide a contact method: burner email, XMPP or telegram username to follow up with the staff. Disputes are solved at the discretion of real robots (aka humans), so be as helpful as possible to ensure a fair outcome. Max 5000 chars.": "กรุณาส่งคำแถลงของคุณ อธิบายรายละเอียดและเหตุการณ์ที่เกิดขึ้นทั้งหมดอย่างครบถ้วนและชัดเจนและแสดงหลักฐานที่จำเป็นให้เรา คุณจะต้องระบุช่องทางการติดต่อกลับ เช่น อีเมลล์ชั่วคราว, XMPP, หรือ telegram username เพื่อให้ทีมงานติดตามเรื่องได้ การดำเนินการกับข้อร้องเรียนจะทำโดยคน กรุณาให้การสนับสนุนทีมงานให้มากที่สุดเพื่อให้ได้ผลลัพธ์ที่เหมาะสมที่สุด (คำแถลงไม่เกิน 5000 ตัวอักษร)",
  "#55": "Phrases in components/TradeBox/Prompts/PublicWait.tsx",
  "Unfortunately you have lost the dispute. If you think this is a mistake you can ask to re-open the case via email to robosats@protonmail.com. However, chances of it being investigated again are low.": "เสียใจด้วย คุณแพ้กระบวนการร้องเรียน ถ้าคุณคิดว่ามีข้อผิดพลาดเกิดขึ้นคุณสามารถเปิดการร้องเรียนใหม่ได้ผ่านทาง robosats@protonmail.com แต่จะมีโอกาสที่เรื่องร้องเรียนจะได้รับการตรวจสอบซ้ำอีกครั้งน้อยมาก",
  "#56": "Phrases in components/TradeBox/Prompts/Successful.tsx",
  "RoboSats is trying to pay your lightning invoice. Remember that lightning nodes must be online in order to receive payments.": "RoboSats กำลังจ่ายเหรียญให้ lightning invoice ของท่าน lightning nodes จะต้องออนไลน์เพื่อรับเหรียญ",
  "#57": "Phrases in components/TradeBox/Prompts/Chat.tsx",
  "If the order expires untaken, your bond will return to you (no action needed).": "ถ้ารายการซื้อขายของคุณไม่มีใครรับ คุณจะได้รับการปลดล็อกเหรียญที่กักกันใน bond ของคุณคืนโดยอัตโนมัติ",
  "Public orders for {{currencyCode}}": "รายการสำหรับ {{currencyCode}}",
  "Pause the public order": "ระงับการประกาศรายการ",
  "Premium rank": "ลำดับค่าพรีเมี่ยม",
  "Among public {{currencyCode}} orders (higher is cheaper)": "สำหรับรายการที่เป็น {{currencyCode}} (ยิ่งสูงยิ่งถูก)",
  "#58": "Phrases in components/TradeBox/Prompts/TakerFound.tsx",
  "Thank you! RoboSats loves you too": "Thank you! RoboSats loves you too",
  "RoboSats gets better with more liquidity and users. Tell a bitcoiner friend about Robosats!": "RoboSats จะดีขึ้นเมื่อมีสภาพคล่องและผู้ใช้งานมากขึ้น ช่วยกันชวนเพื่อนของคุณมาใช้ Robosats!",
  "Thank you for using Robosats!": "ขอบคุณที่ใช้งาน Robosats!",
  "Your TXID": "TXID ของคุณ",
  "Sending coins to": "Sending coins to",
  "Start Again": "Start Again",
  "Renew": "Renew",
  "#59": "Phrases in components/TradeBox/Prompts/EscrowWait.tsx",
  "To open a dispute you need to wait": "To open a dispute you need to wait",
  "Say hi! Be helpful and concise. Let them know how to send you {{amount}} {{currencyCode}}.": "Say hi! Be helpful and concise. Let them know how to send you {{amount}} {{currencyCode}}.",
  "Wait for the seller to confirm he has received the payment.": "รอผู้ขายยืนยันว่าได้รับเงินเฟียตแล้ว",
  "Open Dispute": "ร้องเรียน",
  "Confirm {{amount}} {{currencyCode}} sent": "Confirm {{amount}} {{currencyCode}} sent",
  "Payment failed?": "Payment failed?",
  "Confirm {{amount}} {{currencyCode}} received": "Confirm {{amount}} {{currencyCode}} received",
  "#60": "Phrases in components/TradeBox/Prompts/PayoutWait.tsx",
  "Please wait for the taker to lock a bond. If the taker does not lock a bond in time, the order will be made public again.": "โปรดรอคู่ค้าทำการกักกันเหรียญใน bond ถ้าเขากักกันเหรียญไม่ทันในเวลาที่กำหนด รายการจะถูกประำกาศใหม่",
  "#61": "Phrases in components/TradeBox/Prompts/DisputeWaitResolution.tsx",
  "We are waiting for the seller to lock the trade amount.": "เรากำลังรอผู้ขายวางเหรียญที่นำมาขาย",
  "Just hang on for a moment. If the seller does not deposit, you will get your bond back automatically. In addition, you will receive a compensation (check the rewards in your profile).": "กรุณารอซักครู่ ถ้าผู้ขายไม่ยอมวางเหรียญ คุณจะได้รับเหรียญใน bond คืนพร้อมค่าชดเชย (สามารถตรวจสอบได้ในส่วนของรางวัลในโปรไฟล์ของคุณ)",
  "#62": "Phrases in components/TradeBox/Prompts/Payout.tsx",
  "We are waiting for the buyer to post a lightning invoice. Once he does, you will be able to directly communicate the fiat payment details.": "เรากำลังรอผู้ซื้อส่ง invoice รับเหรียญให้เรา หลังจากนั้นคุณจะได้แชทคุยกับผู้ซื้อเพื่อชี้แจงรายละเอียดสำหรับการชำระเงินเฟียต",
  "Just hang on for a moment. If the buyer does not cooperate, you will get back the trade collateral and your bond automatically. In addition, you will receive a compensation (check the rewards in your profile).": "กรุณารออีกซักครู่ ถ้าผู้ซื้อไม่ให้ความร่วมมือ คุณจะได้รับเหรียญที่นำมาวางและ bond คืนโดยอัตโนมัติ และคุณจะได้รับเงินชดเชยด้วย (สามารถตรวจสอบได้ในส่วนของรางวัลในโปรไฟล์ของท่าน)",
  "#63": "Phrases in components/TradeBox/Prompts/DisputeWinner.tsx",
  "Both statements have been received, wait for the staff to resolve the dispute. If you are hesitant about the state of the dispute or want to add more information, contact robosats@protonmail.com. If you did not provide a contact method, or are unsure whether you wrote it right, write us immediately.": "เราได้รับคำแถลงจากทั้งสองฝ่ายแล้ว กรุณารอทีมงานดำเนินการแก้ไขเรื่องร้องเรียน ถ้าคุณมีข้อสงสัยเกี่ยวกับสถานะของข้อร้องเรียนหรือต้องการส่งข้อมูลเพิ่มเติม กรุณาติดต่อทาง robosats@protonmail.com ถ้าคุณไม่ได้ระบุช่องทางการติดต่อหรือไม่แน่ใจว่าระบุถูกต้องหรือไม่ ขอให้คุณส่งมาให้เราตามอีเมลล์นี้ทันที",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself as the user involved in this trade via email (or other contact methods).": "กรุณาจดบันทึกข้อมูลต่อไปนี้เพื่อใช้ในการระบุรายการซื้อขายที่มีการร้องเรียน: รหัสรายการซื้อขาย, รหัสธุรกรรม (payment hashes) ของการกักกันเหรียญใน bond (ตรวจสอบได้ใน lightning wallet ของคุณ), จำนวน satoshis ใน bond รวมทั้งชื่อเล่นของโรบอทของคุณเพื่อให้คุณสามารถระบุตัวตนของคุณได้เมื่อทำการติดต่อกับทีมงาน",
  "#64": "Phrases in components/TradeBox/Prompts/Paused.tsx",
  "Before letting you send {{amountFiat}} {{currencyCode}}, we want to make sure you are able to receive the BTC.": "ก่อนที่คุณจะส่งเงิน {{amountFiat}} {{currencyCode}} เราต้องการทำให้แน่ใจได้ว่าคุณสามารถรับเหรียญ BTC ได้",
  "Lightning": "Lightning",
  "Onchain": "Onchain",
  "#65": "Phrases in components/TradeBox/Prompts/DisputeWaitPeer.tsx",
  "You can claim the dispute resolution amount (escrow and fidelity bond) from your profile rewards. If there is anything the staff can help with, do not hesitate to contact to robosats@protonmail.com (or via your provided burner contact method).": "คุณสามารถรับเหรียญที่ได้จากการแก้ไขข้อร้องเรียนได้ที่รางวัลในโปรไฟล์ของคุณ (เหรียญที่ถูกกักกันไว้ในกระบวนการซื้อขาย) และถ้าหากต้องการความช่วยเหลือเพิ่มเติม สามารถติดต่อผ่านทาง robosats@protonmail.com (หรือผ่านช่องทางติดต่อที่คุณได้ให้เราไว้ก่อนหน้านี้).",
  "#66": "Phrases in components/TradeBox/Forms/OnchainPayout.tsx",
  "Your public order has been paused. At the moment it cannot be seen or taken by other robots. You can choose to unpause it at any time.": "รายการของคุณไม่ได้มีการประกาศอยู่ โรบอทอื่นจะไม่สามารถมองเห็นหรือรับรายการซื้อขายดังกล่าวได้คุณสามารถเลิกระงับการประกาศรายการตอนไหนก็ได้",
  "Unpause Order": "เลิกระงับการประกาศรายการ",
  "#67": "Phrases in components/TradeBox/Forms/Dispute.tsx",
  "We are waiting for your trade counterpart statement. If you are hesitant about the state of the dispute or want to add more information, contact robosats@protonmail.com.": "เรากำลังรอคำแถลงจากคู่ค้าของคุณ ถ้าคุณมีข้อสงสัยเกี่ยวกับสถานะของข้อร้องเรียนหรือต้องการส่งข้อมูลเพิ่มเติม กรุณาติดต่อทาง robosats@protonmail.com",
  "#68": "Phrases in components/TradeBox/Forms/LightningPayout.tsx",
  "RoboSats coordinator will do a swap and send the Sats to your onchain address.": "RoboSats coordinator will do a swap and send the Sats to your onchain address.",
  "Swap fee": "ค่าธรรมเนียมการสลับเปลี่ยน",
  "Final amount you will receive": "จำนวนเหรียญที่คุณจะได้รับจริงๆ",
  "Bitcoin Address": "Bitcoin Address",
  "Invalid": "ไม่ถูกต้อง",
  "Mining Fee": "ค่าธรรมเนียมการขุด",
  "#69": "Phrases in components/SettingsForm/index.tsx",
  "Submit dispute statement": "ส่งคำแถลงสำหรับข้อร้องเรียน",
  "Attaching chat logs helps the dispute resolution process and adds transparency. However, it might compromise your privacy.": "Attaching chat logs helps the dispute resolution process and adds transparency. However, it might compromise your privacy.",
  "Attach chat logs": "Attach chat logs",
  "#70": "Phrases in components/Notifications/index.tsx",
  "Advanced options": "Advanced options",
  "Routing Budget": "Routing Budget",
  "Use Lnproxy": "Use Lnproxy",
  "Server": "Server",
  "Proxy Budget": "Proxy Budget",
  "Submit invoice for {{amountSats}} Sats": "Submit invoice for {{amountSats}} Sats",
  "Invoice to wrap": "Invoice to wrap",
  "Wrapped invoice": "Wrapped invoice",
  "Payout Lightning Invoice": "Lightning Invoice สำหรับรับเหรียญ",
  "Wrap": "Wrap",
  "#71": "Phrases in components/Notifications/index.tsx",
  "Dark": "Dark",
  "Light": "Light",
  "Fiat": "Fiat",
  "Swaps": "Swaps",
  "Mainnet": "Mainnet",
  "Testnet": "Testnet",
  "#72": "Phrases in components/Notifications/index.tsx",
  "RoboSats - Simple and Private Bitcoin Exchange": "RoboSats - Simple and Private Bitcoin Exchange",
  "✅ Bond!": "✅ Bond!",
  "✅ Escrow!": "✅ Escrow!",
  "Order has been taken!": "Order has been taken!",
  "🥳 Taken!": "🥳 Taken!",
  "Order has expired": "Order has expired",
  "😪 Expired!": "😪 Expired!",
  "Order chat is open": "Order chat is open",
  "💬 Chat!": "💬 Chat!",
  "Trade finished successfully!": "Trade finished successfully!",
  "🙌 Funished!": "🙌 Funished!",
  "Lightning routing failed": "Lightning routing failed",
  "❗⚡ Routing Failed": "❗⚡ Routing Failed",
  "Order has been disputed": "Order has been disputed",
  "⚖️ Disputed!": "⚖️ Disputed!",
  "You won the dispute": "You won the dispute",
  "👍 dispute": "👍 dispute",
  "You lost the dispute": "You lost the dispute",
  "👎 dispute": "👎 dispute",
  "You can claim Sats!": "You can claim Sats!",
  "₿ Rewards!": "₿ Rewards!",
  "New chat message": "New chat message",
  "💬 message!": "💬 message!",
  "desktop_unsafe_alert": "ฟีเจอร์บางอย่างถูกระงับเพื่อปกปิดตัวตนของคุณ (เช่น การแชท) และคุณไม่สามารถทำการซื้อขายบิตคอยน์ได้ หากต้องการใช้งานทุกฟีเจอร์ของ RoboSats อย่างปลอดภัย กรุณาติดตั้ง <1>Tor Browser</1> และใช้งานผ่านเว็บไซต์ <3>Onion</3>",
  "phone_unsafe_alert": "คุณไม่สามารถซื้อขายได้ กรุณาใช้ <1>Tor Browser</1> และใช้งานผ่านเว็บไซต์ <3>Onion</3>",
  "rate_robosats": "คุณคิดอย่างไรกับ 🤖<1>RoboSats</1>⚡?",
  "let_us_know_hot_to_improve": "บอกเราว่าเราควรปรับปรุงอย่างไร (<1>Telegram</1> / <3>Github</3>)",
  "open_dispute": "คุณต้องรอก่อนจึงจะสามารถร้องเรียนได้ <1><1/>",
  "Waiting for maker bond": "Waiting for maker bond",
  "Public": "Public",
  "Waiting for taker bond": "Waiting for taker bond",
  "Cancelled": "Cancelled",
  "Expired": "Expired",
  "Waiting for trade collateral and buyer invoice": "Waiting for trade collateral and buyer invoice",
  "Waiting only for seller trade collateral": "Waiting only for seller trade collateral",
  "Waiting only for buyer invoice": "Waiting only for buyer invoice",
  "Sending fiat - In chatroom": "Sending fiat - In chatroom",
  "Fiat sent - In chatroom": "Fiat sent - In chatroom",
  "In dispute": "In dispute",
  "Collaboratively cancelled": "Collaboratively cancelled",
  "Sending satoshis to buyer": "Sending satoshis to buyer",
  "Sucessful trade": "Successful trade",
  "Failed lightning network routing": "Failed lightning network routing",
  "Wait for dispute resolution": "Wait for dispute resolution",
  "Maker lost dispute": "Maker lost dispute",
  "Taker lost dispute": "Taker lost dispute",
  "Invoice expired. You did not confirm publishing the order in time. Make a new order.": "Invoice expired. You did not confirm publishing the order in time. Make a new order.",
  "This order has been cancelled by the maker": "This order has been cancelled by the maker",
  "Invoice expired. You did not confirm taking the order in time.": "Invoice expired. You did not confirm taking the order in time.",
  "Invalid Order Id": "Invalid Order Id",
  "You must have a robot avatar to see the order details": "You must have a robot avatar to see the order details",
  "This order has been cancelled collaborativelly": "This order has been cancelled collaboratively",
  "This order is not available": "This order is not available",
  "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/reckless-satoshi/robosats/issues": "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/reckless-satoshi/robosats/issues"
}
