{
  "#1": "Phrases in basic/Main.tsx",
  "Using Testnet Bitcoin": "การใช้ Testnet Bitcoin",
  "#2": "Phrases in basic/BookPage/index.tsx",
  "Chart": "แผนภูมิ",
  "List": "รายการ",
  "Map": "แผนที่",
  "Search": "ค้นหา",
  "#3": "Phrases in basic/MakerPage/index.tsx",
  "Existing orders match yours!": "มีคำสั่งซื้อที่ตรงกันกับของคุณ!",
  "#4": "Phrases in basic/NavBar/AppBar/index.tsx",
  "Garage": "โรงรถ",
  "Offers": "ข้อเสนอ",
  "#5": "Phrases in basic/NavBar/DesktopBar/MoreTooltip.tsx",
  "Community and public support": "ชุมชนและการสนับสนุนสาธารณะ",
  "Exchange summary": "สรุปการแลกเปลี่ยน",
  "Learn RoboSats": "เรียนรู้การใช้งาน RoboSats",
  "RoboSats information": "ข้อมูล RoboSats",
  "client for nerds": "ไคลเอนต์สำหรับผู้ที่ชื่นชอบเทคโนโลยี",
  "#6": "Phrases in basic/NavBar/DesktopBar/index.tsx",
  "Create": "สร้าง",
  "More": "เพิ่มเติม",
  "Order": "รายการ",
  "Settings": "การตั้งค่า",
  "#7": "Phrases in basic/OrderPage/index.tsx",
  "Contract": "สัญญา",
  "Finish": "เสร็จสิ้น",
  "Publish": "เผยแพร่",
  "Setup": "การตั้งค่า",
  "Take": "รับ",
  "Trade": "ซื้อขาย",
  "Wait": "รอ",
  "#8": "Phrases in basic/RobotPage/Onboarding.tsx",
  "1. Generate a token": "1. สร้างโทเค็น",
  "2. Meet your robot identity": "2. พบกับตัวตนหุ่นยนต์ของคุณ",
  "3. Browse or create an order": "3. เรียกดูหรือสร้างคำสั่งซื้อ",
  "Building your robot!": "กำลังสร้างหุ่นยนต์ของคุณ!",
  "Continue": "ดำเนินการต่อ",
  "Generate token": "สร้างโทเค็น",
  "Hi! My name is": "สวัสดี! ฉันชื่อ",
  "If you need help on your RoboSats journey join our public support": "หากคุณต้องการความช่วยเหลือในการใช้ RoboSats เข้าร่วมการสนับสนุนสาธารณะของเรา",
  "RoboSats is a peer-to-peer marketplace. You can browse the public offers or create a new one.": "RoboSats เป็นตลาดแบบเพียร์ทูเพียร์ คุณสามารถเรียกดูข้อเสนอสาธารณะหรือสร้างข้อเสนอใหม่ได้",
  "See profile": "ดูโปรไฟล์",
  "SimpleX group": "SimpleX group",
  "Store it somewhere safe!": "เก็บรักษาไว้ในที่ปลอดภัย!",
  "This is your trading avatar": "นี่คืออวาตาร์การซื้อขายของคุณ",
  "This temporary key gives you access to a unique and private robot identity for your trade.": "คีย์ชั่วคราวนี้ให้คุณเข้าถึงตัวตนหุ่นยนต์ที่ไม่ซ้ำกันและเป็นส่วนตัวสำหรับการซื้อขายของคุณ",
  "You can also add your own random characters into the token or": "คุณยังสามารถเพิ่มอักขระสุ่มของคุณเองลงในโทเค็นหรือ",
  "or visit the robot school for documentation.": "ไปที่โรงเรียนหุ่นยนต์เพื่อดูเอกสารประกอบ",
  "roll again": "สุ่มใหม่",
  "#9": "Phrases in basic/RobotPage/RobotProfile.tsx",
  "Active order #{{orderID}}": "รายการที่ใช้งาน #{{orderID}}",
  "Add Robot": "เพิ่มหุ่นยนต์",
  "Building...": "กำลังสร้าง...",
  "Claim Rewards": "Claim Rewards",
  "Delete Robot": "ลบหุ่นยนต์",
  "Last order #{{orderID}}": "คำสั่งล่าสุด #{{orderID}}",
  "Looking for orders!": "กำลังมองหาคำสั่งซื้อ!",
  "No existing orders found": "ไม่พบคำสั่งซื้อที่มีอยู่",
  "Reusing trading identity degrades your privacy against other users, coordinators and observers.": "การใช้ตัวตนการซื้อขายซ้ำจะลดความเป็นส่วนตัวของคุณต่อผู้ใช้คนอื่น ผู้ประสานงานและผู้สังเกตการณ์",
  "Robot Garage": "โรงรถหุ่นยนต์",
  "Store your token safely": "รักษาโทเค็นของคุณให้ปลอดภัย",
  "#10": "Phrases in basic/RobotPage/TokenInput.tsx",
  "Copied!": "คัดลอกแล้ว!",
  "Not enough entropy, make it more complex": "ความซับซ้อนไม่เพียงพอ ทำให้ซับซ้อนมากขึ้น",
  "The token is too short": "โทเค็นสั้นเกินไป",
  "#11": "Phrases in basic/RobotPage/Welcome.tsx",
  "A Simple and Private LN P2P Exchange": "การแลกเปลี่ยน LN P2P ที่เรียบง่ายและเป็นส่วนตัว",
  "Create a new robot and learn to use RoboSats": "สร้างหุ่นยนต์ใหม่และเรียนรู้การใช้ RoboSats",
  "Fast Generate Order": "สร้างคำสั่งซื้ออย่างรวดเร็ว",
  "Recover an existing robot using your token": "กู้คืนหุ่นยนต์ที่มีอยู่โดยใช้โทเค็นของคุณ",
  "Recovery": "การกู้คืน",
  "Search for Orders": "Search for Orders",
  "Start": "เริ่ม",
  "#12": "Phrases in basic/SettingsPage/Coordinators.tsx",
  "Coordinators": "ผู้ประสานงาน",
  "#13": "Phrases in basic/TopBar/index.tsx",
  "You need to enable nostr to receive notifications.": "You need to enable nostr to receive notifications.",
  "#14": "Phrases in basic/TopBar/MenuDrawer/index.tsx",
  "Client info": "Client info",
  "Community": "ชุมชน",
  "Connected to Tor network": "เชื่อมต่อกับเครือข่าย Tor",
  "Connecting to Tor network": "กำลังเชื่อมต่อกับเครือข่าย Tor",
  "Connection error": "ข้อผิดพลาดการเชื่อมต่อ",
  "Initializing Tor daemon": "กำลังเริ่มใช้งาน Tor daemon",
  "RoboSats": "RoboSats",
  "#15": "Phrases in components/BookTable/BookControl.tsx",
  "ANY": "ทั้งหมด",
  "Buy": "ซื้อ",
  "DESTINATION": "ปลายทาง",
  "I want to": "ฉันต้องการ",
  "METHOD": "วิธีการ",
  "Select Host": "เลือกโฮสต์",
  "Select Order Type": "เลือกประเภทการสั่งซื้อ",
  "Select Payment Currency": "เลือกสกุลเงิน",
  "Select Payment Method": "เลือกวิธีการชำระเงิน",
  "Sell": "ขาย",
  "Swap In": "แลกเข้า",
  "Swap Out": "แลกออก",
  "and use": "และใช้",
  "hosted by": "จัดโดย",
  "pay with": "จ่ายด้วย",
  "#16": "Phrases in components/BookTable/index.tsx",
  "Add filter": "เพิ่มตัวกรอง",
  "Amount": "จำนวน",
  "An error occurred.": "เกิดข้อผิดพลาด",
  "And": "และ",
  "Be the first one to create an order": "เป็นคนแรกที่สร้างคำสั่งซื้อ",
  "Bond": "พันธบัตร",
  "Column title": "ชื่อคอลัมน์",
  "Columns": "คอลัมน์",
  "Currency": "สกุลเงิน",
  "Delete": "ลบ",
  "Destination": "ปลายทาง",
  "Expiry": "หมดอายุ",
  "Filter": "ตัวกรอง",
  "Filter value": "ค่าในตัวกรอง",
  "Find column": "ค้นหาคอลัมน์",
  "Hide": "ซ่อน",
  "Hide all": "ซ่อนทั้งหมด",
  "Is": "เป็น",
  "Logic operator": "ตัวดำเนินการทางตรรกศาสตร์",
  "Low bond: This maker has set a bond below the default {{defaultBond}}%. Lower bonds mean reduced trade security.": "Low bond: This maker has set a bond below the default {{defaultBond}}%. Lower bonds mean reduced trade security.",
  "Manage columns": "จัดการคอลัมน์",
  "Menu": "เมนู",
  "No orders found to buy BTC for {{currencyCode}}": "ไม่พบคำสั่งซื้อ BTC เป็น {{currencyCode}}",
  "No orders found to sell BTC for {{currencyCode}}": "ไม่พบคำสั่งขาย BTC เป็น {{currencyCode}}",
  "No results found.": "ไม่พบผลลัพธ์",
  "Operator": "ตัวดำเนินการ",
  "Or": "หรือ",
  "Others": "อื่นๆ",
  "Pay": "ชำระ",
  "Payment Method": "วิธีการชำระเงิน",
  "Premium": "พรีเมี่ยม",
  "Price": "ราคา",
  "Reorder column": "จัดระเบียบคอลัมน์ใหม่",
  "Robot": "หุ่นยนต์",
  "Sats now": "Sats ตอนนี้",
  "Select columns": "เลือกคอลัมน์",
  "Show all": "แสดงทั้งหมด",
  "Show columns": "แสดงคอลัมน์",
  "Show filters": "แสดงตัวกรอง",
  "Sort": "จัดเรียง",
  "Sort by ASC": "เรียงจากน้อยไปมาก",
  "Sort by DESC": "เรียงจากมากไปน้อย",
  "Timer": "เครื่องจับเวลา",
  "Unsort": "ยกเลิกการเรียงลำดับ",
  "Value": "ค่า",
  "any": "ใดๆ",
  "contains": "ประกอบด้วย",
  "ends with": "ลงท้ายด้วย",
  "equals": "เท่ากับ",
  "false": "เท็จ",
  "is": "คือ",
  "is after": "หลังจาก",
  "is any of": "เป็นใดๆ ของ",
  "is before": "ก่อนหน้า",
  "is empty": "ว่าง",
  "is not": "ไม่ใช่",
  "is not empty": "ไม่ว่าง",
  "is on or after": "ตรงหรือหลังจาก",
  "is on or before": "ตรงหรือก่อน",
  "no": "ไม่",
  "starts with": "เริ่มด้วย",
  "true": "จริง",
  "yes": "ใช่",
  "#17": "Phrases in components/Charts/DepthChart/index.tsx",
  "#18": "Phrases in components/Charts/MapChart/index.tsx",
  "Acknowledged": "ยืนยัน",
  "By doing so, you will be fetching map tiles from a third-party provider. Depending on your setup, private information might be leaked to servers outside the RoboSats federation.": "ด้วยการทำเช่นนี้ คุณจะสามารถดึงแผนที่จากผู้ให้บริการภายนอก ข้อมูลส่วนตัวอาจหลุดรั่วถึงเซิร์ฟเวอร์ที่อยู่นอกฟีดเดอเรชัน RoboSats ขึ้นอยู่กับการตั้งค่าของคุณ",
  "Close": "ปิด",
  "Download high resolution map?": "ดาวน์โหลดแผนที่ความละเอียดสูง?",
  "Show tiles": "แสดงไทล์",
  "#19": "Phrases in components/Charts/helpers/OrderTooltip/index.tsx",
  "#20": "Phrases in components/Dialogs/About.tsx",
  "(GitHub).": "(GitHub)",
  "(SimpleX)": "(SimpleX)",
  ". RoboSats developers will never contact you. The developers or the coordinators will definitely never ask for your robot token.": ". นักพัฒนา RoboSats จะไม่ติดต่อคุณ นักพัฒนาหรือผู้ประสานงานจะไม่ขอโทเค็นหุ่นยนต์ของคุณอย่างแน่นอน",
  "All of them as long as they are fast. You can write down your preferred payment method(s). You will have to match with a peer who also accepts that method. The step to exchange fiat has a expiry time of 24 hours before a dispute is automatically open. We highly recommend using instant fiat payment rails.": "ทั้งหมดตราบเท่าที่พวกเขาเร็วจงระบุวิธีการชำระเงินที่คุณชื่นชอบ คุณจะต้องจับคู่กับเพื่อนที่ยอมรับวิธีดังกล่าวเช่นกัน ขั้นตอนการแลกเปลี่ยน fiat มีระยะเวลาหมดอายุ 24 ชั่วโมงก่อนที่จะมีการเปิดข้อพิพาทโดยอัตโนมัติ เราขอแนะนำให้ใช้ rails การชำระเงิน fiat ที่รวดเร็ว",
  "Are there trade limits?": "มีขีดจำกัดการซื้อขายหรือไม่",
  "At no point, AnonymousAlice01 and BafflingBob02 have to entrust the bitcoin funds to each other. In case they have a conflict, the RoboSats coordinator will help resolving the dispute.": "ในกรณีที่มีข้อขัดแย้ง RoboSats ผู้ประสานงานจะช่วยแก้ข้อพิพาท",
  "Be aware your fiat payment provider might charge extra fees. In any case, the buyer bears the costs of sending fiat. That includes banking charges, transfer fees and foreign exchange spreads. The seller must receive exactly the amount stated in the order details.": "ผู้ซื้อเหรียญรับผิดชอบค่าธรรมเนียมทั้งหมด ผู้ขายต้องได้รับเงินตามจำนวนที่ระบุไว้ในคำสั่งซื้อ",
  "Disclaimer": "ข้อความปฏิเสธความรับผิดชอบ",
  "During a typical order, your trading peer is the only one who can potentially guess anything about you. Keep your chat short and concise. Avoid providing non-essential information other than strictly necessary for the fiat payment.": "ในคำสั่งซื้อมาตรฐาน คู่ค้าการค้าของคุณเป็นคนเดียวที่สามารถคาดเดาเกี่ยวกับคุณได้ จงรักษาการสนทนาให้สั้นและกระชับ หลีกเลี่ยงการให้ข้อมูลที่ไม่จำเป็นนอกเหนือจากที่จำเป็นสำหรับการชำระเงิน fiat",
  "Each RoboSats coordinator will set a maximum trade size to minimize the hassle of lightning routing failures. There is no limits to the number of trades per day. A robot can only have one order at a time. However, you can use multiple robots simultaneously using the Robot garage. Remember to back up your robot tokens!": "แต่ละ RoboSats Coordinator จะตั้งค่าขนาดการซื้อขายสูงสุดเพื่อลดความยุ่งยากที่เกิดจากความล้มเหลวในการกำหนดเส้นทางแล่นฟ้า ไม่มีการจำกัดจำนวนการซื้อขายต่อวัน หุ่นยนต์สามารถมีคำสั่งซื้อได้ครั้งละคำสั่งเท่านั้น อย่างไรก็ตาม คุณสามารถใช้หุ่นยนต์หลายตัวพร้อมกันได้โดยใช้โรงเก็บหุ่นยนต์ อย่าลืมสำรองโทเค็นหุ่นยนต์ของคุณ!",
  "How does it work?": "มันทำงานอย่างไร",
  "How it works": "มันทำงานอย่างไร",
  "How to use": "วิธีการใช้งาน",
  "In many countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply.": "In many countries using RoboSats is no different than using Ebay or Craiglist. Your regulation may vary. It is your responsibility to comply.",
  "Is RoboSats legal in my country?": "RoboSats ถูกกฎหมายในประเทศที่ฉันอยู่หรือไม่?",
  "Is RoboSats private?": "RoboSats มีความเป็นส่วนตัวหรือไม่?",
  "It is a BTC/FIAT peer-to-peer exchange over lightning.": "มันคือตลาดแลกเปลี่ยน BTC/FIAT แบบเพียร์ทูเพียร์ผ่านเครือข่ายสายฟ้า",
  "It simplifies matchmaking and minimizes the need of trust. RoboSats focuses in privacy and speed.": "มันทำให้ง่ายต่อการจับคู่และลดความจำเป็นในการเชื่อใจ RoboSats เน้นที่ความเป็นส่วนตัวและความรวดเร็ว",
  "Project source code": "รหัสโค้ดโครงการ",
  "RoboSats is a decentralized exchange with multiple, fully redundant, trade coordinators. The coordinator provides the infrastructure for your trade: mantains the intermediary lightning node, does book keeping, and relays your encrypted chat messages. The coordinator is also the judge in case your order enters a dispute. The coordinator is a trusted role, make sure you trust your coordinator by exploring its profile, webpage, social media and the comments from other users online.": "RoboSats is a decentralized exchange with multiple, fully redundant, trade coordinators. The coordinator provides the infrastructure for your trade: mantains the intermediary lightning node, does book keeping, and relays your encrypted chat messages. The coordinator is also the judge in case your order enters a dispute. The coordinator is a trusted role, make sure you trust your coordinator by exploring its profile, webpage, social media and the comments from other users online.",
  "RoboSats is an open source project ": "RoboSats เป็นโปรเจคเปิดโค้ด",
  "The RoboSats client, which you run on your local machine or browser, does not collect or share your IP address, location, name, or personal data. The client encrypts your private messages, which can only be decrypted by your trade partner.": "ไคลเอนต์ RoboSats ซึ่งคุณทำงานบนเครื่องหรือเบราว์เซอร์ในเครื่องของคุณจะไม่เก็บรวบรวมหรือแชร์ที่อยู่ IP ที่ตั้ง ชื่อ หรือข้อมูลส่วนบุคคลของคุณ ไคลเอนต์จะเข้ารหัสข้อความส่วนตัวของคุณ ซึ่งสามารถถอดรหัสได้โดยคู่ค้าของคุณเท่านั้น",
  "The coordinator you choose will maintain a database of pseudonymous robots and orders for the application to function correctly. You can further enhance your privacy by using proxy nodes or coinjoining.": "ผู้ประสานงานที่คุณเลือกจะดูแลฐานข้อมูลหุ่นยนต์ภายใต้นามแฝงและคำสั่งซื้อต่างๆ เพื่อให้แอปพลิเคชันทำงานถูกต้อง คุณสามารถเพิ่มความเป็นส่วนตัวเพิ่มเติมโดยใช้โหนดพร็อกซี่หรือการรวมเหรียญ",
  "The seller faces the same charge-back risk as with any other peer-to-peer service. Paypal or credit cards are not recommended.": "ผู้ขายมีความเสี่ยงต่อการเรียกเก็บเงินคืนเช่นเดียวกับบริการ peer-to-peer อื่นๆ ไม่แนะนำให้ใช้ Paypal หรือบัตรเครดิต",
  "The trade fee is collected by the robosats coordinator as a compensation for their service. You can see the fees of each coordinator by checking out their profile. The trade fee is split to be covered by both: the order maker and the order taker. Typically, the maker fee will be significantly smaller than the taker fee. In case an onchain address is used to received the Sats a variable swap fee applies. The onchain payout fee can also be seen in the profile of the coordinator.": "The trade fee is collected by the robosats coordinator as a compensation for their service. You can see the fees of each coordinator by checking out their profile. The trade fee is split to be covered by both: the order maker and the order taker. Typically, the maker fee will be significantly smaller than the taker fee. In case an onchain address is used to received the Sats a variable swap fee applies. The onchain payout fee can also be seen in the profile of the coordinator.",
  "This is an experimental application, things could go wrong. Trade small amounts!": "นี่คือแอพพลิเคชั่นที่ยังอยู่ในระหว่างการทดสอบ อาจมีสิ่งที่ผิดพลาด ค้าในจำนวนเล็กๆ",
  "This lightning application is provided as is. It is in active development: trade with the utmost caution. There is no private support. Support is only offered via public channels ": "แอพพลิเคชั่นนี้ให้มาเหมือนที่เป็น มันยังคงพัฒนา: ซื้อขายด้วยความระมัดระวังสูงสุด ไม่มีการสนับสนุนส่วนตัว การสนับสนุนมีให้เฉพาะผ่านช่องทางสาธารณะ",
  "What are the fees?": "มีค่าธรรมเนียมเท่าไร",
  "What are the risks?": "มีความเสี่ยงอะไรบ้าง",
  "What happens if my coordinator goes offline forever?": "จะเกิดอะไรขึ้นถ้าผู้ประสานงานของฉันออฟไลน์ไปตลอด",
  "What is RoboSats?": "RoboSats คืออะไร",
  "What is a coordinator?": "ผู้ประสานงานคืออะไร",
  "What is the trust model?": "รูปแบบของความเชื่อถือคืออะไร",
  "What payment methods are accepted?": "รับวิธีการชำระเงินแบบใดบ้าง",
  "You can also check the full guide in ": "คุณยังสามารถตรวจสอบคู่มือฉบับเต็มได้ที่",
  "You can build more trust on the RoboSats and coordinator infrastructure by inspecting the source code.": "คุณสามารถสร้างความเชื่อถือมากขึ้นใน RoboSats และโครงสร้างพื้นฐานของผู้ประสานงานได้โดยการตรวจสอบ source code",
  "You can find a step-by-step description of the trade pipeline in ": "คุณสามารถหารายละเอียดขั้นตอนต่าง ๆ ของการซื้อขายได้ที่",
  "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if the coordinator goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if the coordinator disappears. This window is usually about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels or directly to your trade coordinator using one of the contact methods listed on their profile.": "Your sats will return to you. Any hold invoice that is not settled would be automatically returned even if the coordinator goes down forever. This is true for both, locked bonds and trading escrows. However, there is a small window between the seller confirms FIAT RECEIVED and the moment the buyer receives the satoshis when the funds could be permanently lost if the coordinator disappears. This window is usually about 1 second long. Make sure to have enough inbound liquidity to avoid routing failures. If you have any problem, reach out trough the RoboSats public channels or directly to your trade coordinator using one of the contact methods listed on their profile.",
  "Your trade partner will not know the destination of the Lightning payment. The permanence of the data collected by the coordinators depend on their privacy and data policies. If a dispute arises, a coordinator may request additional information. The specifics of this process can vary from coordinator to coordinator.": "คู่ค้าของคุณจะไม่ทราบปลายทางของการชำระเงินทางสายฟ้า ความถาวรของข้อมูลที่รวบรวมโดยผู้ประสานงานจะขึ้นอยู่กับนโยบายความเป็นส่วนตัวและข้อมูลของพวกเขา หากมีข้อพิพาทเกิดขึ้น ผู้ประสานงานอาจขอข้อมูลเพิ่มเติมลักษณะเฉพาะของกระบวนการนี้จะแตกต่างกันไปในแต่ละผู้ประสานงาน",
  "#21": "Phrases in components/Dialogs/AddNewPaymentMethodDialog.tsx",
  "Add custom payment method": "เพิ่มวิธีการชำระเงินที่กำหนดเอง",
  "Add payment method": "เพิ่มรูปแบบการชำระเงิน",
  "Cancel": "ยกเลิก",
  "GitHub": "GitHub",
  "If you want to see it available, consider submitting a request on our ": "หากคุณต้องการให้มีบริการนี้ โปรดพิจารณาส่งคำขอผ่านทาง",
  "Payment method": "วิธีการชำระเงิน",
  "Use this free input to add any payment method you would like to offer.": "ใช้การป้อนข้อมูลนี้ฟรี เพื่อเพิ่มวิธีการชำระเงินที่คุณต้องการจะเสนอ",
  "#22": "Phrases in components/Dialogs/AuditPGP.tsx",
  "Go back": "ย้อนกลับ",
  "Keys": "คีย์",
  "Learn how to verify": "เรียนรู้วิธีการยืนยัน",
  "Messages": "ข้อความ",
  "PGP": "PGP",
  "Peer public key": "คีย์สาธารณะของคู่ค้า",
  "Save credentials as a JSON file": "บันทึกข้อมูลยืนยันตัวตนในรูปแบบไฟล์ JSON",
  "Save messages as a JSON file": "บันทึกข้อความในรูปแบบไฟล์ JSON",
  "The passphrase to decrypt your private key. Only you know it! Do not share. It is also your robot token.": "คำรหัสผ่านสำหรับถอดรหัสคีย์ส่วนตัวของคุณ ที่รู้มีแต่คุณเท่านั้น! ห้ามแชร์ มันยังเป็นโทเค็นของหุ่นยนต์ของคุณด้วย",
  "Your PGP public key. Your peer uses it to encrypt messages only you can read.": "คีย์สาธารณะ PGP ของคุณ คู่ค้าของคุณใช้ในการเข้ารหัสข้อความที่มีแค่คุณเท่านั้นที่อ่านได้",
  "Your communication is end-to-end encrypted with OpenPGP. You can verify the privacy of this chat using any tool based on the OpenPGP standard.": "การสื่อสารของคุณถูกเข้ารหัสแบบครบวงจรด้วย OpenPGP คุณสามารถตรวจสอบความเป็นส่วนตัวของแชทนี้ได้ด้วยเครื่องมือใดๆ ที่รองรับมาตรฐาน OpenPGP",
  "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.": "Your communication is end-to-end encrypted with secp256k1 schnorr signatures. You can verify the privacy of this chat using any nostr messages validation tool.",
  "Your encrypted private key": "คีย์ส่วนตัวที่เข้ารหัสของคุณ",
  "Your encrypted private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "คีย์ส่วนตัวที่เข้ารหัสของคุณ คุณใช้มันเพื่อถอดรหัสข้อความที่คู่ของคุณเข้ารหัสให้คุณ คุณยังใช้มันเพื่อเซ็นข้อความที่คุณส่ง",
  "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.": "Your nostr private key. You use it to decrypt the messages that your peer encrypted for you. You also use it to sign the messages you send.",
  "Your nostr public key. Your peer uses it to encrypt messages only you can read.": "Your nostr public key. Your peer uses it to encrypt messages only you can read.",
  "Your peer PGP public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "คีย์สาธารณะ PGP ของคู่ค้าของคุณ คุณใช้มันในการเข้ารหัสข้อความที่มีแค่เขาเท่านั้นที่อ่านได้และใช้ยืนยันว่าคู่ค้าของคุณเป็นคนลงชื่อในข้อความที่รับเข้ามา",
  "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.": "Your peer nostr public key. You use it to encrypt messages only he can read and to verify your peer signed the incoming messages.",
  "Your private key": "Your private key",
  "Your private key passphrase (keep secure!)": "คำรหัสผ่านของคีย์ส่วนตัวของคุณ (เก็บรักษาให้ปลอดภัย!)",
  "Your public key": "คีย์สาธารณะของคุณ",
  "nostr": "nostr",
  "#23": "Phrases in components/Dialogs/CancelOrder.tsx",
  "Back": "กลับ",
  "Cancel the order?": "จะยกเลิกรายการหรือไม่?",
  "Confirm cancellation": "ยืนยันการยกเลิก",
  "If the order is cancelled now but you already tried to pay the invoice, you might loose your bond.": "หากคำสั่งซื้อถูกยกเลิกตอนนี้ แต่คุณพยายามชำระใบแจ้งหนี้แล้ว คุณอาจสูญเสียพันธบัตรของคุณ",
  "#24": "Phrases in components/Dialogs/Client.tsx",
  "... somewhere on Earth!": "... ที่ไหนสักแห่งบนโลก!",
  "Made with": "สร้างโดย",
  "RoboSats client version": "เวอร์ชันของไคลเอนต์ RoboSats",
  "and": "และ",
  "#25": "Phrases in components/Dialogs/Community.tsx",
  "Follow RoboSats in Nostr": "ติดตาม RoboSats ใน Nostr",
  "Github Issues - The Robotic Satoshis Open Source Project": "ปัญหา GitHub - โครงการ Open Source ของ Robotic Satoshis",
  "Join RoboSats SimpleX group": "เข้าร่วมกลุ่ม RoboSats SimpleX",
  "Nostr Official Account": "บัญชีทางการของ Nostr",
  "RoboSats main public support": "สนับสนุนสาธารณะหลักของ RoboSats",
  "Support is only offered via SimpleX. Join our community if you have questions or want to hang out with other cool robots. Please, use our Github Issues if you find a bug or want to see new features!": "การสนับสนุนมีให้ผ่าน SimpleX เท่านั้น เข้าร่วมชุมชนของเราหากคุณมีคำถามหรือหากต้องการเข้าร่วมกับหุ่นยนต์สุดเท่คนอื่นๆ กรุณาใช้ Github Issues ของเราหากคุณเจอบั๊กหรืออยากเห็นฟีเจอร์ใหม่ๆ!",
  "Tell us about a new feature or a bug": "บอกเราเกี่ยวกับฟีเจอร์ใหม่หรือข้อบกพร่อง",
  "#26": "Phrases in components/Dialogs/Coordinator.tsx",
  "...Opening on Nostr gateway. Pubkey copied!": "...เปิดบน Nostr เกตเวย์ คีย์สาธารณะถูกคัดลอก!",
  "24h contracted volume": "ปริมาณตามสัญญา 24 ชั่วโมง",
  "24h non-KYC bitcoin premium": "พรีเมียมบิตคอยน์ที่ไม่ใช่ KYC 24 ชั่วโมง",
  "Book liquidity": "สภาพคล่องหนังสือ",
  "CLN version": "เวอร์ชัน CLN",
  "Client": "ลูกค้า",
  "Coordinator": "ผู้ประสานงาน",
  "Coordinator Notice": "ประกาศผู้ประสานงาน",
  "Coordinator commit hash": "คอมมิตแฮชของผู้ประสานงาน",
  "Coordinator description": "คำอธิบายผู้ประสานงาน",
  "Coordinator hosted web app": "เว็บแอปที่โฮสต์โดยผู้ประสานงาน",
  "Coordinator offline": "ผู้ประสานงานออฟไลน์",
  "Current onchain payout fee": "ค่าธรรมเนียมการจ่าย onchain ปัจจุบัน",
  "Current onchain payout status": "สถานะการจ่าย onchain ปัจจุบัน",
  "Development fund supporter: donates {{percent}}% to make RoboSats better.": "ผู้สนับสนุนกองทุนพัฒนา: บริจาค {{percent}}% เพื่อทำให้ RoboSats ดีขึ้น",
  "Does not have large trade limits.": "ไม่มีขีดจำกัดการซื้อขายขนาดใหญ่",
  "Download PGP Pubkey. Fingerprint: ": "ดาวน์โหลด PGP Pubkey ลายนิ้วมือ: ",
  "Established": "ก่อตั้ง",
  "Founder: coordinating trades since the testnet federation.": "ผู้ก่อตั้ง: ประสานงานการค้าเนื่องจากฟีดเดอเรชันทดสอบ",
  "Good OpSec: the coordinator follows best practices to protect his and your privacy.": "การดำเนินงานที่ดี: ผู้ประสานงานปฏิบัติตามแนวทางที่ดีที่สุดเพื่อปกป้องความเป็นส่วนตัวของเขาและของคุณ",
  "LN Node": "โหนด LN",
  "LND version": "เวอร์ชัน LND",
  "Large limits: the coordinator has large trade limits.": "ขีดจำกัดใหญ่: ผู้ประสานงานมีขีดจำกัดการค้าขนาดใหญ่",
  "Lifetime contracted volume": "ปริมาณสัญญาตลอดชั่วชีวิต",
  "Maker fee": "ค่าธรรมเนียมผู้สร้าง",
  "Market price sources (for multiple the median is calculated)": "แหล่งที่มาของราคาตลาด (สำหรับหลายรายการจะคำนวณค่ากลาง)",
  "Matrix channel copied! {{matrix}}": "ช่องเมทริกซ์ถูกคัดลอก! {{matrix}}",
  "Maximum onchain swap size": "ขนาดการสลับ onchain สูงสุด",
  "Maximum order size": "ขนาดคำสั่งซื้อตามคำสั่งสูงสุด",
  "Not a federation founder": "ไม่ใช่ผู้ก่อตั้งสหพันธ์",
  "Onchain payouts disabled": "การจ่าย onchain ถูกปิดใช้งาน",
  "Policies": "นโยบาย",
  "Public buy orders": "คำสั่งซื้อสาธารณะ",
  "Public sell orders": "คำสั่งขายด่วน",
  "Reddit": "Reddit",
  "RoboSats version": "เวอร์ชัน RoboSats",
  "Send Email": "ส่งอีเมล",
  "Simplex": "Simplex",
  "Stats for Nerds": "ข้อมูลสถิติสำหรับ Nerds",
  "Summary": "สรุป",
  "Taker fee": "ค่าธรรมเนียมผู้รับ",
  "Telegram": "Telegram",
  "The privacy practices of this coordinator could improve": "การปฏิบัติด้านความเป็นส่วนตัวของผู้ประสานงานนี้อาจดีขึ้น",
  "Today active robots": "หุ่นยนต์ที่ใช้งานในวันนี้",
  "Website": "เว็บไซต์",
  "X": "X",
  "Zaps voluntarily for development": "Zaps พัฒนาโดยสมัครใจ",
  "#27": "Phrases in components/Dialogs/DeleteRobotConfirmation.tsx",
  "Are you sure you want to permanently delete \"{{robotName}}\"?": "คุณแน่ใจว่าต้องการลบ \"{{robotName}}\" ถาวรหรือไม่",
  "Are you sure you want to permanently delete this robot?": "คุณแน่ใจว่าต้องการลบหุ่นยนต์นี้ถาวรหรือไม่",
  "Before deleting, make sure you have:": "ก่อนที่จะลบ ตรวจสอบให้แน่ใจว่าคุณมี:",
  "Delete Robot?": "ลบหุ่นยนต์หรือไม่?",
  "Exported any important data": "ส่งออกข้อมูลสำคัญทั้งหมด",
  "No active or pending orders": "ไม่มีคำสั่งซื้อที่ใช้งานหรืออยู่ระหว่างดำเนินการ",
  "Stored your robot token safely": "เก็บโทเค็นหุ่นยนต์ของคุณอย่างปลอดภัย",
  "⚠️ This action cannot be undone!": "⚠️ การกระทำนี้ไม่สามารถยกเลิกได้!",
  "#28": "Phrases in components/Dialogs/EnableTelegram.tsx",
  "Browser": "เบราว์เซอร์",
  "Enable": "เปิดใช้งาน",
  "Enable TG Notifications": "ใช้การแจ้งเตือน Telegram",
  "You will be taken to a conversation with RoboSats telegram bot. Simply open the chat and press Start. Note that by enabling telegram notifications you might lower your level of anonymity.": "คุณจะถูกนำเข้าสู่การสนทนากับบอท Telegram ของ RoboSats เพียงเปิดแชทและกดเริ่มต้น โปรดทราบว่าการเปิดใช้งานการแจ้งเตือน Telegram อาจทำให้ระดับการไม่เปิดเผยตัวตนของคุณลดลง",
  "#29": "Phrases in components/Dialogs/Exchange.tsx",
  "Enabled RoboSats coordinators": "เปิดใช้งานผู้ประสานงาน RoboSats",
  "Exchange Summary": "สรุปการแลกเปลี่ยน",
  "Online RoboSats coordinators": "ประสานงาน RoboSats ออนไลน์",
  "#30": "Phrases in components/Dialogs/F2fMap.tsx",
  "Choose a location": "เลือกตำแหน่งที่ตั้ง",
  "Save": "บันทึก",
  "#31": "Phrases in components/Dialogs/GoToOrder.tsx",
  "Order URL": "URL คำสั่งซื้อ",
  "Search order": "ค้นหาคำสั่งซื้อ",
  "#32": "Phrases in components/Dialogs/Learn.tsx",
  "You are about to visit Learn RoboSats. It hosts tutorials and documentation to help you learn how to use RoboSats and understand how it works.": "คุณกำลังจะเยี่ยมชมการเรียนรู้ RoboSats ซึ่งมีบทเรียนและเอกสารประกอบเพื่อช่วยคุณเรียนรู้วิธีใช้ RoboSats และเข้าใจการทำงาน",
  "#33": "Phrases in components/Dialogs/NoRobot.tsx",
  "Generate a robot avatar first. Then create your own order.": "สร้างอวาตาร์หุ่นยนต์ก่อน จากนั้นสร้างคำสั่งซื้อของคุณเอง",
  "You do not have a robot avatar": "คุณไม่มีอวาตาร์หุ่นยนต์",
  "#34": "Phrases in components/Dialogs/OrderDescription.tsx",
  "Order description": "Order description",
  "{{description}}": "{{description}}",
  "#35": "Phrases in components/Dialogs/Profile.tsx",
  "Coordinators that know your robot:": "ผู้ประสานงานที่รู้จักหุ่นยนต์ของคุณ:",
  "Your Robot": "หุ่นยนต์ของคุณ",
  "#36": "Phrases in components/Dialogs/Recovery.tsx",
  "Enter your robot token to re-build your robot and gain access to its trades.": "ป้อนโทเค็นหุ่นยนต์ของคุณเพื่อสร้างหุ่นยนต์ของคุณใหม่และเข้าถึงการซื้อขายของมัน",
  "Paste token here": "วางโทเค็นที่นี่",
  "Recover": "กู้คืน",
  "Robot recovery": "การกู้คืนหุ่นยนต์",
  "#37": "Phrases in components/Dialogs/Search.tsx",
  "Are you looking to sell your Bitcoins or buy some?": "Are you looking to sell your Bitcoins or buy some?",
  "Choose a currency": "Choose a currency",
  "Do you want to swap from on-chain into Lightning or vice versa?": "Do you want to swap from on-chain into Lightning or vice versa?",
  "Search for orders": "Search for orders",
  "Swap into LN": "Swap into LN",
  "Swap out of LN": "Swap out of LN",
  "You can specify the currency you want to use for your trade.": "You can specify the currency you want to use for your trade.",
  "#38": "Phrases in components/Dialogs/StoreToken.tsx",
  "Back it up!": "สำรองมันไว้!",
  "Done": "เสร็จสิ้น",
  "Store your robot token": "เก็บโทเค็นหุ่นยนต์ของคุณ",
  "You might need to recover your robot avatar in the future: store it safely. You can simply copy it into another application.": "คุณอาจต้องกู้คืนอวาตาร์หุ่นยนต์ในภายหลังได้: เก็บมันไว้อย่างปลอดภัย คุณสามารถคัดลอกมันไปยังแอปพลิเคชันอื่นได้ง่ายๆ",
  "#39": "Phrases in components/Dialogs/ThirdParty.tsx",
  "Third party description": "ลักษณะของบุคคลที่สาม",
  "#40": "Phrases in components/Dialogs/Update.tsx",
  "Download RoboSats {{coordinatorString}} APK from Github releases": "ดาวน์โหลด RoboSats {{coordinatorString}} APK จากการเผยแพร่ใน Github",
  "Go away!": "ไปไกลๆ!",
  "On Android RoboSats app ": "บนแอป RoboSats บน Android",
  "On Tor Browser client simply refresh your tab (click here or press Ctrl+Shift+R)": "ในไคลเอนต์เบราว์เซอร์ Tor เพียงรีเฟรชแท็บของคุณ (คลิกที่นี่หรือกด Ctrl+Shift+R)",
  "On remotely served browser client": "ในไคลเอนต์เบราว์เซอร์ที่ให้บริการทางไกล",
  "On your own soverign node": "บนโหนดของคุณเอง",
  "The RoboSats coordinator is on version {{coordinatorString}}, but your client app is {{clientString}}. This version mismatch might lead to a bad user experience.": "ผู้ประสานงานของ RoboSats อยู่ในเวอร์ชัน {{coordinatorString}} แต่แอปไคลเอนต์ของคุณคือ {{clientString}} การไม่ตรงกันของเวอร์ชันนี้อาจนำไปสู่ประสบการณ์ผู้ใช้ที่ไม่ดี",
  "Update your RoboSats client": "อัปเดตไคลเอนต์ RoboSats ของคุณ",
  "#41": "Phrases in components/Dialogs/VisitThirdParty.tsx",
  "Open external order": "เปิดคำสั่งซื้อภายนอก",
  "This order is not managed by a RoboSats coordinator. Please ensure you are comfortable with the privacy and trust trade-offs. You will open an external link or app": "คำสั่งซื้อนี้ไม่ได้รับการจัดการโดยผู้ประสานงาน RoboSats โปรดตรวจสอบให้แน่ใจว่าคุณรู้สึกสบายใจกับการแลกเปลี่ยนความเป็นส่วนตัวและความไว้วางใจ คุณจะเปิดลิงก์หรือแอปภายนอก",
  "#42": "Phrases in components/Dialogs/Warning.tsx",
  "Coordinators of p2p trades are the source of trust, provide the infrastructure, pricing and will mediate in case of dispute. Make sure you research and trust \"{{coordinator_name}}\" before locking your bond. A malicious p2p coordinator can find ways to steal from you.": "ผู้ประสานงานของการค้าขาย p2p เป็นแหล่งความไว้วางใจ ให้บริการโครงสร้างพื้นฐาน การตั้งราคา และจะเป็นตัวกลางในกรณีที่เกิดข้อพิพาท ตรวจสอบให้แน่ใจว่าคุณค้นคว้าและไว้วางใจ\"{{coordinator_name}}\"ก่อนที่จะลงนามพันธบัตรของคุณ ผู้ประสานงาน p2p ที่เป็นอันตรายสามารถหาวิธีขโมยจากคุณได้",
  "I understand": "ฉันเข้าใจ",
  "Warning": "คำเตือน",
  "#43": "Phrases in components/FederationTable/index.tsx",
  "Add Coordinator": "Add Coordinator",
  "Add coordinator": "Add coordinator",
  "Alias": "นามแฝง",
  "Alias already exists": "มีนามแฝงอยู่แล้ว",
  "Enabled": "เปิดการใช้งาน",
  "Invalid Onion URL": "URL ของ Onion ไม่ถูกต้อง",
  "No coordinators found.": "ไม่พบผู้ประสานงาน",
  "Rating": "การจัดอันดับ",
  "Reloading. Invalid ratings will be filtered.": "กำลังโหลดใหม่ การจัดอันดับที่ไม่ถูกต้องจะได้รับการกรอง",
  "URL": "URL",
  "Up": "ขึ้น",
  "Verify ratings": "ยืนยันการให้คะแนน",
  "Verifying all ratings might take some time; this window may freeze for a few seconds while the cryptographic certification is in progress.": "การยืนยันการจัดอันดับทั้งหมดอาจใช้เวลาสักครู่; หน้าต่างนี้อาจค้างไปชั่วขณะในขณะที่การรับรองเข้ารหัสดำเนินอยู่",
  "#44": "Phrases in components/HostAlert/SelfhostedAlert.tsx",
  "RoboSats client is served from your own node granting you the strongest security and privacy.": "ไคลเอนต์ RoboSats ให้บริการจากโหนดของคุณเองมอบความปลอดภัยและความเป็นส่วนตัวที่แข็งแกร่งที่สุดแก่คุณ",
  "You are self-hosting RoboSats": "คุณทำการโฮสต์ RoboSats เอง",
  "#45": "Phrases in components/HostAlert/UnsafeAlert.tsx",
  "You are not using RoboSats privately": "คุณไม่ได้ใช้ RoboSats แบบส่วนตัว",
  "#46": "Phrases in components/MakerForm/AmountRange.tsx",
  "From": "จาก",
  "to": "ถึง",
  "#47": "Phrases in components/MakerForm/MakerForm.tsx",
  " at a {{discount}}% discount": "ที่ส่วนลด {{discount}}%",
  " at a {{premium}}% premium": "ที่ค่าธรรมเนียม {{premium}}%",
  " at market price": "ที่ราคาตลาด",
  "Add New": "เพิ่มใหม่",
  "Add geolocation for a face to face trade": "เพิ่มตำแหน่งที่ตั้งสำหรับการซื้อขายแบบพบกัน",
  "Amount Range": "ช่วงจำนวน",
  "Amount of BTC to swap for LN Sats": "จำนวน BTC เพื่อลงสำหรับแลกเปลี่ยน LN Sats",
  "Amount of fiat to exchange for bitcoin": "จำนวนเฟียตที่จะแลกเปลี่ยนสำหรับ bitcoin",
  "Buy BTC for ": "ซื้อ BTC สำหรับ ",
  "Buy or Sell Bitcoin?": "คุณต้องการซื้อหรือขาย Bitcoin?",
  "Clear form": "ล้างแบบฟอร์ม",
  "Description": "คำอธิบาย",
  "Edit order": "แก้ไขคำสั่งซื้อ",
  "Enable advanced options": "เปิดใช้งานตัวเลือกขั้นสูง",
  "Enter the destination of the Lightning swap": "ป้อนปลายทางของ Lightning swap",
  "Escrow/Invoice Timer (HH:mm)": "เครื่องจับเวลา Escrow/ใบแจ้งหนี้ (HH:mm)",
  "Escrow/invoice step length": "ความยาวขั้นตอน Escrow/ใบแจ้งหนี้",
  "Estimated Bond": "เงินประกันโดยประมาณ",
  "Exact Amount": "จำนวนที่แน่นอน",
  "Face to Face Location": "ตำแหน่งที่ตั้งพบกัน",
  "Fiat Payment Method(s)": "วิธีการชำระเงินเฟียต",
  "Fidelity Bond Size": "ขนาดพันธบัตร Fidelity",
  "In or Out of Lightning?": "เข้าไปหรือออกจาก Lightning?",
  "Must be equal to or shorter than 240 characters": "Must be equal to or shorter than 240 characters",
  "Must be less than {{maxAmount}}": "ต้องน้อยกว่า {{maxAmount}}",
  "Must be less than {{max}}%": "ต้องน้อยกว่า {{max}}%",
  "Must be more than {{minAmount}}": "ต้องมากกว่า {{minAmount}}",
  "Must be more than {{min}}%": "ต้องมากกว่า {{min}}%",
  "Must be shorter than 65 characters": "ต้องสั้นกว่า 65 อักขระ",
  "Onchain amount to receive (BTC)": "จำนวน onchain ที่จะได้รับ (BTC)",
  "Onchain amount to send (BTC)": "จำนวน onchain ที่จะส่ง (BTC)",
  "Order current rate:": "อัตราปัจจุบันของคำสั่งซื้อ:",
  "Order for ": "สั่งซื้อสำหรับ",
  "Password": "รหัสผ่าน",
  "Please enter an amount.": "โปรดระบุจำนวนเงิน",
  "Please select a payment method.": "โปรดเลือกวิธีการชำระเงิน",
  "Please select if you want to buy or sell.": "โปรดเลือกว่าคุณต้องการซื้อหรือขาย",
  "Premium over Market (%)": "ค่าพรีเมี่ยมเหนือตลาด (%)",
  "Public Duration (HH:mm)": "ระยะเวลาเปิดเผยต่อสาธารณะ (ชม:นาที)",
  "Public order length": "ความยาวคำสั่งซื้อต่อสาธารณะ",
  "Sell BTC for ": "ขาย BTC สำหรับ ",
  "Set the skin-in-the-game, increase for higher safety assurance": "เลือกจำนวนที่จะเสี่ยง เพิ่มความปลอดภัยมากขึ้น",
  "Swap Destination(s)": "ปลายทางการสลับ",
  "Swap into LN ": "แลกเปลี่ยนเข้า LN ",
  "Swap of ": "การแลกเปลี่ยนของ ",
  "Swap out of LN ": "แลกเปลี่ยนออกจาก LN ",
  "Swap?": "แลกเปลี่ยน?",
  "The Bitcoin price is not synchronized.": "ราคา Bitcoin ไม่ได้รับการซิงโครไนซ์",
  "The amount is outside the allowed limits.": "จำนวนเงินอยู่นอกเหนือขีดจำกัดที่อนุญาต",
  "The amount must be greater than 0.": "จำนวนเงินต้องมากกว่า 0",
  "The amount range is not valid.": "ช่วงของจำนวนเงินไม่ถูกต้อง",
  "The coordinator is not available.": "ผู้ประสานงานไม่พร้อมใช้งาน",
  "The description is not valid.": "คำอธิบายไม่ถูกต้อง",
  "The payment method is not valid.": "วิธีการชำระเงินไม่ถูกต้อง",
  "The premium is not valid.": "ค่าพรีเมียมไม่ถูกต้อง",
  "The premium must be a number.": "ค่าพรีเมียมต้องเป็นตัวเลข",
  "To protect your privacy, the exact location you pin will be slightly randomized.": "เพื่อปกป้องความเป็นส่วนตัวของคุณ ตำแหน่งที่คุณปักจะถูกสุ่มใหม่",
  "You can add more details about your order.": "You can add more details about your order.",
  "You can optionally set a password so that only the robots you share it with can take this order.": "You can optionally set a password so that only the robots you share it with can take this order.",
  "You must fill the form correctly": "คุณต้องกรอกแบบฟอร์มอย่างถูกต้อง",
  "You receive approx {{swapSats}} LN Sats (fees might vary)": "คุณจะได้รับประมาณ {{swapSats}} LN Sats (ค่าธรรมเนียมอาจแตกต่างกัน)",
  "You send approx {{swapSats}} LN Sats (fees might vary)": "คุณส่งประมาณ {{swapSats}} LN Sats (ค่าธรรมเนียมอาจแตกต่างกัน)",
  "#48": "Phrases in components/MakerForm/SelectCoordinator.tsx",
  "Disabled": "ปิดการใช้งาน",
  "Loading coordinator info...": "Loading coordinator info...",
  "Maker": "ผู้สร้าง",
  "Not on-chain swaps.": "Not on-chain swaps.",
  "On-chain swaps.": "On-chain swaps.",
  "Onchain payouts enabled": "เปิดใช้งานการจ่าย onchain",
  "Taker": "ผู้รับ",
  "The provider the lightning and communication infrastructure. The host will be in charge of providing support and solving disputes. The trade fees are set by the host. Make sure to only select order hosts that you trust!": "The provider the lightning and communication infrastructure. The host will be in charge of providing support and solving disputes. The trade fees are set by the host. Make sure to only select order hosts that you trust!",
  "#49": "Phrases in components/OrderDetails/TakeButton.tsx",
  "Amount {{currencyCode}}": "จำนวน {{currencyCode}}",
  "Enter amount of fiat to exchange for bitcoin": "กรอกจำนวนเงินเฟียตเพื่อแลกเปลี่ยนกับ bitcoin",
  "Take Order": "ดำเนินคำสั่งซื้อต่อ",
  "Too high": "สูงเกินไป",
  "Too low": "ต่ำเกินไป",
  "Wait until you can take an order": "รอจนกว่าคุณจะสามารถรับคำสั่งซื้อได้",
  "You must specify an amount first": "คุณต้องระบุจำนวนก่อน",
  "You will receive {{satoshis}} Sats (Approx)": "คุณจะได้รับ {{satoshis}} Sats (โดยประมาณ)",
  "You will send {{satoshis}} Sats (Approx)": "คุณจะส่ง {{satoshis}} Sats (โดยประมาณ)",
  "#50": "Phrases in components/OrderDetails/index.tsx",
  "Accepted payment methods": "วิธีชำระเงินที่ยอมรับได้",
  "Amount of Satoshis": "จำนวน Satoshis",
  "Deposit": "ผู้ขายต้องวางเหรียญที่จะขายภายใน",
  "Expires in": "หมดอายุใน",
  "F2F location": "ตำแหน่งที่ตั้ง F2F",
  "ID": "ID",
  "If you receive a fiat transaction, it can be unilatery reverted up to 80 days after the trade has been completed.": "หากคุณได้รับธุรกรรมเงินสด อาจถูกยกเลิกฝ่ายเดียวได้ภายใน 80 วันหลังจากการซื้อขายเสร็จสมบูรณ์",
  "Order Details": "รายละเอียดคำสั่งซื้อ",
  "Order host": "โฮสต์คำสั่งซื้อ",
  "Penalty lifted, good to go!": "การลงโทษถูกยกเลิกแล้ว สามารถดำเนินการต่อได้!",
  "Premium over market price": "ค่าพรีเมียมจากราคาตลาด",
  "Price and Premium": "ราคาและค่าพรีเมียม",
  "Reversible payments": "Reversible payments",
  "Robosats and their coordinators have no control over the fiat system.": "Robosats and their coordinators have no control over the fiat system.",
  "Scammers can exploit this vulnerability in the fiat system to take away both your bitcoin and your fiat.": "Scammers can exploit this vulnerability in the fiat system to take away both your bitcoin and your fiat.",
  "Swap destination": "ปลายทางการแลกเปลี่ยน",
  "The order has expired": "คำสั่งซื้อนี้หมดอายุ",
  "The pinned location is approximate. The exact location for the meeting place must be exchanged in the encrypted chat.": "ตำแหน่งที่ปักหมุดเป็นค่าประมาณ สถานที่นัดพบที่แน่นอนต้องถูกแลกเปลี่ยนในแชทที่เข้ารหัส",
  "This order offers one or multiple payment methods that the community has consistently reported as reverting their transactions.": "คำสั่งซื้อนี้มีวิธีการชำระเงินหนึ่งหรือหลายวิธีที่ชุมชนรายงานอย่างต่อเนื่องว่าทำให้ธุรกรรมของพวกเขากลับคืนได้",
  "You cannot take an order yet! Wait {{timeMin}}m {{timeSec}}s": "คุณยังไม่สามารถรับคำสั่งซื้อได้! โปรดรอ {{timeMin}} นาที {{timeSec}} วินาที",
  "You receive via {{method}} {{amount}}": "คุณได้รับโดย {{method}} {{amount}}",
  "You receive {{amount}} Sats (Approx)": "คุณได้รับ {{amount}} Sats (โดยประมาณ)",
  "You send via Lightning {{amount}} Sats (Approx)": "คุณส่งผ่าน Lightning {{amount}} Sats (โดยประมาณ)",
  "You send via {{method}} {{amount}}": "คุณส่งโดย {{method}} {{amount}}",
  "{{price}} {{currencyCode}}/BTC - Premium: {{premium}}%": "{{price}} {{currencyCode}}/BTC - พรีเมียม: {{premium}}%",
  "#51": "Phrases in components/RobotInfo/index.tsx",
  "Active order!": "คำสั่งซื้อที่ใช้งานอยู่!",
  "Claim": "รับรางวัล",
  "Enable Telegram Notifications": "เปิดใช้การแจ้งเตือน Telegram",
  "Finished order": "Finished order",
  "Inactive order": "คำสั่งซื้อที่ไม่ใช้งาน",
  "Invoice for {{amountSats}} Sats": "ใบแจ้งหนี้สำหรับ {{amountSats}} Sats",
  "No active orders": "ไม่มีคำสั่งซื้อที่ใช้งานอยู่",
  "No orders found": "No orders found",
  "One active order #{{orderID}}": "มี 1 คำสั่งซื้อที่กำลังดำเนินการอยู่ #{{orderID}}",
  "Submit": "ส่งข้อมูล",
  "Telegram enabled": "เปิดใช้ Telegram แล้ว",
  "There it goes!": "นั่นไง!",
  "Use stealth invoices": "ใช้ใบแจ้งหนี้แบบลับ",
  "You do not have previous orders": "คุณไม่มีคำสั่งซื้อก่อนหน้านี้",
  "Your compensations": "ค่าชดเชยของคุณ",
  "Your current order": "คำสั่งซื้อปัจจุบันของคุณ",
  "Your last order #{{orderID}}": "คำสั่งซื้อสุดท้ายของคุณ #{{orderID}}",
  "#52": "Phrases in components/SettingsForm/index.tsx",
  "API": "API",
  "Build-in": "Build-in",
  "Dark": "มืด",
  "Light": "สว่าง",
  "Mainnet": "Mainnet",
  "Off": "Off",
  "On": "On",
  "Orbot": "Orbot",
  "Testnet": "Testnet",
  "#53": "Phrases in components/TradeBox/CancelButton.tsx",
  "Cancel order": "ยกเลิกคำสั่งซื้อ",
  "Copy URL": "คัดลอก URL",
  "Copy order URL": "คัดลอก URL คำสั่งซื้อ",
  "Unilateral cancelation (bond at risk!)": "การยกเลิกฝ่ายเดียว (พันธบัตรอยู่ในความเสี่ยง!)",
  "#54": "Phrases in components/TradeBox/CollabCancelAlert.tsx",
  "You asked for a collaborative cancellation": "คุณขอให้ยกเลิกร่วมกัน",
  "{{nickname}} is asking for a collaborative cancel": "{{nickname}} ขอให้คุณยกเลิกการซื้อขายร่วมกัน",
  "#55": "Phrases in components/TradeBox/TradeSummary.tsx",
  "Buyer": "ผู้ซื้อ",
  "Contract exchange rate": "อัตราแลกเปลี่ยนสัญญา",
  "Coordinator trade revenue": "รายได้จากการค้าประสานงาน",
  "Export trade summary": "ส่งออกสรุปการซื้อขาย",
  "Maker bond": "พันธบัตรผู้สร้าง",
  "Mining fee": "ค่าธรรมเนียมการขุด",
  "Onchain swap fee": "ค่าธรรมเนียมการสลับ onchain",
  "Received": "ได้รับแล้ว",
  "Routing budget": "งบประมาณการกำหนดเส้นทาง",
  "Seller": "ผู้ขาย",
  "Sent": "ส่งแล้ว",
  "Taker bond": "พันธบัตรผู้รับ",
  "Trade Summary": "สรุปการซื้อขาย",
  "Unlocked": "ปลดล็อกแล้ว",
  "User role": "บทบาทผู้ใช้",
  "{{bondSats}} Sats ({{bondPercent}}%)": "{{bondSats}} Sats ({{bondPercent}}%)",
  "{{miningFeeSats}} Sats": "{{miningFeeSats}} Sats",
  "{{revenueSats}} Sats": "{{revenueSats}} Sats",
  "{{routingFeeSats}} Sats": "{{routingFeeSats}} Sats",
  "{{swapFeeSats}} Sats ({{swapFeePercent}}%)": "{{swapFeeSats}} Sats ({{swapFeePercent}}%)",
  "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)": "{{tradeFeeSats}} Sats ({{tradeFeePercent}}%)",
  "#56": "Phrases in components/TradeBox/WalletsButton.tsx",
  "See Compatible Wallets": "ดูกระเป๋าเงินที่เข้ากันได้",
  "#57": "Phrases in components/TradeBox/Dialogs/ConfirmCancel.tsx",
  "Confirm Cancel": "ยืนยันการยกเลิก",
  "If the order is cancelled now you will lose your bond.": "หากคำสั่งซื้อถูกยกเลิกตอนนี้ คุณจะสูญเสียพันธบัตรของคุณ",
  "#58": "Phrases in components/TradeBox/Dialogs/ConfirmCollabCancel.tsx",
  "Accept Cancelation": "ยอมรับการยกเลิก",
  "Ask for Cancel": "ขอให้ยกเลิก",
  "Collaborative cancel the order?": "ร่วมกันยกเลิกคำสั่งซื้อนี้หรือไม่",
  "The trade escrow has been posted. The order can be cancelled only if both, maker and taker, agree to cancel.": "เอสโครว์การซื้อขายถูกโพสต์แล้ว สามารถยกเลิกคำสั่งซื้อได้ก็ต่อเมื่อทั้งผู้สร้างและผู้รับคำสั่งซื้อตกลงที่จะยกเลิก",
  "Your peer has asked for cancellation": "เพื่อนของคุณได้ขอให้ยกเลิก",
  "#59": "Phrases in components/TradeBox/Dialogs/ConfirmDispute.tsx",
  "Agree and open dispute": "เห็นด้วยและเปิดข้อโต้แย้ง",
  "Disagree": "ไม่เห็นด้วย",
  "Do you want to open a dispute?": "คุณต้องการเปิดข้อพิพาทหรือไม่?",
  "Make sure to EXPORT the chat log. The staff might request your exported chat log JSON in order to solve discrepancies. It is your responsibility to store it.": "ตรวจสอบให้แน่ใจว่าคุณส่งออกบันทึกการสนทนาไว้ เจ้าหน้าที่อาจขอ JSON ของบันทึกการสนทนาดังกล่าวเพื่อแก้ไขข้อผิดพลาดต่าง ๆ คุณต้องรับผิดชอบในการเก็บรักษามัน",
  "The RoboSats staff will examine the statements and evidence provided. You need to build a complete case, as the staff cannot read the chat. It is best to provide a burner contact method with your statement. The satoshis in the trade escrow will be sent to the dispute winner, while the dispute loser will lose the bond.": "ทีมงาน RoboSats จะตรวจสอบคำแถลงและหลักฐานที่ถูกส่งเข้ามา คุณจะต้องสร้างกรณีที่สมบูรณ์ เนื่องจากเจ้าหน้าที่ไม่สามารถอ่านการสนทนาได้ ควรให้วิธีการติดต่อสำรองพร้อมคำแถลงของคุณ Satoshis ในเอสโครว์การค้านี้จะถูกส่งไปยังผู้ชนะข้อพิพาท ในขณะที่ผู้แพ้ข้อพิพาทจะสูญเสียพันธบัตร",
  "#60": "Phrases in components/TradeBox/Dialogs/ConfirmFiatReceived.tsx",
  "Confirm": "ยืนยัน",
  "Confirming will finalize the trade.": "การยืนยันจะทำให้การค้าสำเร็จสิ้นสุดลง",
  "If you have received the payment and do not click confirm, you risk losing your bond.": "หากคุณได้รับการชำระเงินแล้วแต่ไม่ได้คลิกยืนยัน คุณอาจเสี่ยงที่จะสูญเสียพันธบัตรของคุณ",
  "Only confirm after {{amount}} {{currencyCode}} have arrived to your account.": "ยืนยันหลังจาก{{amount}} {{currencyCode}} ที่ได้รับมาถึงบัญชีของคุณเท่านั้น",
  "Some fiat payment methods might reverse their transactions up to 80 days after they are completed. Please keep this token and your order data in case you need to use them as proof.": "วิธีการชำระเงินบางอย่างอาจยกเลิกธุรกรรมได้ถึง 80 วันหลังจากดำเนินการเสร็จสิ้น โปรดเก็บโทเค็นนี้และข้อมูลคำสั่งซื้อของคุณไว้ในกรณีที่คุณต้องใช้เป็นหลักฐาน",
  "The satoshis in the escrow will be released to the buyer:": "satoshis ในเอสโครว์จะถูกปล่อยให้กับผู้ซื้อ:",
  "✅ Confirm you received {{amount}} {{currencyCode}}?": "✅ ยืนยันว่าคุณได้รับ {{amount}} {{currencyCode}}?",
  "#61": "Phrases in components/TradeBox/Dialogs/ConfirmFiatSent.tsx",
  "Confirming will allow your peer to finalize the trade.": "การยืนยันจะอนุญาตให้คู่ค้าของคุณทำการค้าสำเร็จสิ้นสุดลง",
  "If you have not yet sent it and you still proceed to falsely confirm, you risk losing your bond.": "หากคุณยังไม่ได้ส่งมันไปและยังคงดำเนินการยืนยันปลอม คุณอาจเสี่ยงที่จะสูญเสียพันธบัตรของคุณ",
  "✅ Confirm you sent {{amount}} {{currencyCode}}?": "✅ ยืนยันว่าคุณได้ส่ง {{amount}} {{currencyCode}}?",
  "#62": "Phrases in components/TradeBox/Dialogs/ConfirmUndoFiatSent.tsx",
  "READ. In case your payment to the seller has been blocked and it is absolutely impossible to finish the trade, you can revert your confirmation of \"Fiat sent\". Do so only if you and the seller have ALREADY AGREED in the chat to proceed to a collaborative cancellation. After confirming, the \"Collaborative cancel\" button will be visible again. Only click this button if you know what you are doing. First time users of RoboSats are highly discouraged from performing this action! Make 100% sure your payment has failed and the amount is in your account.": "อ่านกรณีที่การชำระเงินของคุณไปยังผู้ขายถูกบล็อกและมีการขัดจังหวะอย่างสิ้นเชิงไม่สามารถทำให้การค้าสำเร็จสิ้นสุดลงได้ คุณสามารถย้อนการยืนยันว่าฟิอัตถูกส่งไปแล้ว คุณทำสิ่งนี้เฉพาะเมื่อคุณกับผู้ขายตกลงในแชทว่าจะทำการยกเลิกร่วมกัน หลังจากยืนยันแล้ว ปุ่ม \"ยกเลิกร่วมกัน\" จะปรากฏขึ้นอีกครั้ง กดปุ่มนี้เฉพาะเมื่อคุณรู้ว่าสิ่งที่คุณกำลังทำคืออะไร ผู้ใช้ RoboSats ที่ใช้ครั้งแรกไม่ถูกแนะนำให้ทำการกระทำนี้! ตรวจสอบให้แน่ใจ 100% ว่าการชำระเงินของคุณล้มเหลวและจำนวนเงินอยู่ในบัญชีของคุณ",
  "Revert the confirmation of fiat sent?": "ย้อนยืนยันว่าส่งฟิอัตไปแล้วหรือไม่?",
  "Wait ({{time}})": "รอ ({{time}})",
  "#63": "Phrases in components/TradeBox/EncryptedChat/PrivacyWarningDialog.tsx",
  "Images are end-to-end encrypted, but they retain their original metadata (like GPS location). The recipient will be able to see this information. Please remove any sensitive data before uploading.": "Images are end-to-end encrypted, but they retain their original metadata (like GPS location). The recipient will be able to see this information. Please remove any sensitive data before uploading.",
  "Sensitive Data": "Sensitive Data",
  "#64": "Phrases in components/TradeBox/EncryptedChat/ChatHeader/index.tsx",
  "...waiting": "...รอ",
  "Peer": "คู่ค้า",
  "You": "คุณ",
  "connected": "เชื่อมต่อแล้ว",
  "disconnected": "ตัดการเชื่อมต่อแล้ว",
  "#65": "Phrases in components/TradeBox/EncryptedChat/EncryptedApiChat/index.tsx",
  "File too large. Maximum size is 10MB.": "File too large. Maximum size is 10MB.",
  "Only image files are allowed.": "Only image files are allowed.",
  "Type a message": "พิมพ์ข้อความ",
  "Waiting for peer...": "Waiting for peer...",
  "[Loading Encrypted Image]": "[Loading Encrypted Image]",
  "#66": "Phrases in components/TradeBox/EncryptedChat/EncryptedNostrChat/index.tsx",
  "Send": "ส่ง",
  "[Corrupted Image File]": "[Corrupted Image File]",
  "#67": "Phrases in components/TradeBox/EncryptedChat/EncryptedSocketChat/index.tsx",
  "#68": "Phrases in components/TradeBox/EncryptedChat/MessageCard/index.tsx",
  "Encrypted image": "Encrypted image",
  "Failed to decrypt image": "Failed to decrypt image",
  "Failed to display image": "Failed to display image",
  "Image hash verification failed": "Image hash verification failed",
  "#69": "Phrases in components/TradeBox/Forms/LightningPayout.tsx",
  "Advanced options": "ตัวเลือกขั้นสูง",
  "Invoice to wrap": "ใบแจ้งหนี้ที่จะห่อ",
  "Payout Lightning Invoice": "ใบแจ้งหนี้การจ่ายออกฟ้าแลบ",
  "Proxy Budget": "งบประมาณพร็อกซี",
  "Routing Budget": "งบประมาณการกำหนดเส้นทาง",
  "Server": "เซิร์ฟเวอร์",
  "Submit invoice for {{amountSats}} Sats": "ส่งใบแจ้งหนี้สำหรับ {{amountSats}} Sats",
  "Use Lnproxy": "ใช้ Lnproxy",
  "Wrap": "ห่อ",
  "Wrapped invoice": "ใบแจ้งหนี้ที่ห่อไว้",
  "#70": "Phrases in components/TradeBox/Forms/OnchainPayout.tsx",
  "Bitcoin Address": "ที่อยู่ Bitcoin",
  "Final amount you will receive": "จำนวนสุดท้ายที่คุณจะได้รับ",
  "Invalid": "ไม่ถูกต้อง",
  "Mining Fee": "ค่าธรรมเนียมการขุด",
  "RoboSats coordinator will do a swap and send the Sats to your onchain address.": "ผู้ประสานงาน RoboSats จะทำการสลับและส่ง Sats ไปยังที่อยู่ onchain ของคุณ",
  "Swap fee": "ค่าธรรมเนียมการสลับเปลี่ยน",
  "#71": "Phrases in components/TradeBox/Prompts/Chat.tsx",
  "Audit Chat": "Audit Chat",
  "Beware scams": "ระวังการหลอกลวง",
  "Collaborative Cancel": "ร่วมกันยกเลิกการซื้อขาย",
  "Confirm {{amount}} {{currencyCode}} received": "ยืนยันการรับ {{amount}} {{currencyCode}}",
  "Confirm {{amount}} {{currencyCode}} sent": "ยืนยันการส่ง {{amount}} {{currencyCode}}",
  "Export": "ส่งออก",
  "Open Dispute": "เปิดการโต้แย้ง",
  "Order options": "Order options",
  "Payment failed?": "การชำระเงินล้มเหลวหรือไม่?",
  "Say hi! Be helpful and concise. Let them know how to send you {{amount}} {{currencyCode}}.": "สวัสดีครับ! กรุณากระชับและเป็นประโยชน์ ให้อธิบายว่าควรที่จะส่ง {{amount}} {{currencyCode}} ให้คุณอย่างไร",
  "To open a dispute you need to wait": "การเปิดข้อพิพาทต้องรอการอนุมัติ",
  "Wait for the seller to confirm he has received the payment.": "รอให้ผู้ขายยืนยันว่าได้รับการชำระเงินแล้ว",
  "#72": "Phrases in components/TradeBox/Prompts/Dispute.tsx",
  "A contact method is required": "จำเป็นต้องมีวิธีการติดต่อ",
  "Attach chat logs": "แนบไดอารี่แชท",
  "Attaching chat logs helps the dispute resolution process and adds transparency. However, it might compromise your privacy.": "การแนบไดอารี่แชทช่วยกระบวนการแก้ไขข้อพิพาทและเสริมความโปร่งใส อย่างไรก็ตามอาจเสี่ยงที่จะเกิดปัญหาความเป็นส่วนตัว",
  "Contact method": "วิธีการติดต่อ",
  "Other": "อื่น ๆ",
  "Please, submit your statement. Be clear and specific about what happened and provide the necessary evidence. You MUST provide a contact method: burner email, SimpleX incognito link or telegram (make sure to create a searchable username) to follow up with the dispute solver (your trade host/coordinator). Disputes are solved at the discretion of real robots (aka humans), so be as helpful as possible to ensure a fair outcome.": "โปรดส่งคำแถลงของคุณ ให้ชัดเจนและเฉพาะเจาะจงเกี่ยวกับสิ่งที่เกิดขึ้นและให้หลักฐานที่จำเป็น คุณต้องให้วิธีการติดต่อ: อีเมลสำหรับ burner, ลิงก์ SimpSimpleX incognito หรือ telegram (ตรวจสอบให้แน่ใจว่าได้สร้างชื่อผู้ใช้งานที่ค้นหาได้) เพื่อติดตามกับผู้แก้ไขข้อพิพาท (โฮสต์การค้าหรือผู้ประสานงานของคุณ) ข้อพิพาทจะถูกแก้ไขตามดุลยพินิจของหุ่นยนต์จริง (หรือมนุษย์) ดังนั้นจงพยายามช่วยเท่าที่จะทำได้เพื่อให้แน่ใจว่าผลลัพธ์ยุติธรรม",
  "Select a contact method": "เลือกวิธีการติดต่อ",
  "Submit dispute statement": "ส่งคำแถลงการโต้แย้ง",
  "The statement is too short. Make sure to be thorough.": "ข้อความสั้นเกินไป ตรวจสอบให้แน่ใจว่าครอบคลุมทั้งหมด",
  "#73": "Phrases in components/TradeBox/Prompts/DisputeLoser.tsx",
  "Unfortunately you have lost the dispute. If you think this is a mistake you can ask to re-open the case by contacting your coordinator. If you think your coordinator was unfair, please fill a claim via email to robosats@protonmail.com": "คุณแพ้ข้อพิพาทแล้วน่าเสียดาย หากคุณคิดว่านี่เป็นข้อผิดพลาด คุณสามารถขอเปิดเคสใหม่โดยติดต่อผู้ประสานงานของคุณ ถ้าคุณคิดว่าผู้ประสานงานของคุณไม่เป็นธรรม กรุณากรอกข้อเรียกร้องทางอีเมลที่ robosats@protonmail.com",
  "#74": "Phrases in components/TradeBox/Prompts/DisputeWaitPeer.tsx",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself using that information if you contact your trade coordinator.": "โปรดบันทึกข้อมูลที่จำเป็นในการระบุคำสั่งซื้อและการชำระเงินของคุณ: หมายเลขคำสั่งซื้อ; payment hashes ของพันธบัตรหรือ escrow (ตรวจสอบในกระเป๋า lightning ของคุณ); จำนวน satoshis ที่แน่นอน; และชื่อเล่นของหุ่นยนต์ คุณจะต้องระบุตนเองโดยใช้ข้อมูลนี้หากคุณติดต่อผู้ประสานงานการค้าของคุณ",
  "We are waiting for your trade counterpart statement. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods.": "เรากำลังรอคำแถลงของคู่ค้าการค้าของคุณ หากคุณลังเลเกี่ยวกับสถานะของข้อพิพาทหรือหากต้องการเพิ่มข้อมูลเพิ่มเติม ให้ติดต่อผู้ประสานงานการค้าคำสั่งของคุณ (เจ้าภาพ) ผ่านหนึ่งในวิธีการติดต่อของพวกเขา",
  "#75": "Phrases in components/TradeBox/Prompts/DisputeWaitResolution.tsx",
  "Both statements have been received, wait for the staff to resolve the dispute. If you are hesitant about the state of the dispute or want to add more information, contact your order trade coordinator (the host) via one of their contact methods. If you did not provide a contact method, or are unsure whether you wrote it right, write your coordinator immediately.": "ได้รับคำแถลงทั้งสองแล้ว รอให้เจ้าหน้าที่แก้ไขข้อพิพาท หากคุณลังเลเกี่ยวกับสถานะของข้อพิพาทหรือหากต้องการเพิ่มข้อมูลเพิ่มเติม ให้ติดต่อผู้ประสานงานการค้าคำสั่งของคุณ (เจ้าภาพ) ผ่านหนึ่งในวิธีการติดต่อของพวกเขา หากคุณไม่ได้ให้วิธีการติดต่อ หรือไม่แน่ใจว่าคุณเขียนถูกหรือไม่ ให้เขียนถึงผู้ประสานงานของคุณทันที",
  "Please, save the information needed to identify your order and your payments: order ID; payment hashes of the bonds or escrow (check on your lightning wallet); exact amount of satoshis; and robot nickname. You will have to identify yourself as the user involved in this trade via email (or other contact methods).": "กรุณาจดบันทึกข้อมูลต่อไปนี้เพื่อใช้ในการระบุรายการซื้อขายที่มีการร้องเรียน: รหัสรายการซื้อขาย, รหัสธุรกรรม (payment hashes) ของการกักกันเหรียญใน bond (ตรวจสอบได้ในกระเป๋า lightning ของคุณ), จำนวน satoshis ใน bond และชื่อเล่นของโรบอทของคุณเพื่อให้คุณสามารถระบุตัวตนของคุณได้หากต้องติดต่อทีมงาน",
  "#76": "Phrases in components/TradeBox/Prompts/DisputeWinner.tsx",
  "You can claim the dispute resolution amount (escrow and fidelity bond) from your profile rewards. If there is anything the staff can help with, do not hesitate to contact to robosats@protonmail.com (or via your provided burner contact method).": "คุณสามารถรับเหรียญที่ได้จากการแก้ไขข้อพิพาทได้ที่ส่วนรางวัลในโปรไฟล์ของคุณ (สำหรับเหรียญที่กักกันไว้ในกระบวนการซื้อขาย) และหากต้องการความช่วยเหลือเพิ่มเติม สามารถติดต่อผ่านทาง robosats@protonmail.com (หรือช่องทางติดต่อที่คุณให้ไว้ก่อนหน้านี้)",
  "#77": "Phrases in components/TradeBox/Prompts/EscrowWait.tsx",
  "Just hang on for a moment. If the seller does not deposit, you will get your bond back automatically. In addition, you will receive a compensation (check the rewards in your profile).": "กรุณารอซักครู่ ถ้าผู้ขายไม่ยอมวางเหรียญ คุณจะได้รับเหรียญใน bond คืนโดยอัตโนมัติพร้อมค่าชดเชย (ตรวจสอบได้ในส่วนรางวัลในโปรไฟล์ของคุณ)",
  "We are waiting for the seller to lock the trade amount.": "เรากำลังรอผู้ขายวางเหรียญที่นำมาขาย",
  "#78": "Phrases in components/TradeBox/Prompts/Expired.tsx",
  "Enter a password again": "Enter a password again",
  "Renew Order": "เริ่มคำสั่งซื้อใหม่",
  "#79": "Phrases in components/TradeBox/Prompts/LockInvoice.tsx",
  "Copy to clipboard": "คัดลอกไปยังคลิปบอร์ด",
  "This is a hold invoice, it will freeze in your wallet. It will be charged only if you cancel or lose a dispute.": "นี่คือ hold invoice มันจะกักกันเหรียญของคุณใน wallet และจะตัดจ่ายเมื่อคุณยกเลิกรายการหรือแพ้ในการร้องเรียน",
  "This is a hold invoice, it will freeze in your wallet. It will be released to the buyer once you confirm to have received the {{currencyCode}}.": "นี่คือ hold invoice มันจะกักกันเหรียญของคุณใน wallet  เหรียญจะถูกส่งให้ผู้ซื้อเมื่อคุณยืนยันว่าคุณได้รับเงินเฟียต {{currencyCode}} ครบถ้วน",
  "#80": "Phrases in components/TradeBox/Prompts/Paused.tsx",
  "Unpause Order": "ยกเลิกการระงับคำสั่งซื้อ",
  "Your public order has been paused. At the moment it cannot be seen or taken by other robots. You can choose to unpause it at any time.": "คำสั่งซื้อของคุณถูกระงับ โรบอทอื่นไม่สามารถมองเห็นหรือรับคำสั่งซื้อได้ คุณสามารถยกเลิกการระงับได้ตลอดเวลา",
  "#81": "Phrases in components/TradeBox/Prompts/Payout.tsx",
  "Before letting you send {{amountFiat}} {{currencyCode}}, we want to make sure you are able to receive the BTC.": "ก่อนที่คุณจะส่ง {{amountFiat}} {{currencyCode}} เราต้องการแน่ใจว่าคุณสามารถรับ BTC ได้",
  "Lightning": "Lightning",
  "Onchain": "Onchain",
  "#82": "Phrases in components/TradeBox/Prompts/PayoutWait.tsx",
  "Just hang on for a moment. If the buyer does not cooperate, you will get back the trade collateral and your bond automatically. In addition, you will receive a compensation (check the rewards in your profile).": "กรุณารออีกซักครู่ ถ้าผู้ซื้อไม่ให้ความร่วมมือ คุณจะได้รับเหรียญที่นำมาวางและ bond คืนอัตโนมัติ และคุณจะได้รับชดเชยด้วย (ตรวจสอบได้ในส่วนรางวัลในโปรไฟล์ของท่าน)",
  "We are waiting for the buyer to post a lightning invoice. Once he does, you will be able to directly communicate the payment details.": "เรากำลังรอผู้ซื้อส่ง invoice รับเหรียญ หลังจากนั้น คุณจะสามารถแชทรายละเอียดการชำระเงินกับผู้ซื้อได้",
  "#83": "Phrases in components/TradeBox/Prompts/PublicWait.tsx",
  "Among public {{currencyCode}} orders (higher is cheaper)": "ท่ามกลางคำสั่งซื้อ{{currencyCode}} สาธารณะ (ยิ่งสูงยิ่งถูก)",
  "If the order expires untaken, your bond will return to you (no action needed).": "ถ้าคำสั่งซื้อของคุณไม่มีใครรับช่วงหมดอายุ คุณจะได้รับ bond คืนอัตโนมัติ",
  "Pause the public order": "ระงับคำสั่งซื้อสาธารณะ",
  "Premium rank": "ลำดับพรีเมียม",
  "Public orders for {{currencyCode}}": "คำสั่งซื้อสาธารณะสำหรับ {{currencyCode}}",
  "#84": "Phrases in components/TradeBox/Prompts/RoutingFailed.tsx",
  "Failure reason:": "สาเหตุที่ล้มเหลว:",
  "Next attempt in": "ลองใหม่ในอีก",
  "Retrying!": "กำลังลองใหม่!",
  "RoboSats will try to pay your invoice 3 times with a one minute pause in between. If it keeps failing, you will be able to submit a new invoice. Check whether you have enough inbound liquidity. Remember that lightning nodes must be online in order to receive payments.": "RoboSats จะลองจ่าย invoice ของคุณ 3 ครั้ง โดยจะพักครั้งละนาที หากยังล้มเหลว คุณจะสามารถส่ง invoice ใหม่ได้ ตรวจสอบว่าคุณมี inbound liquidity เพียงพอ และ lightning nodes ต้องออนไลน์เพื่อรับการชำระเงิน",
  "Your invoice has expired or more than 3 payment attempts have been made. Submit a new invoice.": "ใบแจ้งหนี้ของคุณหมดอายุหรือการพยายามชำระมากกว่า 3 ครั้ง กรุณาส่งใบแจ้งหนี้ใหม่",
  "#85": "Phrases in components/TradeBox/Prompts/SendingSats.tsx",
  "Lightning payments are usually instantaneous, but sometimes a node in the route may be down, which can cause your payout to take up to 24 hours to arrive in your wallet.": "โดยปกติการชำระเงินด้วย Lightning จะทันที แต่บางครั้งโหนดในเส้นทางอาจดับ ซึ่งอาจทำให้การจ่ายเงินของคุณใช้เวลาถึง 24 ชั่วโมงกว่าจะมาถึง wallet ของคุณ",
  "RoboSats is trying to pay your lightning invoice. Remember that lightning nodes must be online in order to receive payments.": "RoboSats กำลังชำระเงินให้กับใบแจ้งหนี้ lightning ของคุณ โปรดจำไว้ว่า lightning nodes ต้องออนไลน์เพื่อรับการชำระเงิน",
  "Taking too long?": "ใช้เวลานานหรือไม่?",
  "#86": "Phrases in components/TradeBox/Prompts/Successful.tsx",
  "Rate your host": "ให้คะแนนโฮสต์ของคุณ",
  "Rate your trade experience": "ให้คะแนนประสบการณ์การค้าของคุณ",
  "Renew": "เริ่มใหม่",
  "RoboSats gets better with more liquidity and users. Tell a bitcoiner friend about Robosats!": "RoboSats จะดียิ่งขึ้นเมื่อมีสภาพคล่องและผู้ใช้งานเพิ่มขึ้น บอกเพื่อนบิตคอยเนอร์ของคุณเกี่ยวกับ Robosats!",
  "Sending coins": "Sending coins",
  "Start Again": "เริ่มใหม่อีกครั้ง",
  "Thank you for using Robosats!": "ขอบคุณที่ใช้ Robosats!",
  "Thank you! {{shortAlias}} loves you too": "ขอบคุณ! {{shortAlias}} รักคุณเช่นกัน",
  "You need to enable nostr to rate your coordinator.": "คุณต้องเปิดใช้งาน nostr เพื่อให้คะแนนผู้ประสานงานของคุณ",
  "Your TXID": "TXID ของคุณ",
  "#87": "Phrases in components/TradeBox/Prompts/TakerFound.tsx",
  "Please wait for the taker to lock a bond. If the taker does not lock a bond in time, the order will be made public again.": "กรุณารอให้ผู้รับล็อกพันธบัตร ถ้าผู้รับล็อกพันธบัตรไม่ทันเวลา คำสั่งซื้อจะเปิดเป็นสาธารณะอีกครั้ง",
  "#88": "Phrases in pro/LandingDialog/index.tsx",
  "A robot technician has arrived!": "ช่างเทคนิคหุ่นยนต์มาถึงแล้ว!",
  "I bring my own robots, here they are. (Drag and drop workspace.json)": "ฉันนำหุ่นยนต์ของตัวเองมาด้วย นี่คือ (ลากแล้ววาง workspace.json)",
  "My first time here. Generate a new Robot Garage and extended robot token (xToken).": "ครั้งแรกของฉันที่นี่ สร้าง Robot Garage ใหม่และโทเค็นเพิ่มเติม (xToken)",
  "#89": "Phrases in pro/ToolBar/WidgetDrawer.tsx",
  "Click to add or remove widgets from your workspace": "Click to add or remove widgets from your workspace",
  "Select All": "Select All",
  "Widgets": "Widgets",
  "widgets active": "widgets active",
  "#90": "Phrases in pro/ToolBar/index.tsx",
  "Error importing workspace. Invalid file format.": "Error importing workspace. Invalid file format.",
  "Export Workspace": "Export Workspace",
  "Import Workspace": "Import Workspace",
  "Lock Layout": "Lock Layout",
  "Reset Layout": "Reset Layout",
  "Reset layout to default? This cannot be undone.": "Reset layout to default? This cannot be undone.",
  "Unlock Layout": "Unlock Layout",
  "Workspace imported successfully!": "Workspace imported successfully!",
  "unsafe_alert": "เพื่อปกป้องข้อมูลและความเป็นส่วนตัวของคุณเอง ใช้ <1>เบราว์เซอร์ Tor</1> และเข้าไปยังเว็บไซต์ <3>Onion</3> หรือโฮสต์ <5>ไคลเอ็นต์</5> ของคุณเอง",
  "let_us_know_hot_to_improve": "บอกให้เรารู้ว่าเราควรปรับปรุงอย่างไร (<1>Telegram</1> / <3>Github</3>)",
  "open_dispute": "คุณต้องรอก่อนจึงจะสามารถร้องเรียนได้ <1><1/>",
  "Waiting for maker bond": "กำลังรอผู้สร้างล็อกพันธบัตร",
  "Public": "สาธารณะ",
  "Waiting for taker bond": "กำลังรอผู้รับล็อกพันธบัตร",
  "Cancelled": "ยกเลิก",
  "Expired": "หมดอายุ",
  "Waiting for trade collateral and buyer invoice": "กำลังรอเงินประกันการขายและใบแจ้งหนี้จากผู้ซื้อ",
  "Waiting only for seller trade collateral": "รอเฉพาะเงินประกันจากผู้ขายเท่านั้น",
  "Waiting only for buyer invoice": "รอเฉพาะใบแจ้งหนี้จากผู้ซื้อเท่านั้น",
  "Sending fiat - In chatroom": "การส่งฟิอัต - ในห้องแชท",
  "Fiat sent - In chatroom": "ฟิอัตถูกส่ง - ในห้องแชท",
  "In dispute": "กำลังโต้แย้ง",
  "Collaboratively cancelled": "ยกเลิกโดยร่วมกัน",
  "Sending satoshis to buyer": "กำลังส่ง satoshis ไปยังผู้ซื้อ",
  "Successful trade": "การค้าสำเร็จ",
  "Failed lightning network routing": "ล้มเหลวในการกำหนดเส้นทางเครือข่าย lightning",
  "Wait for dispute resolution": "รอการแก้ไขข้อโต้แย้ง",
  "Maker lost dispute": "ผู้สร้างแพ้ข้อพิพาท",
  "Taker lost dispute": "ผู้รับแพ้ข้อพิพาท",
  "Invoice expired. You did not confirm publishing the order in time. Make a new order.": "ใบแจ้งหนี้หมดอายุ คุณไม่ได้ยืนยันการเผยแพร่คำสั่งซื้อตามเวลา สร้างคำสั่งซื้อใหม่",
  "This order has been cancelled by the maker": "คำสั่งซื้อนี้ถูกยกเลิกโดยผู้สร้าง",
  "Invoice expired. You did not confirm taking the order in time.": "ใบแจ้งหนี้หมดอายุ คุณไม่ได้ยืนยันการรับคำสั่งซื้อตามเวลา",
  "Invalid Order Id": "รหัสคำสั่งซื้อไม่ถูกต้อง",
  "You must have a robot avatar to see the order details": "คุณต้องมีอวาตาร์หุ่นยนต์เพื่อดูรายละเอียดคำสั่งซื้อ",
  "This order has been cancelled collaborativelly": "คำสั่งซื้อนี้ถูกยกเลิกโดยร่วมมือกัน",
  "This order is not available": "คำสั่งซื้อนี้ไม่สามารถใช้ได้",
  "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/RoboSats/robosats/issues": "The Robotic Satoshis working in the warehouse did not understand you. Please, fill a Bug Issue in Github https://github.com/RoboSats/robosats/issues"
}
